&НаСервереБезКонтекста
Функция ПолучитьДом(стрДома,ДатаОткрытия,СвойствоМКД = Неопределено,ЗначениеМКД = Истина)
	
	ДомСсылка = Справочники.ркДома.НайтиПоНаименованию(стрДома.Наименование,Истина);
	
	Если Не ЗначениеЗаполнено(ДомСсылка) Тогда
		Если ЗначениеЗаполнено(стрДома.Улица) Тогда
			УлицаСсылка = Справочники.ркУлицы.НайтиПоНаименованию(стрДома.Улица,Истина);
			Если УлицаСсылка.Пустая() Тогда 
				УлицаОбъект = Справочники.ркУлицы.СоздатьЭлемент();
				УлицаОбъект.Наименование = стрДома.Улица;
				Если НЕ ЗначениеЗаполнено(УлицаОбъект.Код) Тогда
					УлицаОбъект.УстановитьНовыйКод();
				КонецЕсли;
				УлицаОбъект.ОбменДанными.Загрузка = Истина;
				УлицаОбъект.Записать();
				УлицаСсылка = УлицаОбъект.Ссылка;
			КонецЕсли;
		Иначе
			УлицаСсылка = Справочники.ркУлицы.НайтиПоНаименованию("Служебная",Истина);
			Если УлицаСсылка.Пустая() Тогда 
				УлицаОбъект = Справочники.ркУлицы.СоздатьЭлемент();
				УлицаОбъект.Наименование = "Служебная";
				Если НЕ ЗначениеЗаполнено(УлицаОбъект.Код) Тогда
					УлицаОбъект.УстановитьНовыйКод();
				КонецЕсли;
				УлицаОбъект.ОбменДанными.Загрузка = Истина;
				УлицаОбъект.Записать();
				УлицаСсылка = УлицаОбъект.Ссылка;
			КонецЕсли;			
		КонецЕсли;
		Если ЗначениеЗаполнено(стрДома.УК) Тогда
			УКСсылка = Справочники.Контрагенты.НайтиПоНаименованию(стрДома.УК,Истина);
			Если УКСсылка.Пустая() Тогда
				УКОбъект = Справочники.Контрагенты.СоздатьЭлемент();
				УКОбъект.Наименование = стрДома.УК;
				Если НЕ ЗначениеЗаполнено(УКОбъект.Код) Тогда
					УКОбъект.УстановитьНовыйКод();
				КонецЕсли;
				УКОбъект.ОбменДанными.Загрузка = Истина;
				УКОбъект.Записать();
				УКСсылка = УКОбъект.Ссылка;
			КонецЕсли;
		Иначе
			УКСсылка = Справочники.Контрагенты.НайтиПоНаименованию("Служебный",Истина);
			Если УКСсылка.Пустая() Тогда
				УКОбъект = Справочники.Контрагенты.СоздатьЭлемент();
				УКОбъект.Наименование = "Служебный";
				Если НЕ ЗначениеЗаполнено(УКОбъект.Код) Тогда
					УКОбъект.УстановитьНовыйКод();
				КонецЕсли;
				УКОбъект.ОбменДанными.Загрузка = Истина;
				УКОбъект.Записать();
				УКСсылка = УКОбъект.Ссылка;
			КонецЕсли;
		КонецЕсли;
		Если ДомСсылка.Пустая() Тогда 
			ДомОбъект = Справочники.ркДома.СоздатьЭлемент();
			ДомОбъект.Наименование = стрДома.Наименование;
			ДомОбъект.Корпус = стрДома.Корпус;
			ДомОбъект.Номер = стрДома.Номер;
			ДомОбъект.ДатаПостановкиНаУчет 	= СтрДома.ДатаПостановкиНаУчет;
			ДомОбъект.ДатаСнятияСУчета 		= СтрДома.ДатаСнятияСУчета;
			ДомОбъект.Владелец = УлицаСсылка;
			ДомОбъект.УК = УКСсылка;
			Если НЕ ЗначениеЗаполнено(ДомОбъект.Код) Тогда
				ДомОбъект.УстановитьНовыйКод();
			КонецЕсли;
			Если СвойствоМКД <> Неопределено Тогда
				СтрокаТЧ = ДомОбъект.ДополнительныеРеквизиты.Добавить();
				СтрокаТЧ.Свойство = СвойствоМКД;
				СтрокаТЧ.Значение = ЗначениеМКД;
			КонецЕсли;
			
			СтрокаТЧ = ДомОбъект.ДополнительныеРеквизиты.Добавить();
			СтрокаТЧ.Свойство = СтрДома.СвойствоИсходныйКод;
			СтрокаТЧ.Значение = СокрЛП(СтрДома.ДомКод);
			
			ДомОбъект.ОбменДанными.Загрузка = Истина;
			ДомОбъект.Записать();
			ДомСсылка = ДомОбъект.Ссылка;
		КонецЕсли;

	КонецЕсли;
	
	Возврат ДомСсылка;	
	
КонецФункции

&НаСервере
Функция ПолучитьКонстантыОбработки()

	КонстантыОбработки = Новый Структура();	
	КонстантыОбработки.Вставить("ТипПомещенияКвартира",Справочники.ркТипыПомещений.НайтиПоНаименованию("квартира",Истина));
	КонстантыОбработки.Вставить("ВидРасчетаЭлектроэнергия",Справочники.ркВидыРасчетов.НайтиПоНаименованию("Электроэнергия",Истина));
	КонстантыОбработки.Вставить("ВидРасчетаПовышающийКоэффициент",Справочники.ркВидыРасчетов.НайтиПоНаименованию("Электроэнергия повышающий коэффициент",Истина));
	
	КонстантыОбработки.Вставить("ВидПоказанийОбычные",Справочники.ркВидыПоказанийСчетчиков.Обычные);
	КонстантыОбработки.Вставить("КубМетр",Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("113",Истина));
	КонстантыОбработки.Вставить("Квтч",Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("245",Истина));
	КонстантыОбработки.Вставить("Человек",Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("792",Истина));
	КонстантыОбработки.Вставить("ЕдиницаКоличествоПроживающих",Справочники.ркЕдиницыРасчета.НайтиПоНаименованию("Количество проживающих",Истина));
	КонстантыОбработки.Вставить("ЕдиницаСчетчик",Справочники.ркЕдиницыРасчета.НайтиПоНаименованию("Счетчик",Истина));
	КонстантыОбработки.Вставить("Организация",Организация);
	КонстантыОбработки.Вставить("Поставщик",Справочники.Контрагенты.НайтиПоНаименованию("АЭСК",Истина));
	КонстантыОбработки.Вставить("УКНепосредственноеУправление",Справочники.Контрагенты.НайтиПоНаименованию("Непосредственное управление",Истина));
	КонстантыОбработки.Вставить("ВидПерерасчетаСреднее",Справочники.рцВидыПерерасчета.НайтиПоНаименованию("Среднее"));
	КонстантыОбработки.Вставить("ВидПерерасчетаСреднееПоНормативу",Справочники.рцВидыПерерасчета.НайтиПоНаименованию("Среднее по нормативу"));
	
	КонстантыОбработки.Вставить("СвойствоДатаПоверки",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ДатаПоверки);
	//КонстантыОбработки.Вставить("СвойствоДатаПроверки",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ДатаПроверки);
	КонстантыОбработки.Вставить("СвойствоМежповерочныйИнтервал",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.МежповерочныйИнтервал);	
	КонстантыОбработки.Вставить("КоличествоЧеловекНормы",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Количество проживающих",Истина));
	КонстантыОбработки.Вставить("КоличествоКомнатНормы",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Количество комнат",Истина));
	КонстантыОбработки.Вставить("МКДНормы",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("МКД (Виды норм)",Истина));
	КонстантыОбработки.Вставить("МОПНормы",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("МОП (Виды норм)",Истина));
	КонстантыОбработки.Вставить("ТипПлитыНормы",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Тип плиты",Истина));
	КонстантыОбработки.Вставить("СвойствоНомерДоговора",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Номер договора (Лицевой счет)",Истина));
	КонстантыОбработки.Вставить("СвойствоОтдельныйВвод",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Отдельный ввод (Лицевой счет)",Истина));
	КонстантыОбработки.Вставить("СвойствоОтключен",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Отключен (Счетчик)",Истина));
	КонстантыОбработки.Вставить("СвойствоУчаствуетВМОП",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Участвует в МОП (Лицевой счет)",Истина));
	КонстантыОбработки.Вставить("СвойствоТипПрибораУчета",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Тип прибора учета (Счетчик)",Истина));
	КонстантыОбработки.Вставить("СвойствоНомерПломбы",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Номер пломбы (Счетчик)",Истина));
	КонстантыОбработки.Вставить("СвойствоДатаУстановки",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Дата установки (Счетчик)",Истина));
	КонстантыОбработки.Вставить("СвойствоЕИРЦНомерПУ",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("ЕИРЦ номер ПУ (Счетчик)",Истина));
	КонстантыОбработки.Вставить("СвойствоЭтажность",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Этажность (Дом)",Истина));
	КонстантыОбработки.Вставить("СвойствоКоэффициент",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.КоэффициентТрансформации);
	КонстантыОбработки.Вставить("СвойствоПлощадь",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ОбщаяПлощадьЛицевогоСчета);
	КонстантыОбработки.Вставить("СвойствоВидЭнергоназначений",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Вид энергоназначений (Счетчик)",Истина));	
	КонстантыОбработки.Вставить("СвойствоПлощадьМОП",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Площадь МОП (Дом)",Истина));	
	КонстантыОбработки.Вставить("СвойствоФормаУправления");
	тСвойствоФормаУправления = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Форма управления",Истина);
	КонстантыОбработки.СвойствоФормаУправления = тСвойствоФормаУправления;
	КонстантыОбработки.Вставить("СвойствоНомерДоговораДома");
	тСвойствоНомерДоговораДома = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Номер договора дома",Истина);	
	КонстантыОбработки.СвойствоНомерДоговораДома = тСвойствоНомерДоговораДома;
	КонстантыОбработки.Вставить("СвойствоИсходныйКод",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Исходный код",Истина));	
	КонстантыОбработки.Вставить("СтатусУчастияВРасчетахСнято",Справочники.ркСтатусыУчастияВРасчетах.НайтиПоНаименованию("Снято",Истина));	
	
	Возврат КонстантыОбработки;

КонецФункции // ПолучитьКонстантыОбработки()


&НаСервере
Процедура ПрочитатьСвойстваНаСервере(пАдрес)
	
	ФайлПриемник = ПолучитьИмяВременногоФайла("dat");
	ДанныеХранилища = ПолучитьИзВременногоХранилища(пАдрес);
	ДанныеХранилища.Записать(ФайлПриемник);
	
	//сначала свойства, которые используются для видов норм
	ПараметрыОтбора = Новый Структура("Наименование", "КоличествоКомнат");
	Если РеквизитыЛицевыхСчетов.НайтиСтроки(ПараметрыОтбора).Количество()=0 Тогда
		НоваяСтрока = РеквизитыЛицевыхСчетов.Добавить();
		НоваяСтрока.Наименование = "КоличествоКомнат";
	КонецЕсли;				
	ПараметрыОтбора = Новый Структура("Наименование", "КоличествоПрописанных");
	Если РеквизитыЛицевыхСчетов.НайтиСтроки(ПараметрыОтбора).Количество()=0 Тогда
		НоваяСтрока = РеквизитыЛицевыхСчетов.Добавить();
		НоваяСтрока.Наименование = "КоличествоПрописанных";
	КонецЕсли;				
	ПараметрыОтбора = Новый Структура("Наименование", "ТипПлиты");
	Если РеквизитыЛицевыхСчетов.НайтиСтроки(ПараметрыОтбора).Количество()=0 Тогда
		НоваяСтрока = РеквизитыЛицевыхСчетов.Добавить();
		НоваяСтрока.Наименование = "ТипПлиты";
	КонецЕсли;	
	ПараметрыОтбора = Новый Структура("Наименование", "МКД");
	Если РеквизитыЛицевыхСчетов.НайтиСтроки(ПараметрыОтбора).Количество()=0 Тогда
		НоваяСтрока = РеквизитыЛицевыхСчетов.Добавить();
		НоваяСтрока.Наименование = "МКД";
	КонецЕсли;	
	//ПараметрыОтбора = Новый Структура("Наименование", "МОП");
	//Если РеквизитыЛицевыхСчетов.НайтиСтроки(ПараметрыОтбора).Количество()=0 Тогда
	//	НоваяСтрока = РеквизитыЛицевыхСчетов.Добавить();
	//	НоваяСтрока.Наименование = "МОП";
	//КонецЕсли;	

	
	ДомаТЗ = ЗначениеИзФайла(ФайлПриемник);
	Для Каждого стрДом Из ДомаТЗ Цикл
		
		Для Каждого стрДопРеквизиты ИЗ стрДом.ДопРеквизиты Цикл
			//свойства домов
			ПараметрыОтбора = Новый Структура("Наименование", стрДопРеквизиты.Свойство);
			Если ЗначениеЗаполнено(стрДопРеквизиты.Свойство) И РеквизитыДомов.НайтиСтроки(ПараметрыОтбора).Количество()=0 Тогда
				НоваяСтрока = РеквизитыДомов.Добавить();
				НоваяСтрока.Наименование = стрДопРеквизиты.Свойство;
			КонецЕсли;
		КонецЦикла;
		Если стрДом.ЛС = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого стрЛС ИЗ стрДом.ЛС Цикл
			Если стрЛС.ДопРеквизитыЛС = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Для Каждого стрДопРеквизитыЛС Из стрЛС.ДопРеквизитыЛС Цикл
				ПараметрыОтбора = Новый Структура("Наименование", стрДопРеквизитыЛС.Свойство);
				Если ЗначениеЗаполнено(стрДопРеквизитыЛС.Свойство) И РеквизитыЛицевыхСчетов.НайтиСтроки(ПараметрыОтбора).Количество()=0 Тогда
					НоваяСтрока = РеквизитыЛицевыхСчетов.Добавить();
					НоваяСтрока.Наименование = стрДопРеквизитыЛС.Свойство;
				КонецЕсли;				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НайтиСвойствоДома(пИмяСвойства)

	ПараметрыОтбора = Новый Структура("Наименование", пИмяСвойства);
	НайденныеСтроки = РеквизитыДомов.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество()=0 Тогда
		Возврат ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПустаяСсылка();
	Иначе
		Возврат НайденныеСтроки[0].Свойство;
	КонецЕсли;

КонецФункции

&НаСервере
Функция НайтиСвойствоЛС(пИмяСвойства)

	ПараметрыОтбора = Новый Структура("Наименование", пИмяСвойства);
	НайденныеСтроки = РеквизитыЛицевыхСчетов.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество()=0 Тогда
		Возврат ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПустаяСсылка();
	Иначе
		Возврат НайденныеСтроки[0].Свойство;
	КонецЕсли;

КонецФункции


&НаСервере
Функция ПолучитьЗначениеСвойства(пСвойство,пЗначение)
	
	Результат = Неопределено;
	Если пЗначение = NULL Тогда
		Возврат Результат;
	КонецЕсли;
	МассивТипов = пСвойство.ТипЗначения.Типы();
	Если МассивТипов.Найти(Тип("СправочникСсылка.ЗначенияСвойствОбъектов"))<>Неопределено Тогда
		Результат = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(пЗначение,Истина,,пСвойство);
		Если Результат.Пустая() Тогда
			НовоеЗначение = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
			НовоеЗначение.Владелец = пСвойство;
			НовоеЗначение.Наименование = пЗначение;
			НовоеЗначение.Записать();
			Результат = НовоеЗначение.Ссылка;
		КонецЕсли;
	ИначеЕсли МассивТипов.Найти(Тип("Строка"))<>Неопределено Тогда		
		Результат = Строка(пЗначение);
	ИначеЕсли МассивТипов.Найти(Тип("Дата"))<>Неопределено Тогда
		Результат = Дата(пЗначение);
	ИначеЕсли МассивТипов.Найти(Тип("Число"))<>Неопределено Тогда
		Результат = Число(пЗначение);
	ИначеЕсли МассивТипов.Найти(Тип("Булево"))<>Неопределено Тогда
		Результат = Булево(пЗначение);
	КонецЕсли;
	
	Возврат Результат;
	
		
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТЗПоказаний()

	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ВидПоказаний",Новый ОписаниеТипов("СправочникСсылка.ркВидыПоказанийСчетчиков"));
	ТЗ.Колонки.Добавить("ДатаНачала",Новый ОписаниеТипов("Дата",Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТЗ.Колонки.Добавить("ОтчетныйПериод",Новый ОписаниеТипов("Дата",Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТЗ.Колонки.Добавить("ДатаОкончания",Новый ОписаниеТипов("Дата",Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТЗ.Колонки.Добавить("Дом",Новый ОписаниеТипов("СправочникСсылка.ркДома"));
	ТЗ.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,3)));
	ТЗ.Колонки.Добавить("ЛицевойСчет",Новый ОписаниеТипов("СправочникСсылка.ркЛицевыеСчета"));
	ТЗ.Колонки.Добавить("НачальноеКоличество",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,3)));
	ТЗ.Колонки.Добавить("КонечныеПоказания",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,3)));
	ТЗ.Колонки.Добавить("ПериодДействия",Новый ОписаниеТипов("Дата",Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТЗ.Колонки.Добавить("Помещение",Новый ОписаниеТипов("СправочникСсылка.ркПомещения"));
	ТЗ.Колонки.Добавить("Счетчик",Новый ОписаниеТипов("СправочникСсылка.ркСчетчики"));
	ТЗ.Колонки.Добавить("КодСчетчика",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(9)));
	ТЗ.Колонки.Добавить("Сброс",Новый ОписаниеТипов("Булево"));
	
	Возврат ТЗ;	

КонецФункции // ПолучитьТЗПоказаний()

&НаСервереБезКонтекста
Функция ПолучитьТЗПоказанийГПУ()

	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ПериодПоказаний",Новый ОписаниеТипов("Дата",Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТЗ.Колонки.Добавить("Счетчик",Новый ОписаниеТипов("СправочникСсылка.ркСчетчики"));
	ТЗ.Колонки.Добавить("ВидПоказаний",Новый ОписаниеТипов("СправочникСсылка.ркВидыПоказанийСчетчиков"));	
	ТЗ.Колонки.Добавить("НачальныеПоказания",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,3)));
	ТЗ.Колонки.Добавить("КонечныеПоказания",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,3)));
	ТЗ.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,3)));
	ТЗ.Колонки.Добавить("КоэффициентТрансформации",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,3)));
	
	Возврат ТЗ;	

КонецФункции // ПолучитьТЗПоказаний()

&НаСервереБезКонтекста
Функция ПолучитьТЗНепредоставлений()
	
	ТЗ = Новый ТаблицаЗначений;
	
	ТЗ.Колонки.Добавить("ВидПоказаний",Новый ОписаниеТипов("СправочникСсылка.ркВидыПоказанийСчетчиков"));
	ТЗ.Колонки.Добавить("ВидРасчета",Новый ОписаниеТипов("СправочникСсылка.ркВидыРасчетов"));
	ТЗ.Колонки.Добавить("ДатаНачалаПоказаний",Новый ОписаниеТипов("Дата",Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТЗ.Колонки.Добавить("ДатаОкончанияПоказаний",Новый ОписаниеТипов("Дата",Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТЗ.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,3)));
	ТЗ.Колонки.Добавить("ЕдиницаИзмерения",Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ТЗ.Колонки.Добавить("МетодРасчета",Новый ОписаниеТипов("ПеречислениеСсылка.рцМетодыРасчетаПоказанийИПУ"));
	ТЗ.Колонки.Добавить("ЛицевойСчет",Новый ОписаниеТипов("СправочникСсылка.ркЛицевыеСчета"));
	ТЗ.Колонки.Добавить("Счетчик",Новый ОписаниеТипов("СправочникСсылка.ркСчетчики"));
	
	Возврат ТЗ;	

КонецФункции

&НаСервере	
Процедура ВосстановитьЗначения(пАдрес)
	
	ФайлПриемник = ПолучитьИмяВременногоФайла("dat");
	ДанныеХранилища = ПолучитьИзВременногоХранилища(пАдрес);
	ДанныеХранилища.Записать(ФайлПриемник);	
	
	ДомаТЗ = ЗначениеИзФайла(ФайлПриемник);
	
	КонстантыОбработки = ПолучитьКонстантыОбработки();
	СтатусПроживает = Константы.ркСтатусПроживает.Получить();
	
	Счетчик = 0;
	ТранзакцияАктивна = Ложь;
	ДокИзм = Неопределено;
	ДокИзмГПУ = Неопределено;
	ДокПроживающие = Неопределено;
	ДокИзмИПУ = Неопределено;
	//ДокПоказанияСчетчиков = Неопределено;
	ДокОплата = Неопределено;
	ДокСоставНачислений = Неопределено;
	//ДокПоказанийГПУ = Неопределено;
	ТЗПоказаний = ПолучитьТЗПоказаний();
	ТЗПоказанийГПУ = ПолучитьТЗПоказанийГПУ();
	ТЗНепредоставлений = ПолучитьТЗНепредоставлений();
	//ДокНепредоставление = Неопределено;
	
	Для Каждого стрДомаТЗ Из ДомаТЗ Цикл
		Если Счетчик = 0 И НЕ ТранзакцияАктивна Тогда
			НачатьТранзакцию();
			ТранзакцияАктивна = Истина;
			
			ДокИзм = Документы.ркИзменениеЗначенийСвойствОбъектов.СоздатьДокумент();
			ДокИзм.Дата = ДатаОткрытия;
			ДокИзм.Комментарий = "Загрузка данных "+ТекущаяДата();
			ДокИзм.Организация = Организация;
			ДокИзм.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			
			ДокИзмГПУ = Документы.ркИзменениеСостоянийСчетчиков.СоздатьДокумент();
			ДокИзмГПУ.Дата = ДатаОткрытия;
			ДокИзмГПУ.Комментарий = "Загрузка данных "+ТекущаяДата();
			ДокИзмГПУ.Организация = Организация;
			ДокИзмГПУ.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			
			ДокПроживающие = Документы.ркИзменениеСтатусовОбъектовРасчета.СоздатьДокумент();
			ДокПроживающие.Организация = Организация;
			ДокПроживающие.Дата = ДатаОткрытия;
			ДокПроживающие.Комментарий = "Загрузка данных "+ТекущаяДата();
			ДокПроживающие.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			
			ДокИзмИПУ = Документы.ркИзменениеСостоянийСчетчиков.СоздатьДокумент();
			ДокИзмИПУ.Организация = Организация;
			ДокИзмИПУ.Дата = ДатаОткрытия;
			ДокИзмИПУ.Комментарий = "Загрузка данных "+ТекущаяДата();
			ДокИзмИПУ.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			
			ДокОплата = Документы.ркОплата.СоздатьДокумент();
			ДокОплата.Дата = ДобавитьМесяц(ДатаОткрытия,-1);
			ДокОплата.ТипОперации = Перечисления.ркТипыОперацийОплаты.ФормированиеАвансов;
			ДокОплата.СпособОплаты = Справочники.ркСпособыОплат.Основной;
			ДокОплата.Комментарий = "Загрузка данных "+ТекущаяДата();
			ДокОплата.Организация = Организация;
			ДокОплата.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			
			ДокДомУК = Документы.рцИзменениеСоответствияДомУК.СоздатьДокумент();
			ДокДомУК.Организация = Организация;
			ДокДомУК.Дата = ДатаОткрытия;
			ДокДомУК.Комментарий = "Загрузка данных "+ТекущаяДата();
			ДокДомУК.Ответственный = ПараметрыСеанса.ТекущийПользователь;

			//ДокНачислениеГр = Документы.ркНачисления.СоздатьДокумент();
			//ДокНачислениеГр.Дата = ДобавитьМесяц(ДатаОткрытия,-1);
			//ДокНачислениеГр.Организация = Организация;
			//ДокНачислениеГр.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			//ДокНачислениеГр.НаОбщедомовыеНужды = Истина;
			//ДокНачислениеГр.Комментарий = "Не проводить: Загрузка данных " + ТекущаяДата();
			//ДокНачислениеГр.Проведен = Истина;
			//ДокНачислениеГр.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
			//ДокНачислениеГр.Записать(РежимЗаписиДокумента.Запись);
			//
			//НЗгр = РегистрыНакопления.ркНачисления.СоздатьНаборЗаписей();
			//НЗгр.Отбор.Регистратор.Установить(ДокНачислениеГр.Ссылка);
			//НЗгр.Прочитать();
			
			//ДокНачисление = Документы.ркНачисления.СоздатьДокумент();
			//ДокНачисление.Дата = ДобавитьМесяц(ДатаОткрытия,-1);
			//ДокНачисление.Организация = Организация;
			//ДокНачисление.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			//ДокНачисление.Комментарий = "Не проводить: Загрузка данных " + ТекущаяДата();
			//ДокНачисление.Проведен = Истина;
			//ДокНачисление.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
			//ДокНачисление.Записать(РежимЗаписиДокумента.Запись);
			
			//НЗ = РегистрыНакопления.ркНачисления.СоздатьНаборЗаписей();
			//НЗ.Отбор.Регистратор.Установить(ДокНачисление.Ссылка);
			//НЗ.Прочитать();
			
			НовыйКЗР = Документы.КорректировкаЗаписейРегистров.СоздатьДокумент();
			НовыйКЗР.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			НовыйКЗР.Комментарий = "Перенос данных " + ТекущаяДата();
			НовыйКЗР.Проведен = Истина;
			НовыйКЗР.Дата = ДатаОграничения;
			НовыйКЗР.Записать(РежимЗаписиДокумента.Запись);
			
			НЗЗадолженность = РегистрыНакопления.ркЗадолженностьЛицевыхСчетов.СоздатьНаборЗаписей();
			НЗЗадолженность.Отбор.Регистратор.Установить(НовыйКЗР.Ссылка);
			
			//ДокНепредоставление = Документы.ркНачисленияПриНепредоставленииПоказанийСчетчиков.СоздатьДокумент();
			//ДокНепредоставление.Организация = Организация;
			//ДокНепредоставление.Дата = ДатаОткрытия;
			//ДокНепредоставление.Комментарий = "Загрузка данных "+ТекущаяДата();
			//ДокНепредоставление.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			//ДокНепредоставление.ТипОперации = Перечисления.ркТипыОперацийПоказанийСчетчиков.ПоказанияЗаПериод;

		КонецЕсли;
		//Наименование
		//Улица
		//Номер
		//Корпус
		//ДатаПостановкиНаУчет
		//ДатаСнятияСУчета
		//ОДПУ (ТЗ)
		//Доп.реквизиты дома (ТЗ)
		//Лицевые счета (ТЗ)
		
		
		стрДома = Новый Структура("Наименование,Улица,Корпус,Номер,ДатаПостановкиНаУчет,ДатаСнятияСУчета,УК,ДомКод,СвойствоИсходныйКод");
		ЗаполнитьЗначенияСвойств(стрДома,стрДомаТЗ);
		стрДома.Наименование = стрДомаТЗ.НаименованиеТекст;
		стрДома.СвойствоИсходныйКод = КонстантыОбработки.СвойствоИсходныйКод;
		ДомСсылка = Справочники.ркДома.НайтиПоНаименованию(стрДома.Наименование,Истина);
		ЭтоНовыйДом = ДомСсылка.Пустая();
		текДом = ПолучитьДом(стрДома,ДатаОткрытия,КонстантыОбработки.МКДНормы,стрДомаТЗ.ДопРеквизиты.Количество()>0);
		ДомОбъект = текДом.ПолучитьОбъект();
		ЕстьИзменения = Ложь;
		
		текМОП = 0;
		ЕстьДатаИзменения = Ложь;
		Если стрДОмаТЗ.ДопРеквизиты.Колонки.Найти("ДатаИзменения")<>Неопределено Тогда
			ЕстьДатаИзменения = Истина;
		КонецЕсли;
		Если ЭтоНовыйДом Тогда
			Для Каждого стрДополнительныеРеквизитыТЗ Из стрДомаТЗ.ДопРеквизиты Цикл
				
				//Свойство
				//Значение
				//ДатаИзменения
				
				//Индекс, 
				//Площадь мест общего пользования, 
				//Площадь жилых помещений, 
				//ТЭЦ, 
				//Наличие ОДПУ, 
				//Адрес по мр./кв., 
				//УК (это реквизит справочника)
				
				//у частных домов нет допреквизитов.
				Если стрДополнительныеРеквизитыТЗ.Свойство = "ПлощадьМОП" Тогда
					текМОП = стрДополнительныеРеквизитыТЗ.Значение;
				КонецЕсли;
				текСвойство = НайтиСвойствоДома(стрДополнительныеРеквизитыТЗ.Свойство);
				текЗначение = ПолучитьЗначениеСвойства(текСвойство,стрДополнительныеРеквизитыТЗ.Значение);
				
				
				Если НЕ текСвойство.Пустая() И Не текЗначение = Неопределено Тогда
					Если Не текСвойство.Периодический Тогда
						
						НайденныеСтроки = ДомОбъект.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство",текСвойство));
						стр = ?(НайденныеСтроки.Количество()>0,НайденныеСтроки[0],ДомОбъект.ДополнительныеРеквизиты.Добавить());
						стр.Свойство = текСвойство;
						стр.Значение = текЗначение;
						ЕстьИзменения = Истина;
					Иначе
						текДатаИзменения = ?(ЕстьДатаИзменения,стрДополнительныеРеквизитыТЗ.ДатаИзменения,НачалоГода(ДатаОткрытия));
						СтруктураПоиска = Новый Структура("НачалоДействия,Объект,Свойство", текДатаИзменения,текДом,текСвойство);
						НайденныеСтроки = докИзм.Состав.НайтиСтроки(СтруктураПоиска);
						НоваяСтрокаДок = Неопределено;
						Если НайденныеСтроки.Количество()>0 Тогда
							НоваяСтрокаДок = НайденныеСтроки[0];
						Иначе
							НоваяСтрокаДок = докИзм.Состав.Добавить();
						КонецЕсли;
						НоваяСтрокаДок.Объект = текДом;                                                 
						НоваяСтрокаДок.НачалоДействия = текДатаИзменения;
						НоваяСтрокаДок.Свойство = текСвойство;
						НоваяСтрокаДок.Значение = текЗначение;					
					КонецЕсли;		
				КонецЕсли;			
			КонецЦикла;
			Если ЕстьИзменения Тогда
				Если НЕ ЗначениеЗаполнено(ДомОбъект.Код) Тогда
					ДомОбъект.УстановитьНовыйКод();
				КонецЕсли;
				ДомОбъект.ОбменДанными.Загрузка = Истина;
				ДомОбъект.Записать();
				текДом = ДомОбъект.Ссылка;
			КонецЕсли;
			
			
			стрДомаТЗ.ТзУК.Сортировать("Период Возр");
			Для Каждого стрДомУК Из стрДомаТЗ.ТзУК Цикл			
				Если НЕ стрДомУК.Состояние Тогда
					Продолжить;
				КонецЕсли;
				НоваяСтрокаТЧ = ДокДомУК.Состав.Добавить();
				НоваяСтрокаТЧ.Дом = текДом;
				НоваяСтрокаТЧ.НачалоДействия = стрДомУК.Период;
				тУК = Справочники.Контрагенты.НайтиПоНаименованию(стрДомУК.ОрганизацияПредставление);
				Если тУК.Пустая() Тогда
					тУКОбъект = Справочники.Контрагенты.СоздатьЭлемент();
					тУКОбъект.Наименование = стрДомУК.ОрганизацияПредставление;
					тУКОбъект.НаименованиеПолное = стрДомУК.ОрганизацияПредставление;
					тУКОбъект.УстановитьНовыйКод();
					тУКОбъект.ОбменДанными.Загрузка = Истина;
					тУКОбъект.Записать();
					тУК = тУКОбъект.Ссылка;
				КонецЕсли;
				НоваяСтрокаТЧ.УК = тУК;
				
				НоваяСтрокаДок = докИзм.Состав.Добавить();
				НоваяСтрокаДок.Объект = текДом;                                                 
				НоваяСтрокаДок.НачалоДействия = стрДомУК.Период;
				НоваяСтрокаДок.Свойство = КонстантыОбработки.СвойствоНомерДоговораДома;
				НоваяСтрокаДок.Значение = стрДомУК.ОрганизацияНомерДоговора;
				
				//тФормаУправления
				текЗначение = ПолучитьЗначениеСвойства(КонстантыОбработки.СвойствоФормаУправления,стрДомУК.ФормаУправления);
				НоваяСтрокаДок = докИзм.Состав.Добавить();
				НоваяСтрокаДок.Объект = текДом;                                                 
				НоваяСтрокаДок.НачалоДействия = стрДомУК.Период;
				НоваяСтрокаДок.Свойство = КонстантыОбработки.СвойствоФормаУправления;
				НоваяСтрокаДок.Значение = текЗначение;
				
			КонецЦикла;
			
			Если стрДомаТЗ.ТзУК.Количество()=0  Тогда
				НоваяСтрокаТЧ = ДокДомУК.Состав.Добавить();
				НоваяСтрокаТЧ.Дом = текДом;
				НоваяСтрокаТЧ.НачалоДействия = ДатаОткрытия;
				НоваяСтрокаТЧ.УК = КонстантыОбработки.УКНепосредственноеУправление;
			ИначеЕсли НЕ стрДомаТЗ.ТзУК[стрДомаТЗ.ТзУК.Количество()-1].Состояние Тогда
				НоваяСтрокаТЧ = ДокДомУК.Состав.Добавить();
				НоваяСтрокаТЧ.Дом = текДом;
				НоваяСтрокаТЧ.НачалоДействия = стрДомаТЗ.ТзУК[стрДомаТЗ.ТзУК.Количество()-1].Период;
				НоваяСтрокаТЧ.УК = КонстантыОбработки.УКНепосредственноеУправление;
			КонецЕсли;
		КонецЕсли;
		НаименованиеГруппыЛицевыхСчетов = стрДома.Улица+", "+стрДома.Номер + ?(ЗначениеЗаполнено(стрДома.Корпус),", "+стрДома.Корпус,"");
		ГруппаЛицевыхСчетов = Справочники.ркЛицевыеСчета.НайтиПоНаименованию(НаименованиеГруппыЛицевыхСчетов,Истина);
		Если ГруппаЛицевыхСчетов.Пустая() Тогда
			ГруппаЛицевыхСчетов = Справочники.ркЛицевыеСчета.СоздатьГруппу();
			ГруппаЛицевыхСчетов.Наименование = НаименованиеГруппыЛицевыхСчетов;
			Если НЕ ЗначениеЗаполнено(ГруппаЛицевыхСчетов.Код) Тогда
				ГруппаЛицевыхСчетов.УстановитьНовыйКод("Гр-");
			КонецЕсли;
			ГруппаЛицевыхСчетов.ОбменДанными.Загрузка = Истина;
			ГруппаЛицевыхСчетов.Записать();
			ГруппаЛицевыхСчетов = ГруппаЛицевыхСчетов.Ссылка;
		КонецЕсли;
		
		Для Каждого стрЛицевыеСчетаТЗ Из стрДомаТЗ.ЛС Цикл
			
			//НомерЛС
			//Наименование
			//ПомещениеНаименование
			//ПомещениеНомер
			//ПомещениеЖилоеМуниципальное
			//ОтветственныйКвартиросъемщик
			//НежилоеПомещение
			//НевыясненнаяСумма
			//ЖилоеМуниципальное
			//ОтветственныйКвартиросъемщикФамилия
			//ОтветственныйКвартиросъемщикИмя
			//ОтветственныйКвартиросъемщикОтчество
			//ОтветственныйКвартиросъемщикДатаРождения
			//ОтветственныйКвартиросъемщикПол
			//ДатаОткрытия
			//ДатаЗакрытия
			//ДополнительныеРеквизиты (ТЗ)
			//ОбъектыРасчета (ТЗ)
			//Счетчики (ТЗ)
			//Сальдо (ТЗ)
			//Нормативы (ТЗ)
			
			//текДОм, ГруппаЛицевыхСчетов
			
			ЛССсылка = Справочники.ркЛицевыеСчета.НайтиПоКоду(стрЛицевыеСчетаТЗ.НомерЛС);
			Если НЕ ЛССсылка.Пустая() Тогда
				Продолжить;
			КонецЕсли;
			
			ПомещениеСсылка = Справочники.ркПомещения.НайтиПоНаименованию(стрЛицевыеСчетаТЗ.ПомещениеНаименование,Истина,,текДом);
			Если ПомещениеСсылка.Пустая() Тогда
				ПомещениеОбъект = Справочники.ркПомещения.СоздатьЭлемент();
				ПомещениеОбъект.Наименование = стрЛицевыеСчетаТЗ.ПомещениеНаименование;
				ПомещениеОбъект.Номер = ?(ЗначениеЗаполнено(стрЛицевыеСчетаТЗ.ПомещениеНомер),стрЛицевыеСчетаТЗ.ПомещениеНомер,"0");
				ПомещениеОбъект.Владелец = текДом;
				ПомещениеОбъект.Тип = КонстантыОбработки.ТипПомещенияКвартира;
				ПомещениеОбъект.ЖилоеМуниципальное = стрЛицевыеСчетаТЗ.ЖилоеМуниципальное;
				Если НЕ ЗначениеЗаполнено(ПомещениеОбъект.Код) Тогда
					ПомещениеОбъект.УстановитьНовыйКод();
				КонецЕсли;
				ПомещениеОбъект.ОбменДанными.Загрузка = Истина;
				ПомещениеОбъект.Записать();				
				ПомещениеСсылка = ПомещениеОбъект.Ссылка;
			КонецЕсли;
			
			ЛицевойСчетОбъект = Справочники.ркЛицевыеСчета.СоздатьЭлемент();
			ЛицевойСчетОбъект.Родитель = ГруппаЛицевыхСчетов;
			ЛицевойСчетОбъект.Наименование = стрЛицевыеСчетаТЗ.Наименование;
			ЛицевойСчетОбъект.Код = стрЛицевыеСчетаТЗ.НомерЛС;
			ЛицевойСчетОбъект.ДатаОткрытия = стрЛицевыеСчетаТЗ.ДатаОткрытия;
			ЛицевойСчетОбъект.ДатаЗакрытия = стрЛицевыеСчетаТЗ.ДатаЗакрытия;
			ЛицевойСчетОбъект.Дом = текДом;
			ЛицевойСчетОбъект.Помещение= ПомещениеСсылка;
			
			стрЛСДоп = ЛицевойСчетОбъект.ДополнительныеРеквизиты.Добавить();
			стрЛСДоп.Свойство = КонстантыОбработки.СвойствоИсходныйКод;
			стрЛСДоп.Значение = СокрЛП(стрЛицевыеСчетаТЗ.ЛСКод);
			
			ФизЛицо = Справочники.ФизическиеЛица.СоздатьЭлемент();
			ФизЛицо.Наименование = стрЛицевыеСчетаТЗ.Наименование;
			ФизЛицо.ФИО = стрЛицевыеСчетаТЗ.Наименование;
			ФизЛицо.ОбменДанными.Загрузка = Истина;
			ФизЛицо.Записать();
			ЛицевойСчетОбъект.ОтветственныйКвартиросъемщик = ФизЛицо.Ссылка;
			
			Если НЕ ЗначениеЗаполнено(ЛицевойСчетОбъект.Код) Тогда
				ЛицевойСчетОбъект.УстановитьНовыйКод();
			КонецЕсли;
			ЛицевойСчетОбъект.ОбменДанными.Загрузка = Истина;
			ЛицевойСчетОбъект.Записать();
			текЛицевойСчет = ЛицевойСчетОбъект.Ссылка;
			
			Если стрЛицевыеСчетаТЗ.ДопРеквизитыЛС = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			//КоличествоПрописанных
			
			текКоличествоКомнат = 0;
			текТипПлиты = "";
			текКоличествоЧеловек = 0;
			текПлощадь = 0;
			ЕстьПериод = Ложь;
			Если стрЛицевыеСчетаТЗ.ДопРеквизитыЛС.Колонки.Найти("Период")<>Неопределено Тогда
				ЕстьПериод = Истина;
			КонецЕсли;
			Для Каждого стрДополнительныеРеквизитыТЗ Из стрЛицевыеСчетаТЗ.ДопРеквизитыЛС Цикл
				
				//Свойство
				//Значение
				//ДатаИзменения
				
				//ЖилоеМуниципальное
				//ДоговорЗаключен+
				//СтатусДоговора  +
				//НаличиеВодонагревателя+
				//СтепеньБлагоустройства +
				//КонтактныйТелефон
				//ЖилаяПлощадь
				//ОбщаяПлощадь+
				//МобильныйТелефон
				
				Если стрДополнительныеРеквизитыТЗ.Свойство = "КоличествоКомнат" Тогда
					текСвойство = КонстантыОбработки.КоличествоКомнатНормы;
					текКоличествоКомнат = стрДополнительныеРеквизитыТЗ.Значение;
				ИначеЕсли стрДополнительныеРеквизитыТЗ.Свойство = "Площадь" Тогда
					текСвойство = НайтиСвойствоЛС(стрДополнительныеРеквизитыТЗ.Свойство);
					текПлощадь = стрДополнительныеРеквизитыТЗ.Значение;
				ИначеЕсли стрДополнительныеРеквизитыТЗ.Свойство = "КоличествоПрописанных" Тогда
					текСвойство = КонстантыОбработки.КоличествоЧеловекНормы;
					текКоличествоЧеловек = стрДополнительныеРеквизитыТЗ.Значение;
				ИначеЕсли стрДополнительныеРеквизитыТЗ.Свойство = "ТипПлиты" Тогда
					текСвойство = КонстантыОбработки.ТипПлитыНормы;
					текТипПлиты = стрДополнительныеРеквизитыТЗ.Значение;
				Иначе			
					текСвойство = НайтиСвойствоЛС(стрДополнительныеРеквизитыТЗ.Свойство);				
				КонецЕсли;
				
				Если НЕ текСвойство.Пустая() Тогда
					текЗначение = ПолучитьЗначениеСвойства(текСвойство,стрДополнительныеРеквизитыТЗ.Значение);
					
					Если Не текСвойство.Периодический Тогда
						
						НайденныеСтроки = ЛицевойСчетОбъект.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство",текСвойство));
						стр = ?(НайденныеСтроки.Количество()>0,НайденныеСтроки[0],ЛицевойСчетОбъект.ДополнительныеРеквизиты.Добавить());
						стр.Свойство = текСвойство;
						стр.Значение = текЗначение;						
					Иначе	
						текПериод = ?(ЕстьПериод,стрДополнительныеРеквизитыТЗ.Период,НачалоГода(ДатаОткрытия));
						СтруктураПоиска = Новый Структура("НачалоДействия,Объект,Свойство", текПериод,текЛицевойСчет,текСвойство);
						НайденныеСтроки = докИзм.Состав.НайтиСтроки(СтруктураПоиска);
						НоваяСтрокаДок = Неопределено;
						Если НайденныеСтроки.Количество() > 0 Тогда
							НоваяСтрокаДок = НайденныеСтроки[0];
						Иначе
							НоваяСтрокаДок = докИзм.Состав.Добавить();
						КонецЕсли;
						НоваяСтрокаДок.Объект = текЛицевойСчет;
						НоваяСтрокаДок.НачалоДействия = текПериод;
						НоваяСтрокаДок.Свойство = текСвойство;
						НоваяСтрокаДок.Значение = текЗначение;					
					КонецЕсли;
					
				КонецЕсли;		
				
				
			КонецЦикла;
			
			//Для Каждого стрОбъектыРасчета Из стрЛицевыеСчетаТЗ.ОбъектыРасчета Цикл
			//	//ОбъектРасчета
			//	//Фамилия
			//	//Имя
			//	//Отчество
			//	//ДатаРождения
			//	//Пол
			//	
			//	Пол = ?(стрОбъектыРасчета.Пол="М",Перечисления.ПолФизическогоЛица.Мужской,?(стрОбъектыРасчета.Пол="Ж",Перечисления.ПолФизическогоЛица.Женский,Перечисления.ПолФизическогоЛица.ПустаяСсылка()));
			//	
			//	ФизЛицо = Справочники.ФизическиеЛица.СоздатьЭлемент();
			//	ФизЛицо.Наименование = стрОбъектыРасчета.ОбъектРасчета;
			//	ФизЛицо.ДатаРождения = стрОбъектыРасчета.ДатаРождения;
			//	ФизЛицо.Пол = Пол;
			//	ФизЛицо.ФИО = ""+стрОбъектыРасчета.Фамилия+" "+стрОбъектыРасчета.Имя+" "+стрОбъектыРасчета.Отчество;
			//	ФизЛицо.Записать();
			//	ФизЛицо = ФизЛицо.Ссылка;
			//	
			//	МенеджерЗаписи = РегистрыСведений.ФИОФизическихЛиц.СоздатьМенеджерЗаписи();
			//	МенеджерЗаписи.Период = ДатаОткрытия;
			//	МенеджерЗаписи.ФизическоеЛицо = ФизЛицо;
			//	МенеджерЗаписи.Имя = стрОбъектыРасчета.Имя;
			//	МенеджерЗаписи.Отчество = стрОбъектыРасчета.Отчество;
			//	МенеджерЗаписи.Фамилия = стрОбъектыРасчета.Фамилия;
			//	МенеджерЗаписи.Записать(Истина);
			//	
			//	Если стрОбъектыРасчета.ОбъектРасчета = стрЛицевыеСчетаТЗ.ОтветственныйКвартиросъемщик Тогда
			//		ЛицевойСчетОбъект.ОтветственныйКвартиросъемщик = ФизЛицо;
			//	КонецЕсли;
			//	
			//	НоваяСтрокаПроживающий = ДокПроживающие.Состав.Добавить();
			//	НоваяСтрокаПроживающий.ЛицевойСчет = текЛицевойСчет;
			//	НоваяСтрокаПроживающий.НачалоДействия = ДатаОткрытия;
			//	НоваяСтрокаПроживающий.Включен = Истина;
			//	НоваяСтрокаПроживающий.ОбъектРасчета = ФизЛицо;
			//	НоваяСтрокаПроживающий.СтатусОбъектаРасчета = СтатусПроживает;
			//	
			//КонецЦикла;
			ЕстьСчетчик = Ложь;
			
			Для Каждого стрСчетчики Из стрЛицевыеСчетаТЗ.Счетчики Цикл
				Если стрСчетчики.Действует Тогда
					ЕстьСчетчик = Истина;
				КонецЕсли;
				//Наименование
				//ДатаВыпуска
				//Номер
				//КлассТочности
				//НачальныеПоказания
				//ДатаВключения //в документ
				//ДатаПоверки
				//ДатаПроверки
				//МежповерочныйИнтервал
				//ПоказанияСчетчика (ТЗ)
				
				//Счетчики могут повторяться.
				//текСчетчик = Справочники.ркСчетчики.НайтиПоРеквизиту("Номер",стрСчетчики.Номер,,ПомещениеСсылка);
				текСчетчик = Справочники.ркСчетчики.НайтиПоНаименованию(стрСчетчики.Номер,Истина,,ПомещениеСсылка);
				Если текСчетчик.Пустая() Тогда
					НовыйСчетчик = Справочники.ркСчетчики.СоздатьЭлемент();
					НовыйСчетчик.Владелец = текЛицевойСчет.Помещение;
					//НовыйСчетчик.Наименование = стрСчетчики.Наименование;
					НовыйСчетчик.Наименование = стрСчетчики.Номер;
				
					Если НЕ ЗначениеЗаполнено(НовыйСчетчик.Наименование) Тогда
						НовыйСчетчик.Наименование = КонстантыОбработки.ВидРасчетаЭлектроэнергия.Наименование +" "+текДом.Наименование+", "+ПомещениеСсылка.Тип.СокращенноеНаименование + " "+ПомещениеСсылка.Наименование;
					КонецЕсли;
				
					НовыйСчетчик.Номер = стрСчетчики.Номер;
					НовыйСчетчик.Уровень = Справочники.ркУровниСчетчиков.Индивидуальный;
					НовыйСчетчик.ОсновнойВидРасчета = КонстантыОбработки.ВидРасчетаЭлектроэнергия;
					НовыйСчетчик.КлассТочности = стрСчетчики.КлассТочности;
					НовыйСчетчик.ДатаВыпуска = стрСчетчики.ДатаВыпуска;
				
					СтрокаТЧ = НовыйСчетчик.ВидыРасчетов.Добавить();
					СтрокаТЧ.ВидПоказаний = Справочники.ркВидыПоказанийСчетчиков.Обычные;
					СтрокаТЧ.ВидРасчета = КонстантыОбработки.ВидРасчетаЭлектроэнергия;
					СтрокаТЧ.ЕдиницаРасчетаНормативногоКоличества = КонстантыОбработки.ЕдиницаКоличествоПроживающих;
				
					Если НЕ КонстантыОбработки.СвойствоДатаПоверки.Периодический Тогда
						стрДополнительныеРеквизиты = НовыйСчетчик.ДополнительныеРеквизиты.Добавить();
						стрДополнительныеРеквизиты.Свойство = КонстантыОбработки.СвойствоДатаПоверки;
						стрДополнительныеРеквизиты.Значение = стрСчетчики.ДатаПоверки;
					КонецЕсли;			
					Если НЕ КонстантыОбработки.СвойствоМежповерочныйИнтервал.Периодический Тогда
						стрДополнительныеРеквизиты = НовыйСчетчик.ДополнительныеРеквизиты.Добавить();
						стрДополнительныеРеквизиты.Свойство = КонстантыОбработки.СвойствоМежповерочныйИнтервал;
						стрДополнительныеРеквизиты.Значение = стрСчетчики.МежповерочныйИнтервал;
					КонецЕсли;
				
					стрДополнительныеРеквизиты = НовыйСчетчик.ДополнительныеРеквизиты.Добавить();
					стрДополнительныеРеквизиты.Свойство = КонстантыОбработки.СвойствоТипПрибораУчета;
					стрДополнительныеРеквизиты.Значение = ПолучитьЗначениеСвойства(КонстантыОбработки.СвойствоТипПрибораУчета,стрСчетчики.ТипПрибораУчета);
					
					стрДополнительныеРеквизиты = НовыйСчетчик.ДополнительныеРеквизиты.Добавить();
					стрДополнительныеРеквизиты.Свойство = КонстантыОбработки.СвойствоВидЭнергоназначений;
					стрДополнительныеРеквизиты.Значение = ПолучитьЗначениеСвойства(КонстантыОбработки.СвойствоВидЭнергоназначений,стрСчетчики.ВидЭнергоназначений);				
					
					стрДополнительныеРеквизиты = НовыйСчетчик.ДополнительныеРеквизиты.Добавить();
					стрДополнительныеРеквизиты.Свойство = КонстантыОбработки.СвойствоИсходныйКод;
					стрДополнительныеРеквизиты.Значение = стрСчетчики.ИПУКод;

					//поиск первых показаний
					стрСчетчики.ПоказанияСчетчика.Сортировать("ДатаПоказания Возр");
					//МассивВидовПоказаний = ОбщегоНазначенияКлиентСервер.СвернутьМассив(стрСчетчики.ПоказанияСчетчика.ВыгрузитьКолонку("ВидПоказаний"));					
					//Для Каждого текВидПоказаний Из МассивВидовПоказаний Цикл
						
						//ВидПоказанийСпр = Справочники.ркВидыПоказанийСчетчиков.НайтиПоНаименованию(текВидПоказаний,Истина);
						//Если ВидПоказанийСпр.Пустая() Тогда
						//	НовыйВидПоказаний = Справочники.ркВидыПоказанийСчетчиков.СоздатьЭлемент();
						//	НовыйВидПоказаний.Наименование = текВидПоказаний;
						//	НовыйВидПоказаний.УстановитьНовыйКод();
						//	НовыйВидПоказаний.ОбменДанными.Загрузка = Истина;
						//	НовыйВидПоказаний.Записать();
						//	ВидПоказанийСпр = НовыйВидПоказаний.Ссылка;
						//КонецЕсли;				
						
						стрВидыПоказаний = НовыйСчетчик.ВидыПоказаний.Добавить();
						стрВидыПоказаний.ВидПоказаний = Справочники.ркВидыПоказанийСчетчиков.Обычные;
						стрВидыПоказаний.ЕдиницыУчета = КонстантыОбработки.Квтч;
						Если стрСчетчики.ПоказанияСчетчика.Количество() > 0 Тогда
							Для Каждого стрПоказание Из стрСчетчики.ПоказанияСчетчика Цикл
								Если НЕ стрПоказание.Состояние Тогда
									Продолжить;
								КонецЕсли;
								стрВидыПоказаний.НачальныеПоказания = стрПоказание.КонечноеПоказание;
								Прервать;
							КонецЦикла;
						КонецЕсли;
						
					//КонецЦикла;
					
					Если НЕ ЗначениеЗаполнено(НовыйСчетчик.Код) Тогда
						НовыйСчетчик.УстановитьНовыйКод();
					КонецЕсли;
					НовыйСчетчик.ОбменДанными.Загрузка = Истина;
					НовыйСчетчик.Записать();
					текСчетчик = НовыйСчетчик.Ссылка;
					Если КонстантыОбработки.СвойствоДатаПоверки.Периодический Тогда
						стрДокИзм = ДокИзм.Состав.Добавить();
						стрДокИзм.НачалоДействия = НачалоГода(ДатаОткрытия);
						стрДокИзм.Объект = текСчетчик;
						стрДокИзм.Свойство = КонстантыОбработки.СвойствоДатаПоверки;
						стрДокИзм.Значение = стрСчетчики.ДатаПоверки;
					КонецЕсли;			
					Если КонстантыОбработки.СвойствоМежповерочныйИнтервал.Периодический Тогда
						стрДокИзм = ДокИзм.Состав.Добавить();
						стрДокИзм.НачалоДействия = НачалоГода(ДатаОткрытия);
						стрДокИзм.Объект = текСчетчик;
						стрДокИзм.Свойство = КонстантыОбработки.СвойствоМежповерочныйИнтервал;
						стрДокИзм.Значение = стрСчетчики.МежповерочныйИнтервал;
					КонецЕсли;
					
					ПервоеПоказание = Истина;
					стрСчетчики.ПоказанияСчетчика.Сортировать("ДатаНачалаПериодаПоказаний Возр");
					
					//начальное показание для каждого месяца, при смене месяца начальное показание обновить.
					НачальноеКоличество = 0;
					ПериодНачальногоКоличества = Дата(1001,1,1);
					НачальныйПереворот = Ложь;
					
					Для Каждого стрПоказание Из стрСчетчики.ПоказанияСчетчика Цикл
						
						Если НЕ стрПоказание.Состояние Тогда
							Продолжить;
						КонецЕсли;
						
						Если ПериодНачальногоКоличества <> НачалоМесяца(стрПоказание.ОтчетныйПериод) ИЛИ ПервоеПоказание Тогда
							ПериодНачальногоКоличества = НачалоМесяца(стрПоказание.ОтчетныйПериод);
							НачальноеКоличество = стрПоказание.НачальноеПоказание;
							НачальныйПереворот = стрПоказание.Переворот;
						КонецЕсли;
						
						Если ПервоеПоказание Тогда
							ПервоеПоказание = Ложь;
							НачальноеКоличество = стрПоказание.КонечноеПоказание;
						КонецЕсли;
						
						//ВидПоказаний
						//МетодРасчета
						//НачальноеПоказание
						//КонечноеПоказание
						//Количество
						//ДатаПоказания
						//ДатаНачалаПериодаПоказаний
						//ДатаКонцаПериодаПоказаний
						
						//ВидПоказанийСпр = Справочники.ркВидыПоказанийСчетчиков.НайтиПоНаименованию(стрПоказание.ВидПоказаний,Истина);
						//Если ВидПоказанийСпр.Пустая() Тогда
						//	НовыйВидПоказаний = Справочники.ркВидыПоказанийСчетчиков.СоздатьЭлемент();
						//	НовыйВидПоказаний.Наименование = стрПоказание.ВидПоказаний;
						//	НовыйВидПоказаний.УстановитьНовыйКод();
						//	НовыйВидПоказаний.ОбменДанными.Загрузка = Истина;
						//	НовыйВидПоказаний.Записать();
						//	ВидПоказанийСпр = НовыйВидПоказаний.Ссылка;
						//КонецЕсли;
						
						НоваяСтрокаТЗ = ТЗПоказаний.Добавить();
						НоваяСтрокаТЗ.ОтчетныйПериод = стрПоказание.ОтчетныйПериод;
						НоваяСтрокаТЗ.ВидПоказаний = Справочники.ркВидыПоказанийСчетчиков.Обычные;
						НоваяСтрокаТЗ.ДатаНачала = НачалоМесяца(стрПоказание.ОтчетныйПериод);//стрПоказание.ДатаНачалаПериодаПоказаний;
						НоваяСтрокаТЗ.ДатаОкончания = КонецМесяца(стрПоказание.ОтчетныйПериод);//стрПоказание.ДатаКонцаПериодаПоказаний;
						НоваяСтрокаТЗ.Дом = текДом;
						НоваяСтрокаТЗ.Сброс = стрПоказание.Переворот;
						Если стрПоказание.Переворот ИЛИ НачальныйПереворот Тогда
							НоваяСтрокаТЗ.Количество = ПолучитьКоличествоПереворот(стрПоказание.КонечноеПоказание,НачальноеКоличество);
							НоваяСтрокаТЗ.Сброс = Истина;
						Иначе
							НоваяСтрокаТЗ.Количество = стрПоказание.КонечноеПоказание - НачальноеКоличество;
						КонецЕсли;
						НоваяСтрокаТЗ.ЛицевойСчет = текЛицевойСчет;
						НоваяСтрокаТЗ.НачальноеКоличество = НачальноеКоличество;
						НоваяСтрокаТЗ.КонечныеПоказания = стрПоказание.КонечноеПоказание;
						НоваяСтрокаТЗ.ПериодДействия = стрПоказание.ДатаНачалаПериодаПоказаний;
						НоваяСтрокаТЗ.Помещение = ПомещениеСсылка;
						НоваяСтрокаТЗ.Счетчик = текСчетчик;
						Если ЗначениеЗаполнено(текСчетчик) Тогда
							НоваяСтрокаТЗ.КодСчетчика = текСчетчик.Код;
						КонецЕсли;
						
					КонецЦикла;
					
					Для Каждого стрНеСписанноеСреднее Из стрСчетчики.НеСписанноеСреднее Цикл
						
						тПериод = НачалоМесяца(стрНеСписанноеСреднее.Период);
						Если День(стрНеСписанноеСреднее.Период) >=27 Тогда
							тПериод = ДобавитьМесяц(тПериод,1);
						КонецЕсли;

						
						СтруктураПоиска = Новый Структура("ДатаНачалаПоказаний,ДатаОкончанияПоказаний,ЛицевойСчет,Счетчик",НачалоМесяца(тПериод),КонецМесяца(тПериод),текЛицевойСчет,текСчетчик);
						
						Если Ложь Тогда ТЗНепредоставлений = Новый ТаблицаЗначений; КонецЕсли;
						НайденныеСтроки = ТЗНепредоставлений.НайтиСтроки(СтруктураПоиска);
						Если НайденныеСтроки.Количество() > 0 Тогда
							НоваяСтрокаТЧ = НайденныеСтроки[0];
							НоваяСтрокаТЧ.Количество = НоваяСтрокаТЧ.Количество + стрНеСписанноеСреднее.ОбъемУслугиОборот;
						Иначе
							НоваяСтрокаТЧ = ТЗНепредоставлений.Добавить();
							НоваяСтрокаТЧ.Количество = стрНеСписанноеСреднее.ОбъемУслугиОборот;
						КонецЕсли;
						НоваяСтрокаТЧ.ВидПоказаний = Справочники.ркВидыПоказанийСчетчиков.Обычные;
						НоваяСтрокаТЧ.ВидРасчета = КонстантыОбработки.ВидРасчетаЭлектроэнергия;
						
						НоваяСтрокаТЧ.ДатаНачалаПоказаний = НачалоМесяца(тПериод);
						НоваяСтрокаТЧ.ДатаОкончанияПоказаний = КонецМесяца(тПериод);
						
						НоваяСтрокаТЧ.ЕдиницаИзмерения = КонстантыОбработки.Квтч;
						НоваяСтрокаТЧ.МетодРасчета = Перечисления.рцМетодыРасчетаПоказанийИПУ.ПоСреднемесячномуПотреблению;
						//Если стрНеСписанноеСреднее.Среднее = "Среднее" Тогда
						//	НоваяСтрокаТЧ.МетодРасчета = Перечисления.рцМетодыРасчетаПоказанийИПУ.ПоСреднемесячномуПотреблению;
						//ИначеЕсли стрНеСписанноеСреднее.Среднее = "Среднее по нормативу" Тогда
						//	НоваяСтрокаТЧ.МетодРасчета = Перечисления.рцМетодыРасчетаПоказанийИПУ.ПоНормативу;
						//Иначе
						//	НоваяСтрокаТЧ.МетодРасчета = Перечисления.рцМетодыРасчетаПоказанийИПУ.ПоПоказаниям;
						//КонецЕсли;
						НоваяСтрокаТЧ.ЛицевойСчет = текЛицевойСчет;
						НоваяСтрокаТЧ.Счетчик = текСчетчик;
						
					КонецЦикла;
					
					//тз состояния счетчиков
					Для Каждого стрСостояниеСчетчика ИЗ стрСчетчики.СостояниеСчетчиков Цикл
						СтруктураПоиска = Новый Структура("Счетчик,НачалоДействия", текСчетчик,стрСостояниеСчетчика.Период);
						НайденныеСтроки = ДокИзмИПУ.Состав.НайтиСтроки(СтруктураПоиска);
						Если НайденныеСтроки.Количество() = 0 Тогда
							стрДокИзмИПУ = ДокИзмИПУ.Состав.Добавить();
						Иначе
							стрДокИзмИПУ = НайденныеСтроки[0];
						КонецЕсли;
						стрДокИзмИПУ.Включен = стрСостояниеСчетчика.Состояние;
						стрДокИзмИПУ.НачалоДействия = стрСостояниеСчетчика.Период;
						стрДокИзмИПУ.Счетчик = текСчетчик;
					КонецЦикла;
					//конец тз состояния счетчиков

					
				КонецЕсли;
				
				
			КонецЦикла;
			
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТЗСальдо.ПериодДолга,
			|	ТЗСальдо.СуммаДолга
			|ПОМЕСТИТЬ втТЗСальдо
			|ИЗ
			|	&ТЗСальдо КАК ТЗСальдо
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	рцСоответствиеДомУК.Период,
			|	рцСоответствиеДомУК.Регистратор,
			|	рцСоответствиеДомУК.НомерСтроки,
			|	рцСоответствиеДомУК.Активность,
			|	рцСоответствиеДомУК.Дом,
			|	рцСоответствиеДомУК.УК
			|ПОМЕСТИТЬ втСоответствияДом
			|ИЗ
			|	РегистрСведений.рцСоответствиеДомУК КАК рцСоответствиеДомУК
			|ГДЕ
			|	рцСоответствиеДомУК.Дом = &текДом
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	втТЗСальдо.ПериодДолга,
			|	втТЗСальдо.СуммаДолга,
			|	МАКСИМУМ(втСоответствияДом.Период) КАК МаксПериод
			|ПОМЕСТИТЬ втМаксПериод
			|ИЗ
			|	втТЗСальдо КАК втТЗСальдо
			|		ЛЕВОЕ СОЕДИНЕНИЕ втСоответствияДом КАК втСоответствияДом
			|		ПО втТЗСальдо.ПериодДолга > втСоответствияДом.Период
			|
			|СГРУППИРОВАТЬ ПО
			|	втТЗСальдо.ПериодДолга,
			|	втТЗСальдо.СуммаДолга
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	втМаксПериод.ПериодДолга,
			|	втМаксПериод.СуммаДолга,
			|	ЕСТЬNULL(втСоответствияДом.УК, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК УК
			|ИЗ
			|	втМаксПериод КАК втМаксПериод
			|		ЛЕВОЕ СОЕДИНЕНИЕ втСоответствияДом КАК втСоответствияДом
			|		ПО втМаксПериод.МаксПериод = втСоответствияДом.Период";
			
			Запрос.УстановитьПараметр("ТЗСальдо", стрЛицевыеСчетаТЗ.Сальдо);
			Запрос.УстановитьПараметр("текДом", текДом);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				//УК
				//Услуга
				//ПериодДолга
				//СуммаДолга
				//НоваяСтрокаСоставОплаты = ДокОплата.Состав.Добавить();
				//НоваяСтрокаСоставОплаты.УК = текДом.УК;
				//НоваяСтрокаСоставОплаты.ЛицевойСчет = текЛицевойСчет;
				//НоваяСтрокаСоставОплаты.ВидРасчета = КонстантыОбработки.ВидРасчетаЭлектроэнергия;				
				//НоваяСтрокаСоставОплаты.Поставщик = КонстантыОбработки.Поставщик;
				//НоваяСтрокаСоставОплаты.ДатаОплаты = стрСальдо.ПериодДолга;
				//Если ЗначениеЗаполнено(стрСальдо.СуммаДолга) Тогда
				//	НоваяСтрокаСоставОплаты.Сумма = -стрСальдо.СуммаДолга;
				//КонецЕсли;
				
				НоваяЗапись = НЗЗадолженность.Добавить();
				НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход;
				НоваяЗапись.ВидРасчета = КонстантыОбработки.ВидРасчетаЭлектроэнергия;
				НоваяЗапись.ДатаОплаты = ВыборкаДетальныеЗаписи.ПериодДолга;
				НоваяЗапись.ЛицевойСчет = текЛицевойСчет;
				НоваяЗапись.Период = ДатаОграничения-1;
				НоваяЗапись.ПериодЗадолженности = НачалоМесяца(ВыборкаДетальныеЗаписи.ПериодДолга);
				НоваяЗапись.Поставщик = КонстантыОбработки.Поставщик;
				НоваяЗапись.Сумма = ВыборкаДетальныеЗаписи.СуммаДолга;
				
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.УК) Тогда
					НоваяЗапись.УК = ВыборкаДетальныеЗаписи.УК;
				Иначе
					НоваяЗапись.УК = текДом.УК;
				КонецЕсли;

				
			КонецЦикла;
			
			СчетчикСоставНачислений = 0;
			ЕстьПовышающийКоэффициент = Ложь;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТЗСоставНачислений.ДатаСреза,
			|	ТЗСоставНачислений.НормативныйКоэфицент,
			|	ТЗСоставНачислений.СостояниеУслуги,
			|	ВЫРАЗИТЬ(ТЗСоставНачислений.ТарифПредставление КАК Строка(150)) КАК ТарифПредставление
			|ПОМЕСТИТЬ втТЗСоставНачислений
			|ИЗ
			|	&ТЗСоставНачислений КАК ТЗСоставНачислений
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	рцСоответствиеДомУК.Период,
			|	рцСоответствиеДомУК.Регистратор,
			|	рцСоответствиеДомУК.НомерСтроки,
			|	рцСоответствиеДомУК.Активность,
			|	рцСоответствиеДомУК.Дом,
			|	рцСоответствиеДомУК.УК
			|ПОМЕСТИТЬ втСоответствияДом
			|ИЗ
			|	РегистрСведений.рцСоответствиеДомУК КАК рцСоответствиеДомУК
			|ГДЕ
			|	рцСоответствиеДомУК.Дом = &текДом
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	втТЗСоставНачислений.ДатаСреза,
			|	втТЗСоставНачислений.НормативныйКоэфицент,
			|	втТЗСоставНачислений.СостояниеУслуги,
			|	втТЗСоставНачислений.ТарифПредставление,
			|	МАКСИМУМ(втСоответствияДом.Период) КАК МаксПериод
			|ПОМЕСТИТЬ втМаксПериод
			|ИЗ
			|	втТЗСоставНачислений КАК втТЗСоставНачислений
			|		ЛЕВОЕ СОЕДИНЕНИЕ втСоответствияДом КАК втСоответствияДом
			|		ПО втТЗСоставНачислений.ДатаСреза > втСоответствияДом.Период
			|
			|СГРУППИРОВАТЬ ПО
			|	втТЗСоставНачислений.ДатаСреза,
			|	втТЗСоставНачислений.НормативныйКоэфицент,
			|	втТЗСоставНачислений.СостояниеУслуги,
			|	втТЗСоставНачислений.ТарифПредставление
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	втМаксПериод.ДатаСреза,
			|	втМаксПериод.НормативныйКоэфицент,
			|	втМаксПериод.СостояниеУслуги,
			|	втМаксПериод.ТарифПредставление,
			|	ЕСТЬNULL(втСоответствияДом.УК, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК УК
			|ИЗ
			|	втМаксПериод КАК втМаксПериод
			|		ЛЕВОЕ СОЕДИНЕНИЕ втСоответствияДом КАК втСоответствияДом
			|		ПО втМаксПериод.МаксПериод = втСоответствияДом.Период";
			
			
			Запрос.УстановитьПараметр("ТекДом",текДом);
			Запрос.УстановитьПараметр("ТЗСоставНачислений",стрЛицевыеСчетаТЗ.СоставНачислений);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			//Для Каждого стрСоставНачисление Из стрЛицевыеСчетаТЗ.СоставНачислений Цикл
				
				Если СчетчикСоставНачислений = 0 Тогда
					
					ДокСоставНачислений = Документы.ркИзменениеСоставаНачислений.СоздатьДокумент();
					ДокСоставНачислений.Дата = ДатаОткрытия;
					ДокСоставНачислений.Организация = Организация;
					ДокСоставНачислений.Комментарий = "Загрузка данных "+ТекущаяДата();
					ДокСоставНачислений.Ответственный = ПараметрыСеанса.ТекущийПользователь;
					
				КонецЕсли;
				
				текНаименованиеГруппы = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ТарифПредставление),СокрЛП(ВыборкаДетальныеЗаписи.ТарифПредставление),"Безымянный");
				текВидТарифа = Справочники.ркВидыТарифов.НайтиПоНаименованию(текНаименованиеГруппы,Истина); //здесь нужно искать используя доппараметры кроме людей.
				ЗаполнятьВидНормы = Истина;
				
				Если текВидТарифа.Пустая() и ЛЕВ(СокрЛП(ВыборкаДетальныеЗаписи.ТарифПредставление),СтрДлина("Электроплиты прибор учета")) = "Электроплиты прибор учета" Тогда
					Если текВидТарифа.Пустая() Тогда
						текНаименованиеГруппы = "Электроплиты прибор учета (день) город";
						текВидТарифа = Справочники.ркВидыТарифов.НайтиПоНаименованию(текНаименованиеГруппы,Истина);
					КонецЕсли;					
				КонецЕсли;
				
				Если текВидТарифа.Пустая() Тогда
					Продолжить;
				КонецЕсли;
				
				СтруктураПоиска = Новый Структура("НачалоДействия,ЛицевойСчет,ВидРасчета", НачалоДня(ВыборкаДетальныеЗаписи.ДатаСреза), текЛицевойСчет, КонстантыОбработки.ВидРасчетаЭлектроэнергия);
				НайденныеСтроки = ДокСоставНачислений.Состав.НайтиСтроки(СтруктураПоиска);
				Если текВидТарифа.СоставДоступныхЕдиницРасчета.Количество()>0 Тогда
					текЕдиницаРасчета = текВидТарифа.СоставДоступныхЕдиницРасчета[0].ЕдиницаРасчета;
				Иначе
					текЕдиницаРасчета = КонстантыОбработки.ЕдиницаКоличествоПроживающих;
				КонецЕсли;				
				
				Если НайденныеСтроки.Количество() = 0 Тогда
					НоваяСтрокаСоставНачислений = ДокСоставНачислений.Состав.Добавить();
					НоваяСтрокаСоставНачислений.НачалоДействия = НачалоДня(ВыборкаДетальныеЗаписи.ДатаСреза);//+НоваяСтрокаСоставНачислений.НомерСтроки;
					НоваяСтрокаСоставНачислений.ЛицевойСчет = текЛицевойСчет;
					НоваяСтрокаСоставНачислений.ВидРасчета = КонстантыОбработки.ВидРасчетаЭлектроэнергия;
					НоваяСтрокаСоставНачислений.ВидТарифа = текВидТарифа;
					Если ВыборкаДетальныеЗаписи.СостояниеУслуги Тогда
						НоваяСтрокаСоставНачислений.СтатусУчастияВРасчетах = Справочники.ркСтатусыУчастияВРасчетах.Расчет;
					Иначе
						НоваяСтрокаСоставНачислений.СтатусУчастияВРасчетах = КонстантыОбработки.СтатусУчастияВРасчетахСнято;
					КонецЕсли;
					НоваяСтрокаСоставНачислений.ЕдиницаРасчета = текЕдиницаРасчета;
					Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.УК) Тогда
						НоваяСтрокаСоставНачислений.УК = ВыборкаДетальныеЗаписи.УК;
					Иначе
						НоваяСтрокаСоставНачислений.УК = текДом.УК;
					КонецЕсли;
				КонецЕсли;
				Если ВыборкаДетальныеЗаписи.НормативныйКоэфицент Тогда
					//Повышающий коэффициент
					
					ЕстьПовышающийКоэффициент = Истина;					
					ИмяДопВидаТарифа = текВидТарифа.Наименование+" Повышающий коэффициент";
					ДопВидТарифа = Справочники.ркВидыТарифов.НайтиПоНаименованию(ИмяДопВидаТарифа);				
					
					ДопСтрока = ДокСоставНачислений.Состав.Добавить();
					ЗаполнитьЗначенияСвойств(ДопСтрока,НоваяСтрокаСоставНачислений,,"НомерСтроки");
					ДопСтрока.ВидТарифа = ДопВидТарифа;
					ДопСтрока.ВидРасчета = КонстантыОбработки.ВидРасчетаПовышающийКоэффициент;
				ИначеЕсли ЕстьПовышающийКоэффициент Тогда
					ИмяДопВидаТарифа = текВидТарифа.Наименование+" Повышающий коэффициент";
					ДопВидТарифа = Справочники.ркВидыТарифов.НайтиПоНаименованию(ИмяДопВидаТарифа);
					
					ДопСтрока = ДокСоставНачислений.Состав.Добавить();
					ЗаполнитьЗначенияСвойств(ДопСтрока,НоваяСтрокаСоставНачислений,,"НомерСтроки");
					ДопСтрока.ВидТарифа = ДопВидТарифа;
					ДопСтрока.ВидРасчета = КонстантыОбработки.ВидРасчетаПовышающийКоэффициент;
					ДопСтрока.СтатусУчастияВРасчетах = КонстантыОбработки.СтатусУчастияВРасчетахСнято;
				КонецЕсли;				
				
				СчетчикСоставНачислений = СчетчикСоставНачислений+1;
				Если СчетчикСоставНачислений >= 1000 Тогда
					Если ДокСоставНачислений.Состав.Количество() > 0 Тогда
						ДокСоставНачислений.Состав.Свернуть("НачалоДействия,ЛицевойСчет,ВидРасчета,ВидТарифа,СтатусУчастияВРасчетах,ЕдиницаРасчета,УК");
						ДокСоставНачислений.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
						ДокСоставНачислений.Записать(РежимЗаписиДокумента.Проведение);
					КонецЕсли;
					
					СчетчикСоставНачислений = 0;
				КонецЕсли;
				
			КонецЦикла;
			Если СчетчикСоставНачислений > 0 Тогда				
				
				Если ДокСоставНачислений.Состав.Количество() > 0 Тогда
					ДокСоставНачислений.Состав.Свернуть("НачалоДействия,ЛицевойСчет,ВидРасчета,ВидТарифа,СтатусУчастияВРасчетах,ЕдиницаРасчета,УК");
					ДокСоставНачислений.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
					ДокСоставНачислений.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
				
				СчетчикСоставНачислений = 0;
				
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВЫРАЗИТЬ(ТЗНачисления.ВидТарифа КАК Строка(150)) КАК ВидТарифа,
			|	ТЗНачисления.НаОбщедомовыеНужды,
			|	ВЫРАЗИТЬ(ТЗНачисления.ТипОперации КАК Строка(150)) КАК ТипОперации,
			|	ТЗНачисления.КоличествоВПределахНормы,
			|	ТЗНачисления.КоличествоСверхНормы,
			|	ТЗНачисления.Период,
			|	ТЗНачисления.ПериодЗадолженности,
			|	ТЗНачисления.СуммаНачислений,
			|	ТЗНачисления.ЗначениеТарифа,
			|	ВЫРАЗИТЬ(ТЗНачисления.Среднее КАК Строка(150)) КАК Среднее
			|ПОМЕСТИТЬ втТЗНачисления
			|ИЗ
			|	&ТЗНачисления КАК ТЗНачисления
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	рцСоответствиеДомУК.Период,
			|	рцСоответствиеДомУК.Регистратор,
			|	рцСоответствиеДомУК.НомерСтроки,
			|	рцСоответствиеДомУК.Активность,
			|	рцСоответствиеДомУК.Дом,
			|	рцСоответствиеДомУК.УК
			|ПОМЕСТИТЬ втСоответствия
			|ИЗ
			|	РегистрСведений.рцСоответствиеДомУК КАК рцСоответствиеДомУК
			|ГДЕ
			|	рцСоответствиеДомУК.Дом = &текДом
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	втТЗНачисления.ВидТарифа,
			|	втТЗНачисления.НаОбщедомовыеНужды,
			|	втТЗНачисления.ТипОперации,
			|	втТЗНачисления.КоличествоВПределахНормы,
			|	втТЗНачисления.КоличествоСверхНормы,
			|	втТЗНачисления.Период,
			|	втТЗНачисления.ПериодЗадолженности,
			|	втТЗНачисления.СуммаНачислений,
			|	втТЗНачисления.ЗначениеТарифа,
			|	втТЗНачисления.Среднее,
			|	МАКСИМУМ(втСоответствия.Период) КАК МаксПериод
			|ПОМЕСТИТЬ втМаксПериод
			|ИЗ
			|	втТЗНачисления КАК втТЗНачисления
			|		ЛЕВОЕ СОЕДИНЕНИЕ втСоответствия КАК втСоответствия
			|		ПО втТЗНачисления.Период >= втСоответствия.Период
			|
			|СГРУППИРОВАТЬ ПО
			|	втТЗНачисления.ТипОперации,
			|	втТЗНачисления.Период,
			|	втТЗНачисления.Среднее,
			|	втТЗНачисления.ЗначениеТарифа,
			|	втТЗНачисления.КоличествоСверхНормы,
			|	втТЗНачисления.ВидТарифа,
			|	втТЗНачисления.НаОбщедомовыеНужды,
			|	втТЗНачисления.СуммаНачислений,
			|	втТЗНачисления.КоличествоВПределахНормы,
			|	втТЗНачисления.ПериодЗадолженности
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	втМаксПериод.ВидТарифа,
			|	втМаксПериод.НаОбщедомовыеНужды,
			|	втМаксПериод.ТипОперации,
			|	втМаксПериод.КоличествоВПределахНормы,
			|	втМаксПериод.КоличествоСверхНормы,
			|	втМаксПериод.Период,
			|	втМаксПериод.ПериодЗадолженности,
			|	втМаксПериод.СуммаНачислений,
			|	втМаксПериод.ЗначениеТарифа,
			|	втМаксПериод.Среднее,
			|	втСоответствия.УК
			|ИЗ
			|	втМаксПериод КАК втМаксПериод
			|		ЛЕВОЕ СОЕДИНЕНИЕ втСоответствия КАК втСоответствия
			|		ПО втМаксПериод.МаксПериод = втСоответствия.Период";
			
			Запрос.УстановитьПараметр("текДом", текДом);
			Запрос.УстановитьПараметр("ТЗНачисления",стрЛицевыеСчетаТЗ.Начисления);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			СчетчикНачислений = 0;
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			//Для Каждого стрНачисление Из стрЛицевыеСчетаТЗ.Начисления Цикл
				
				//Период
				//ТипОперации
				//НаОбщедомовыеНужды
				//ВидНачисления
				//ПериодЗадолженности
				//УК
				//ВидТарифа
				//СуммаНачислений
				//КоличествоВПределахНормы
				
				//имяВидаТарифа
				//текКоличествоКомнат = "0";
				//текТипПлиты = "";
				//текМКД = "";
				//текМОП = "";
				//текКоличествоЧеловек = "0";
				
				//текНаименованиеГруппы = ?(стрНачисление.ВидТарифа = NULL, "", стрНачисление.ВидТарифа) +  " "+текКоличествоКомнат+" ком., "+?(текТипПлиты = NULL,"",текТипПлиты+ " пл., ")+текМКД+" МКД, "+текМОП +" МОП";
				
				Если СчетчикНачислений = 0 Тогда
					
					//ДокСоставНачислений = Документы.ркИзменениеСоставаНачислений.СоздатьДокумент();
					//ДокСоставНачислений.Дата = ДатаОткрытия;
					//ДокСоставНачислений.Организация = Организация;
					//ДокСоставНачислений.Комментарий = "Загрузка данных "+ТекущаяДата();
					//ДокСоставНачислений.Ответственный = ПараметрыСеанса.ТекущийПользователь;
					
					
					ДокНачисление = Документы.ркНачисления.СоздатьДокумент();
					ДокНачисление.Дата = ДобавитьМесяц(ДатаОткрытия,-1);
					ДокНачисление.Организация = Организация;
					ДокНачисление.Ответственный = ПараметрыСеанса.ТекущийПользователь;
					ДокНачисление.Комментарий = "Не проводить: Загрузка данных " + ТекущаяДата();
					ДокНачисление.Проведен = Истина;
					ДокНачисление.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
					ДокНачисление.Записать(РежимЗаписиДокумента.Запись);
					
					НЗ = РегистрыНакопления.ркНачисления.СоздатьНаборЗаписей();
					НЗ.Отбор.Регистратор.Установить(ДокНачисление.Ссылка);
					НЗ.Прочитать();
					
					ДокНачислениеГр = Документы.ркНачисления.СоздатьДокумент();
					ДокНачислениеГр.Дата = ДобавитьМесяц(ДатаОткрытия,-1);
					ДокНачислениеГр.Организация = Организация;
					ДокНачислениеГр.Ответственный = ПараметрыСеанса.ТекущийПользователь;
					ДокНачислениеГр.НаОбщедомовыеНужды = Истина;
					ДокНачислениеГр.Комментарий = "Не проводить: Загрузка данных " + ТекущаяДата();
					ДокНачислениеГр.Проведен = Истина;
					ДокНачислениеГр.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
					ДокНачислениеГр.Записать(РежимЗаписиДокумента.Запись);
					
					НЗгр = РегистрыНакопления.ркНачисления.СоздатьНаборЗаписей();
					НЗгр.Отбор.Регистратор.Установить(ДокНачислениеГр.Ссылка);
					НЗгр.Прочитать();				
					
				КонецЕсли;
				
				текНаименованиеГруппы = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ВидТарифа),СокрЛП(ВыборкаДетальныеЗаписи.ВидТарифа),"Безымянный");
				
				текВидТарифа = Справочники.ркВидыТарифов.НайтиПоНаименованию(текНаименованиеГруппы,Истина); //здесь нужно искать используя доппараметры кроме людей.
				
				ЗаполнятьВидНормы = Истина;
				
				Если текВидТарифа.Пустая() и ЛЕВ(СокрЛП(ВыборкаДетальныеЗаписи.ВидТарифа),СтрДлина("Электроплиты прибор учета")) = "Электроплиты прибор учета" Тогда
					Если текВидТарифа.Пустая() Тогда
						текНаименованиеГруппы = "Электроплиты прибор учета (день) город";
						текВидТарифа = Справочники.ркВидыТарифов.НайтиПоНаименованию(текНаименованиеГруппы,Истина);
					КонецЕсли;					
				КонецЕсли;
				
				Если текВидТарифа.Пустая() Тогда
					Продолжить;
				КонецЕсли;
				
				//СтруктураПоиска = Новый Структура("НачалоДействия,ЛицевойСчет,ВидРасчета", НачалоДня(стрНачисление.Период), текЛицевойСчет, КонстантыОбработки.ВидРасчетаЭлектроэнергия);
				//НайденныеСтроки = ДокСоставНачислений.Состав.НайтиСтроки(СтруктураПоиска);
				Если текВидТарифа.СоставДоступныхЕдиницРасчета.Количество()>0 Тогда
					текЕдиницаРасчета = текВидТарифа.СоставДоступныхЕдиницРасчета[0].ЕдиницаРасчета;
				Иначе
					текЕдиницаРасчета = КонстантыОбработки.ЕдиницаКоличествоПроживающих;
				КонецЕсли;
				
				//Если НайденныеСтроки.Количество() = 0 Тогда
				//	НоваяСтрокаСоставНачислений = ДокСоставНачислений.Состав.Добавить();
				//	НоваяСтрокаСоставНачислений.НачалоДействия = НачалоДня(стрНачисление.Период);//+НоваяСтрокаСоставНачислений.НомерСтроки;
				//	НоваяСтрокаСоставНачислений.ЛицевойСчет = текЛицевойСчет;
				//	НоваяСтрокаСоставНачислений.ВидРасчета = КонстантыОбработки.ВидРасчетаЭлектроэнергия;
				//	НоваяСтрокаСоставНачислений.ВидТарифа = текВидТарифа;
				//	НоваяСтрокаСоставНачислений.СтатусУчастияВРасчетах = Справочники.ркСтатусыУчастияВРасчетах.Расчет;
				//	НоваяСтрокаСоставНачислений.ЕдиницаРасчета = текЕдиницаРасчета;
				//	НоваяСтрокаСоставНачислений.УК = текДом.УК;
				//КонецЕсли;
				
				Если ВыборкаДетальныеЗаписи.НаОбщедомовыеНужды Тогда
					НоваяЗаписьНачислений = НЗгр.Добавить();
					Если СокрЛП(ВыборкаДетальныеЗаписи.ТипОперации) = "Текущие" Тогда
						НоваяЗаписьНачислений.ВидНачисления = Перечисления.ркВидыНачислений.ЕжемесячныеНачисления;
					Иначе
						НоваяЗаписьНачислений.ВидНачисления = Перечисления.ркВидыНачислений.КоррекцияПоГрупповымСчетчикам;
					КонецЕсли;
					НоваяЗаписьНачислений.ВидНормы = текВидТарифа.ВидНормы;
					НоваяЗаписьНачислений.ВидРасчета = КонстантыОбработки.ВидРасчетаЭлектроэнергия;
					НоваяЗаписьНачислений.ВидТарифа = текВидТарифа;
					НоваяЗаписьНачислений.ЕдиницаИзмерения = текВидТарифа.ЕдиницыУчета;
					НоваяЗаписьНачислений.ЕдиницаРасчета = текЕдиницаРасчета;
					НоваяЗаписьНачислений.КоличествоВПределахНормы = ВыборкаДетальныеЗаписи.КоличествоВПределахНормы;
					НоваяЗаписьНачислений.КоличествоСверхНормы = ВыборкаДетальныеЗаписи.КоличествоСверхНормы;
					НоваяЗаписьНачислений.ЛицевойСчет = текЛицевойСчет;
					НоваяЗаписьНачислений.НаОбщедомовыеНужды = Истина;
					НоваяЗаписьНачислений.Период = ВыборкаДетальныеЗаписи.Период;
					НоваяЗаписьНачислений.ПериодЗадолженности = НачалоМесяца(ВыборкаДетальныеЗаписи.ПериодЗадолженности);
					НоваяЗаписьНачислений.Поставщик = КонстантыОбработки.Поставщик;
					НоваяЗаписьНачислений.СуммаНачислений = ВыборкаДетальныеЗаписи.СуммаНачислений;
					НоваяЗаписьНачислений.СуммаНачисленийВПределахНормы = ВыборкаДетальныеЗаписи.СуммаНачислений;
					НоваяЗаписьНачислений.Тариф = ВыборкаДетальныеЗаписи.ЗначениеТарифа;
					Если СокрЛП(ВыборкаДетальныеЗаписи.ТипОперации) = "Текущие" Тогда
						НоваяЗаписьНачислений.ТипОперации = Перечисления.ркТипыОперацийНачисления.НачисленияТекущегоПериода;
					Иначе
						НоваяЗаписьНачислений.ТипОперации = Перечисления.ркТипыОперацийНачисления.ПерерасчетыПрошлыхПериодов;
					КонецЕсли;
					Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.УК) Тогда
						НоваяЗаписьНачислений.УК = ВыборкаДетальныеЗаписи.УК;
					Иначе
						НоваяЗаписьНачислений.УК = текДом.УК;
					КонецЕсли;
				Иначе
					НоваяЗаписьНачислений = НЗ.Добавить();
					НоваяЗаписьНачислений.ВидНачисления = Перечисления.ркВидыНачислений.ЕжемесячныеНачисления;
					НоваяЗаписьНачислений.ВидНормы = текВидТарифа.ВидНормы;
					НоваяЗаписьНачислений.ВидРасчета = КонстантыОбработки.ВидРасчетаЭлектроэнергия;
					НоваяЗаписьНачислений.ВидТарифа = текВидТарифа;
					НоваяЗаписьНачислений.ЕдиницаИзмерения = текВидТарифа.ЕдиницыУчета;
					НоваяЗаписьНачислений.ЕдиницаРасчета = текЕдиницаРасчета;
					НоваяЗаписьНачислений.КоличествоВПределахНормы = ВыборкаДетальныеЗаписи.КоличествоВПределахНормы;
					НоваяЗаписьНачислений.КоличествоСверхНормы = ВыборкаДетальныеЗаписи.КоличествоСверхНормы;
					НоваяЗаписьНачислений.ЛицевойСчет = текЛицевойСчет;
					НоваяЗаписьНачислений.НаОбщедомовыеНужды = Ложь;
					НоваяЗаписьНачислений.Период = ВыборкаДетальныеЗаписи.Период;
					НоваяЗаписьНачислений.ПериодЗадолженности = НачалоМесяца(ВыборкаДетальныеЗаписи.ПериодЗадолженности);
					НоваяЗаписьНачислений.Поставщик = КонстантыОбработки.Поставщик;
					НоваяЗаписьНачислений.СуммаНачислений = ВыборкаДетальныеЗаписи.СуммаНачислений;
					НоваяЗаписьНачислений.СуммаНачисленийВПределахНормы = ВыборкаДетальныеЗаписи.СуммаНачислений;
					НоваяЗаписьНачислений.Тариф = ВыборкаДетальныеЗаписи.ЗначениеТарифа;
					Если СокрЛП(ВыборкаДетальныеЗаписи.ТипОперации) = "Текущие" Тогда
						НоваяЗаписьНачислений.ТипОперации = Перечисления.ркТипыОперацийНачисления.НачисленияТекущегоПериода;
					Иначе
						НоваяЗаписьНачислений.ТипОперации = Перечисления.ркТипыОперацийНачисления.ПерерасчетыПрошлыхПериодов;
					КонецЕсли;
					Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.УК) Тогда
						НоваяЗаписьНачислений.УК = ВыборкаДетальныеЗаписи.УК;
					Иначе
						НоваяЗаписьНачислений.УК = текДом.УК;
					КонецЕсли;
				КонецЕсли;
				Если СокрЛП(ВыборкаДетальныеЗаписи.Среднее) = "Среднее" Тогда
					НоваяЗаписьНачислений.ВидПерерасчета = КонстантыОбработки.ВидПерерасчетаСреднее;
				ИначеЕсли СокрЛП(ВыборкаДетальныеЗаписи.Среднее) = "Среднее по нормативу" Тогда
					НоваяЗаписьНачислений.ВидПерерасчета = КонстантыОбработки.ВидПерерасчетаСреднееПоНормативу;
				КонецЕсли;

				СчетчикНачислений = СчетчикНачислений+1;
				Если СчетчикНачислений >= 1000 Тогда
					//Если ДокСоставНачислений.Состав.Количество() > 0 Тогда
					//	ДокСоставНачислений.Состав.Свернуть("НачалоДействия,ЛицевойСчет,ВидРасчета,ВидТарифа,СтатусУчастияВРасчетах,ЕдиницаРасчета,УК");
					//	ДокСоставНачислений.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
					//	ДокСоставНачислений.Записать(РежимЗаписиДокумента.Проведение);
					//КонецЕсли;
					
					НЗ.Записать(Истина);
					НЗгр.Записать(Истина);
					
					СчетчикНачислений = 0;
				КонецЕсли;
				
			КонецЦикла;
			Если СчетчикНачислений > 0 Тогда
				
				//Если ДокСоставНачислений.Состав.Количество() > 0 Тогда
				//	ДокСоставНачислений.Состав.Свернуть("НачалоДействия,ЛицевойСчет,ВидРасчета,ВидТарифа,СтатусУчастияВРасчетах,ЕдиницаРасчета,УК");
				//	ДокСоставНачислений.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
				//	ДокСоставНачислений.Записать(РежимЗаписиДокумента.Проведение);
				//КонецЕсли;
				
				НЗ.Записать(Истина);
				НЗгр.Записать(Истина);
				
				СчетчикНачислений = 0;
				
			КонецЕсли;
			
			//Для Каждого стрНорматив Из стрЛицевыеСчетаТЗ.Нормативы Цикл
			//	
			//	//ДатаНорматива
			//	//Норматив
			//	
			//	
			//КонецЦикла;
			Если НЕ ЗначениеЗаполнено(ЛицевойСчетОбъект.Код) Тогда
				ЛицевойСчетОбъект.УстановитьНовыйКод();
			КонецЕсли;
			ЛицевойСчетОбъект.ОбменДанными.Загрузка = Истина;
			ЛицевойСчетОбъект.Записать();
		КонецЦикла;
		
		Если ЭтоНовыйДом Тогда
			Для Каждого стрОдпуТЗ Из стрДомаТЗ.ОДПУ Цикл
				//Наименование
				//ДатаВыпуска
				//Номер
				//КлассТочности
				//НачальныеПоказания
				//ДатаВключения
				//ДатаПоверки
				//ДатаПроверки
				//МежповерочныйИнтервал
				
				//Счетчики могут повторяться
				//текСчетчик = Справочники.ркСчетчики.НайтиПоРеквизиту("Номер",стрОдпуТЗ.Номер,,текДом);
				текСчетчик = Справочники.ркСчетчики.НайтиПоНаименованию(стрОдпуТЗ.Номер,Истина,,текДом);
				Если текСчетчик.Пустая() Тогда
					СчетчикОбъект = Справочники.ркСчетчики.СоздатьЭлемент();
					СчетчикОбъект.Групповой = Истина;
					СчетчикОбъект.Владелец = текДом;
					//СчетчикОбъект.Наименование = стрОдпуТЗ.Наименование;
					СчетчикОбъект.Наименование = стрОдпуТЗ.Номер;
					СчетчикОбъект.ДатаВыпуска = стрОдпуТЗ.ДатаВыпуска;
					СчетчикОбъект.Номер = стрОдпуТЗ.Номер;
					СчетчикОбъект.КлассТочности = стрОдпуТЗ.КлассТочности;
					СчетчикОбъект.ОсновнойВидРасчета = КонстантыОбработки.ВидРасчетаЭлектроэнергия;
					СчетчикОбъект.Уровень = Справочники.ркУровниСчетчиков.Общедомовой;
					
					Если НЕ КонстантыОбработки.СвойствоДатаПоверки.Периодический Тогда
						стрДополнительныеРеквизиты = СчетчикОбъект.ДополнительныеРеквизиты.Добавить();
						стрДополнительныеРеквизиты.Свойство = КонстантыОбработки.СвойствоДатаПоверки;
						стрДополнительныеРеквизиты.Значение = стрОдпуТЗ.ДатаПоверки;
					КонецЕсли;			
					Если НЕ ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.КоэффициентТрансформации.Периодический Тогда
						стрДополнительныеРеквизиты = СчетчикОбъект.ДополнительныеРеквизиты.Добавить();
						стрДополнительныеРеквизиты.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.КоэффициентТрансформации;
						стрДополнительныеРеквизиты.Значение = стрОдпуТЗ.КоэффициентТрансформации;
					КонецЕсли;			
					Если НЕ КонстантыОбработки.СвойствоМежповерочныйИнтервал.Периодический Тогда
						стрДополнительныеРеквизиты = СчетчикОбъект.ДополнительныеРеквизиты.Добавить();
						стрДополнительныеРеквизиты.Свойство = КонстантыОбработки.СвойствоМежповерочныйИнтервал;
						стрДополнительныеРеквизиты.Значение = стрОдпуТЗ.МежповерочныйИнтервал;
					КонецЕсли;
					
					стрДополнительныеРеквизиты = СчетчикОбъект.ДополнительныеРеквизиты.Добавить();
					стрДополнительныеРеквизиты.Свойство = КонстантыОбработки.СвойствоТипПрибораУчета;
					стрДополнительныеРеквизиты.Значение = ПолучитьЗначениеСвойства(КонстантыОбработки.СвойствоТипПрибораУчета,стрОдпуТЗ.ТипПрибораУчета);
					
					стрДополнительныеРеквизиты = СчетчикОбъект.ДополнительныеРеквизиты.Добавить();
					стрДополнительныеРеквизиты.Свойство = КонстантыОбработки.СвойствоВидЭнергоназначений;
					стрДополнительныеРеквизиты.Значение = ПолучитьЗначениеСвойства(КонстантыОбработки.СвойствоВидЭнергоназначений,стрОдпуТЗ.ВидЭнергоназначений);
					
					стрДополнительныеРеквизиты = СчетчикОбъект.ДополнительныеРеквизиты.Добавить();
					стрДополнительныеРеквизиты.Свойство = КонстантыОбработки.СвойствоИсходныйКод;
					стрДополнительныеРеквизиты.Значение = СокрЛП(стрОдпуТЗ.ОДПУКод);
					
					//МассивВидовПоказаний = ОбщегоНазначенияКлиентСервер.СвернутьМассив(стрОдпуТЗ.ПоказанияОДПУ.ВыгрузитьКолонку("ВидПоказаний"));					
					//Для Каждого текВидПоказаний Из МассивВидовПоказаний Цикл
						
						//ВидПоказанийСпр = Справочники.ркВидыПоказанийСчетчиков.НайтиПоНаименованию(текВидПоказаний,Истина);
						//Если ВидПоказанийСпр.Пустая() Тогда
						//	НовыйВидПоказаний = Справочники.ркВидыПоказанийСчетчиков.СоздатьЭлемент();
						//	НовыйВидПоказаний.Наименование = текВидПоказаний;
						//	НовыйВидПоказаний.УстановитьНовыйКод();
						//	НовыйВидПоказаний.ОбменДанными.Загрузка = Истина;
						//	НовыйВидПоказаний.Записать();
						//	ВидПоказанийСпр = НовыйВидПоказаний.Ссылка;
						//КонецЕсли;				
						стрОдпуТЗ.ПоказанияОДПУ.Сортировать("ДатаПоказания Возр");
						
						стрВидыРасчетов = СчетчикОбъект.ВидыРасчетов.Добавить();
						стрВидыРасчетов.ВидРасчета = КонстантыОбработки.ВидРасчетаЭлектроэнергия;
						стрВидыРасчетов.ВидПоказаний = Справочники.ркВидыПоказанийСчетчиков.Обычные;
						стрВидыРасчетов.ЕдиницаРасчетаНормативногоКоличества = КонстантыОбработки.ЕдиницаКоличествоПроживающих;
						
						стрВидыПоказаний = СчетчикОбъект.ВидыПоказаний.Добавить();
						стрВидыПоказаний.ВидПоказаний = Справочники.ркВидыПоказанийСчетчиков.Обычные;
						стрВидыПоказаний.ЕдиницыУчета = КонстантыОбработки.Квтч;
						Если стрОдпуТЗ.ПоказанияОДПУ.Количество()>0 Тогда
							Для Каждого стрПоказаниеОДПУ Из стрОдпуТЗ.ПоказанияОДПУ Цикл
								//Если НЕ стрПоказаниеОДПУ.Состояние Тогда
								//	Продолжить;
								//КонецЕсли;
								стрВидыПоказаний.НачальныеПоказания = стрПоказаниеОДПУ.КонечныеПоказания;
								Прервать;
							КонецЦикла;
						КонецЕсли;
						
					//КонецЦикла;
					
					Если НЕ ЗначениеЗаполнено(СчетчикОбъект.Код) Тогда
						СчетчикОбъект.УстановитьНовыйКод();
					КонецЕсли;
					СчетчикОбъект.ОбменДанными.Загрузка = Истина;
					СчетчикОбъект.Записать();
					текСчетчик = СчетчикОбъект.Ссылка;
					
					Если КонстантыОбработки.СвойствоДатаПоверки.Периодический Тогда
						стрДокИзм = ДокИзм.Состав.Добавить();
						стрДокИзм.НачалоДействия = НачалоГода(ДатаОткрытия);
						стрДокИзм.Объект = СчетчикОбъект.Ссылка;
						стрДокИзм.Свойство = КонстантыОбработки.СвойствоДатаПоверки;
						стрДокИзм.Значение = стрОдпуТЗ.ДатаПоверки;
					КонецЕсли;			
					Если ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.КоэффициентТрансформации.Периодический Тогда
						стрДокИзм = ДокИзм.Состав.Добавить();
						стрДокИзм.НачалоДействия = НачалоГода(ДатаОткрытия);
						стрДокИзм.Объект = СчетчикОбъект.Ссылка;
						стрДокИзм.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.КоэффициентТрансформации;
						стрДокИзм.Значение = стрОдпуТЗ.КоэффициентТрансформации;
					КонецЕсли;			
					Если КонстантыОбработки.СвойствоМежповерочныйИнтервал.Периодический Тогда
						стрДокИзм = ДокИзм.Состав.Добавить();
						стрДокИзм.НачалоДействия = НачалоГода(ДатаОткрытия);
						стрДокИзм.Объект = СчетчикОбъект.Ссылка;
						стрДокИзм.Свойство = КонстантыОбработки.СвойствоМежповерочныйИнтервал;
						стрДокИзм.Значение = стрОдпуТЗ.МежповерочныйИнтервал;
					КонецЕсли;
					
					//ПоказанияОДПУ (ТЗ)
					
					ПервоеПоказание = Истина;
					
					стрОдпуТЗ.ПоказанияОДПУ.Сортировать("ДатаПоказания Возр");
					Для Каждого стрПоказанияОдпуТЗ Из стрОдпуТЗ.ПоказанияОДПУ Цикл
						
						//Если НЕ стрПоказанияОдпуТЗ.Состояние Тогда
						//	Продолжить;
						//КонецЕсли;
						
						Если ПервоеПоказание Тогда
							ПервоеПоказание = Ложь;
							Продолжить;
						КонецЕсли;
						//ВидПоказаний
						//МетодРасчета
						//НачальноеПоказание
						//КонечноеПоказание
						//Количество
						//ДатаПоказания
						//ДатаНачалаПериодаПоказаний
						//ДатаКонцаПериодаПоказаний
						
						//ВидПоказанийСпр = Справочники.ркВидыПоказанийСчетчиков.НайтиПоНаименованию(стрПоказанияОдпуТЗ.ВидПоказаний,Истина);
						//Если ВидПоказанийСпр.Пустая() Тогда
						//	НовыйВидПоказаний = Справочники.ркВидыПоказанийСчетчиков.СоздатьЭлемент();
						//	НовыйВидПоказаний.Наименование = стрПоказанияОдпуТЗ.ВидПоказаний;
						//	НовыйВидПоказаний.УстановитьНовыйКод();
						//	НовыйВидПоказаний.ОбменДанными.Загрузка = Истина;
						//	НовыйВидПоказаний.Записать();
						//	ВидПоказанийСпр = НовыйВидПоказаний.Ссылка;
						//КонецЕсли;
						
						СтрокаТЗГПУ = ТЗПоказанийГПУ.Добавить();
						СтрокаТЗГПУ.ПериодПоказаний = стрПоказанияОдпуТЗ.ДатаПоказания;
						СтрокаТЗГПУ.Счетчик = СчетчикОбъект.Ссылка;
						СтрокаТЗГПУ.ВидПоказаний = Справочники.ркВидыПоказанийСчетчиков.Обычные;
						СтрокаТЗГПУ.НачальныеПоказания = стрПоказанияОдпуТЗ.НачальныеПоказания;
						СтрокаТЗГПУ.КонечныеПоказания = стрПоказанияОдпуТЗ.КонечныеПоказания;
						СтрокаТЗГПУ.Количество = стрПоказанияОдпуТЗ.Количество;
						СтрокаТЗГПУ.КоэффициентТрансформации = ?(ЗначениеЗаполнено(стрОдпуТЗ.КоэффициентТрансформации),стрОдпуТЗ.КоэффициентТрансформации,1);
						
					КонецЦикла;
					
				КонецЕсли;
				
				СтруктураПоиска = Новый Структура("Счетчик,НачалоДействия", текСчетчик,стрОдпуТЗ.Период);
				НайденныеСтроки = ДокИзмГПУ.Состав.НайтиСтроки(СтруктураПоиска);
				Если НайденныеСтроки.Количество() = 0 Тогда
					стрДокИзмГПУ = ДокИзмГПУ.Состав.Добавить();
				Иначе
					стрДокИзмГПУ = НайденныеСтроки[0];
				КонецЕсли;
				стрДокИзмГПУ.Включен = стрОдпуТЗ.Действует;
				стрДокИзмГПУ.НачалоДействия = стрОдпуТЗ.Период;
				стрДокИзмГПУ.Счетчик = текСчетчик;

			КонецЦикла;
		КонецЕсли;
		Счетчик = Счетчик+1;
		
		Если Счетчик >= 500 И ТранзакцияАктивна Тогда 
			Если ДокИзм.Состав.Количество() > 0 Тогда
				ДокИзм.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
				ДокИзм.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			Если ДокПроживающие.Состав.Количество() > 0 Тогда
				ДокПроживающие.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
				ДокПроживающие.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			Если ДокИзмГПУ.Состав.Количество() > 0 Тогда
				ДокИзмГПУ.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
				ДокИзмГПУ.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			Если ДокИзмИПУ.Состав.Количество() > 0 Тогда
				ДокИзмИПУ.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
				ДокИзмИПУ.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			Если ДокОплата.Состав.Количество() > 0 Тогда
				ДокОплата.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
				//ДокОплата.ОбменДанными.Загрузка = Истина;
				ДокОплата.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			Если ДокДомУК.Состав.Количество() > 0 Тогда
				ДокДомУК.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
				ДокДомУК.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			
			//Если ДокНепредоставление.Состав.Количество() > 0 Тогда
			//	ДокНепредоставление.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
			//	ДокНепредоставление.Записать(РежимЗаписиДокумента.Проведение);
			//КонецЕсли;

			//Если ДокСоставНачислений.Состав.Количество() > 0 Тогда
			//	ДокСоставНачислений.Состав.Свернуть("НачалоДействия,ЛицевойСчет,ВидРасчета,ВидТарифа,СтатусУчастияВРасчетах,ЕдиницаРасчета,УК");
			//	ДокСоставНачислений.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
			//	ДокСоставНачислений.Записать(РежимЗаписиДокумента.Проведение);
			//КонецЕсли;
			//НЗ.Записать(Истина);
			//НЗгр.Записать(Истина);
			
			НЗЗадолженность.Записать(Истина);
			
			ЗафиксироватьТранзакцию();
			Счетчик = 0;
			ТранзакцияАктивна = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТранзакцияАктивна Тогда
		
		Если ДокИзм <> Неопределено и ДокИзм.Состав.Количество()>0 Тогда
			ДокИзм.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
			ДокИзм.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		Если ДокИзмГПУ <> Неопределено и ДокИзмГПУ.Состав.Количество()>0 Тогда
			ДокИзмГПУ.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
			ДокИзмГПУ.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		Если ДокПроживающие <> Неопределено и ДокПроживающие.Состав.Количество()>0 Тогда
			ДокПроживающие.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
			ДокПроживающие.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		Если ДокИзмИПУ <> Неопределено и ДокИзмИПУ.Состав.Количество()>0 Тогда
			ДокИзмИПУ.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
			ДокИзмИПУ.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		Если ДокОплата <> Неопределено и ДокОплата.Состав.Количество()>0 Тогда
			ДокОплата.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
			//ДокОплата.ОбменДанными.Загрузка = Истина;
			ДокОплата.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		Если ДокДомУК.Состав.Количество() > 0 Тогда
			ДокДомУК.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
			ДокДомУК.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		//Если ДокНепредоставление <> Неопределено И ДокНепредоставление.Состав.Количество() > 0 Тогда
		//	ДокНепредоставление.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
		//	Попытка
		//		ДокНепредоставление.Записать(РежимЗаписиДокумента.Проведение);
		//	Исключение
		//		ДокНепредоставление.Записать(РежимЗаписиДокумента.Запись);
		//	КонецПопытки;
		//КонецЕсли;

		//Если ДокСоставНачислений <> Неопределено и ДокСоставНачислений.Состав.Количество()>0 Тогда
		//	ДокСоставНачислений.Состав.Свернуть("НачалоДействия,ЛицевойСчет,ВидРасчета,ВидТарифа,СтатусУчастияВРасчетах,ЕдиницаРасчета,УК");
		//	ДокСоставНачислений.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
		//	ДокСоставНачислений.Записать(РежимЗаписиДокумента.Проведение);
		//КонецЕсли;

		//НЗ.Записать(Истина);
		//НЗгр.Записать(Истина);
		НЗЗадолженность.Записать(Истина);
		ЗафиксироватьТранзакцию();
		
	КонецЕсли;

	ЗаписатьПоказания(ТЗПоказаний,КонстантыОбработки);
	ЗаписатьПоказанияГПУ(ТЗПоказанийГПУ,КонстантыОбработки);
	ЗаписатьНепредоставления(ТЗНепредоставлений);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКоличествоПереворот(пУменьшаемое,пВычитаемое)
	пВычитаемоеРазр = Окр(пВычитаемое);
	пВычитаемоеРазрСтрока = СтрЗаменить(Строка(пВычитаемоеРазр),Символы.НПП,"");
	тДлина = СтрДлина(пВычитаемоеРазрСтрока);
	тРазрядность = 1;
	Для сч = 1 По тДлина Цикл
		тРазрядность = тРазрядность*10;
	КонецЦикла;	
	тРезультат = тРазрядность-пВычитаемое+пУменьшаемое;
	Возврат тРезультат;
КонецФункции

&НаСервере
Процедура ЗаписатьНепредоставления(пТЗ)
	
	Если пТЗ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	пТЗ.Сортировать("ДатаОкончанияПоказаний Возр");
	предДатаОкончанияПоказаний = пТЗ[0].ДатаОкончанияПоказаний;
	
	ДокНепредоставление = Документы.ркНачисленияПриНепредоставленииПоказанийСчетчиков.СоздатьДокумент();
	ДокНепредоставление.Организация = Организация;
	ДокНепредоставление.Дата = пТЗ[0].ДатаОкончанияПоказаний;
	ДокНепредоставление.Комментарий = "Загрузка данных "+ТекущаяДата();
	ДокНепредоставление.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	ДокНепредоставление.ТипОперации = Перечисления.ркТипыОперацийПоказанийСчетчиков.ПоказанияЗаПериод;

	
	Для каждого тСтрока Из пТЗ Цикл
	
		Если тСтрока.ДатаОкончанияПоказаний <> предДатаОкончанияПоказаний Тогда
			//записать предыдущий документ
			Если ДокНепредоставление.Состав.Количество()>0 Тогда
				ДокНепредоставление.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
				ДокНепредоставление.Проведен = Истина;
				ДокНепредоставление.Записать(РежимЗаписиДокумента.Запись);
				
				ПровестиНепредоставление(ДокНепредоставление.Ссылка);
				
			КонецЕсли;
			//начать новый
			
			ДокНепредоставление = Документы.ркНачисленияПриНепредоставленииПоказанийСчетчиков.СоздатьДокумент();
			ДокНепредоставление.Организация = Организация;
			ДокНепредоставление.Дата = тСтрока.ДатаОкончанияПоказаний;
			ДокНепредоставление.Комментарий = "Загрузка данных "+ТекущаяДата();
			ДокНепредоставление.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			ДокНепредоставление.ТипОперации = Перечисления.ркТипыОперацийПоказанийСчетчиков.ПоказанияЗаПериод;

			
		КонецЕсли;
		
		НоваяСтрокаТЧ = ДокНепредоставление.Состав.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ,тСтрока);
		
		предДатаОкончанияПоказаний = тСтрока.ДатаОкончанияПоказаний;
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПровестиНепредоставление(Ссылка)

	ПроводитьПоказанияПриборовУчетаЗаПрошлыеПериодыКакПерерасчет = Константы.ркПроводитьПоказанияПриборовУчетаЗаПрошедшиеПериодыКакПерерасчет.Получить();
	
	ДатаНачалаТекущегоРасчетногоПериода = ПараметрыСеанса.ркДатаТекущегоРасчетногоПериода;
	
	НЗркПоказания = РегистрыНакопления.ркПоказанияСчетчиков.СоздатьНаборЗаписей();
	НЗркПоказания.Отбор.Регистратор.Установить(Ссылка);
	НЗркПоказания.Прочитать();
	НЗркПоказания.Очистить();
	НЗркПоказания.Записать();

	
	МетодРасчетаПоСреднемесячномуПотреблению = Перечисления.рцМетодыРасчетаПоказанийИПУ.ПоСреднемесячномуПотреблению;
	МетодРасчетаПоНормативу = Перечисления.рцМетодыРасчетаПоказанийИПУ.ПоНормативу;
	МетодРасчетаИстекСрокПоверки = Перечисления.рцМетодыРасчетаПоказанийИПУ.ИстекСрокПоверки;
	ТипОперацииПерерасчетыПрошлыхПериодов = Перечисления.ркТипыОперацийНачисления.ПерерасчетыПрошлыхПериодов;
	ТипОперацииНачисленияТекущегоПериода = Перечисления.ркТипыОперацийНачисления.НачисленияТекущегоПериода;
	ВидНачисленияЕжемесячныеНачисления = Перечисления.ркВидыНачислений.ЕжемесячныеНачисления;
	Индивидуальный = Справочники.ркУровниСчетчиков.Индивидуальный;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	|	ркНачисленияПриНепредоставленииПоказанийСчетчиковСостав.Счетчик,
	|	ркНачисленияПриНепредоставленииПоказанийСчетчиковСостав.ВидПоказаний,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ркНачисленияПриНепредоставленииПоказанийСчетчиковСостав.МетодРасчета) КАК МетодРасчета,
	|	МАКСИМУМ(ркНачисленияПриНепредоставленииПоказанийСчетчиковСостав.НомерСтроки) КАК НомерСтроки
	|ИЗ
	|	Документ.ркНачисленияПриНепредоставленииПоказанийСчетчиков.Состав КАК ркНачисленияПриНепредоставленииПоказанийСчетчиковСостав
	|ГДЕ
	|	ркНачисленияПриНепредоставленииПоказанийСчетчиковСостав.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ркНачисленияПриНепредоставленииПоказанийСчетчиковСостав.Счетчик,
	|	ркНачисленияПриНепредоставленииПоказанийСчетчиковСостав.ВидПоказаний
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ркНачисленияПриНепредоставленииПоказанийСчетчиковСостав.МетодРасчета) > 1";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество()> 0 Тогда
		Пока Выборка.Следующий() Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Метод расчета "+ Выборка.Счетчик +" неоднозначний",Ссылка,"Состав["+Строка(Выборка.НомерСтроки-1)+"].МетодРасчета","Объект");
	 	КонецЦикла;
	    Отказ = Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("КомпенсироватьНачальныеПоказания", Ложь);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ркНачисленияПриНепредоставленииПоказанийСчетчиковСостав.Счетчик КАК Счетчик,
	|	ркНачисленияПриНепредоставленииПоказанийСчетчиковСостав.ВидРасчета КАК ВидРасчета,
	|	ВЫБОР
	|		КОГДА ркНачисленияПриНепредоставленииПоказанийСчетчиковСостав.ВидПоказаний = ЗНАЧЕНИЕ(Справочник.ркВидыПоказанийСчетчиков.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ркВидыПоказанийСчетчиков.Обычные)
	|		ИНАЧЕ ркНачисленияПриНепредоставленииПоказанийСчетчиковСостав.ВидПоказаний
	|	КОНЕЦ КАК ВидПоказаний,
	|	ркНачисленияПриНепредоставленииПоказанийСчетчиковСостав.ЛицевойСчет.Дом КАК Дом,
	|	ркНачисленияПриНепредоставленииПоказанийСчетчиковСостав.ЛицевойСчет.Помещение КАК Помещение,
	|	ркНачисленияПриНепредоставленииПоказанийСчетчиковСостав.Количество КАК Количество,
	|	ркНачисленияПриНепредоставленииПоказанийСчетчиковСостав.ЛицевойСчет КАК ЛицевойСчет,
	|	ркНачисленияПриНепредоставленииПоказанийСчетчиковСостав.ДатаНачалаПоказаний КАК ДатаНачалаПоказаний,
	|	ркНачисленияПриНепредоставленииПоказанийСчетчиковСостав.ДатаОкончанияПоказаний КАК ДатаОкончанияПоказаний,
	|	ркНачисленияПриНепредоставленииПоказанийСчетчиковСостав.НормативныеПоказания КАК НормативныеПоказания,
	|	ркНачисленияПриНепредоставленииПоказанийСчетчиковСостав.СреднемесячныеПоказания КАК СреднемесячныеПоказания,
	|	ркНачисленияПриНепредоставленииПоказанийСчетчиковСостав.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ркНачисленияПриНепредоставленииПоказанийСчетчиковСостав.МетодРасчета КАК МетодРасчета,
	|	ркНачисленияПриНепредоставленииПоказанийСчетчиковСостав.Ссылка КАК Ссылка,
	|	ркНачисленияПриНепредоставленииПоказанийСчетчиковСостав.НомерСтроки
	|ПОМЕСТИТЬ ВТСостав
	|ИЗ
	|	Документ.ркНачисленияПриНепредоставленииПоказанийСчетчиков.Состав КАК ркНачисленияПриНепредоставленииПоказанийСчетчиковСостав
	|ГДЕ
	|	ркНачисленияПриНепредоставленииПоказанийСчетчиковСостав.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	рцПоказанияСчетчиков.НачальныеПоказания,
	|	рцПоказанияСчетчиков.Счетчик,
	|	рцПоказанияСчетчиков.ВидПоказаний,
	|	рцПоказанияСчетчиков.Период КАК Период,
	|	рцПоказанияСчетчиков.ДатаДокумента КАК ДатаДокумента,
	|	рцПоказанияСчетчиков.Автор
	|ПОМЕСТИТЬ ВТНачальныеПоказания0
	|ИЗ
	|	ВТСостав КАК ВТСостав
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.рцПоказанияСчетчиков КАК рцПоказанияСчетчиков
	|		ПО (рцПоказанияСчетчиков.Счетчик = ВТСостав.Счетчик)
	|			И (рцПоказанияСчетчиков.ВидПоказаний = ВТСостав.ВидПоказаний)
	|			И (рцПоказанияСчетчиков.Период <= ВТСостав.ДатаНачалаПоказаний)
	|			И (рцПоказанияСчетчиков.Автор <> ВТСостав.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНачальныеПоказания0.Счетчик,
	|	ВТНачальныеПоказания0.ВидПоказаний,
	|	МАКСИМУМ(ВТНачальныеПоказания0.Период) КАК Период
	|ПОМЕСТИТЬ ВТНачальныеПоказания1
	|ИЗ
	|	ВТНачальныеПоказания0 КАК ВТНачальныеПоказания0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТНачальныеПоказания0.Счетчик,
	|	ВТНачальныеПоказания0.ВидПоказаний
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНачальныеПоказания1.Счетчик,
	|	ВТНачальныеПоказания1.ВидПоказаний,
	|	ВТНачальныеПоказания1.Период,
	|	МАКСИМУМ(ВТНачальныеПоказания0.ДатаДокумента) КАК ДатаДокумента
	|ПОМЕСТИТЬ ВТНачальныеПоказания2
	|ИЗ
	|	ВТНачальныеПоказания0 КАК ВТНачальныеПоказания0
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНачальныеПоказания1 КАК ВТНачальныеПоказания1
	|		ПО ВТНачальныеПоказания0.Счетчик = ВТНачальныеПоказания1.Счетчик
	|			И ВТНачальныеПоказания0.ВидПоказаний = ВТНачальныеПоказания1.ВидПоказаний
	|			И ВТНачальныеПоказания0.Период = ВТНачальныеПоказания1.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТНачальныеПоказания1.Счетчик,
	|	ВТНачальныеПоказания1.ВидПоказаний,
	|	ВТНачальныеПоказания1.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНачальныеПоказания0.Счетчик,
	|	ВТНачальныеПоказания0.ВидПоказаний,
	|	ВТНачальныеПоказания0.Период,
	|	ВТНачальныеПоказания0.ДатаДокумента,
	|	МАКСИМУМ(ВТНачальныеПоказания0.Автор) КАК Автор
	|ПОМЕСТИТЬ ВТНачальныеПоказания3
	|ИЗ
	|	ВТНачальныеПоказания0 КАК ВТНачальныеПоказания0
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНачальныеПоказания2 КАК ВТНачальныеПоказания2
	|		ПО ВТНачальныеПоказания0.Счетчик = ВТНачальныеПоказания2.Счетчик
	|			И ВТНачальныеПоказания0.ВидПоказаний = ВТНачальныеПоказания2.ВидПоказаний
	|			И ВТНачальныеПоказания0.Период = ВТНачальныеПоказания2.Период
	|			И ВТНачальныеПоказания0.ДатаДокумента = ВТНачальныеПоказания2.ДатаДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТНачальныеПоказания0.Счетчик,
	|	ВТНачальныеПоказания0.ВидПоказаний,
	|	ВТНачальныеПоказания0.Период,
	|	ВТНачальныеПоказания0.ДатаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНачальныеПоказания0.Счетчик,
	|	ВТНачальныеПоказания0.ВидПоказаний,
	|	МАКСИМУМ(ВТНачальныеПоказания0.НачальныеПоказания) КАК НачальныеПоказания
	|ПОМЕСТИТЬ ВТНачальныеПоказания
	|ИЗ
	|	ВТНачальныеПоказания0 КАК ВТНачальныеПоказания0
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНачальныеПоказания3 КАК ВТНачальныеПоказания3
	|		ПО ВТНачальныеПоказания0.Счетчик = ВТНачальныеПоказания3.Счетчик
	|			И ВТНачальныеПоказания0.ВидПоказаний = ВТНачальныеПоказания3.ВидПоказаний
	|			И ВТНачальныеПоказания0.Период = ВТНачальныеПоказания3.Период
	|			И ВТНачальныеПоказания0.ДатаДокумента = ВТНачальныеПоказания3.ДатаДокумента
	|			И ВТНачальныеПоказания0.Автор = ВТНачальныеПоказания3.Автор
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТНачальныеПоказания0.Счетчик,
	|	ВТНачальныеПоказания0.ВидПоказаний
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСостав.Счетчик,
	|	ВТСостав.ВидРасчета,
	|	ВТСостав.ВидПоказаний,
	|	ВТСостав.Дом,
	|	ВТСостав.Помещение,
	|	ВТСостав.Количество,
	|	ВТСостав.ЛицевойСчет,
	|	ВТСостав.ДатаНачалаПоказаний,
	|	ВТСостав.ДатаОкончанияПоказаний,
	|	ВТСостав.НормативныеПоказания,
	|	ВТСостав.СреднемесячныеПоказания,
	|	ВТСостав.ЕдиницаИзмерения,
	|	ВТСостав.МетодРасчета,
	|	ВТСостав.Ссылка,
	|	ЕСТЬNULL(ВТНачальныеПоказания.НачальныеПоказания, 0) КАК НачальныеПоказания,
	|	ВТСостав.НомерСтроки,
	|	НАЧАЛОПЕРИОДА(ВТСостав.ДатаНачалаПоказаний, МЕСЯЦ) КАК Период
	|ПОМЕСТИТЬ втИтог
	|ИЗ
	|	ВТСостав КАК ВТСостав
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачальныеПоказания КАК ВТНачальныеПоказания
	|		ПО ВТСостав.Счетчик = ВТНачальныеПоказания.Счетчик
	|			И ВТСостав.ВидПоказаний = ВТНачальныеПоказания.ВидПоказаний
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИтог.Счетчик,
	|	втИтог.ВидПоказаний,
	|	втИтог.Период,
	|	МАКСИМУМ(втИтог.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ втИтогМаксСтрока
	|ИЗ
	|	втИтог КАК втИтог
	|
	|СГРУППИРОВАТЬ ПО
	|	втИтог.Счетчик,
	|	втИтог.ВидПоказаний,
	|	втИтог.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИтог.Счетчик,
	|	втИтог.ВидРасчета,
	|	втИтог.ВидПоказаний,
	|	втИтог.Дом,
	|	втИтог.Помещение,
	|	втИтог.Количество,
	|	втИтог.ЛицевойСчет,
	|	втИтог.ДатаНачалаПоказаний,
	|	втИтог.ДатаОкончанияПоказаний,
	|	втИтог.НормативныеПоказания,
	|	втИтог.СреднемесячныеПоказания,
	|	втИтог.ЕдиницаИзмерения,
	|	втИтог.МетодРасчета,
	|	втИтог.Ссылка,
	|	ВЫБОР
	|		КОГДА &КомпенсироватьНачальныеПоказания
	|			ТОГДА втИтог.НачальныеПоказания - втИтог.Количество
	|		ИНАЧЕ втИтог.НачальныеПоказания
	|	КОНЕЦ КАК НачальныеПоказания,
	|	втИтог.НомерСтроки,
	|	втИтог.Период
	|ПОМЕСТИТЬ втИтогОтобранныеСтроки
	|ИЗ
	|	втИтог КАК втИтог
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втИтогМаксСтрока КАК втИтогМаксСтрока
	|		ПО втИтог.Счетчик = втИтогМаксСтрока.Счетчик
	|			И втИтог.ВидПоказаний = втИтогМаксСтрока.ВидПоказаний
	|			И втИтог.Период = втИтогМаксСтрока.Период
	|			И втИтог.НомерСтроки = втИтогМаксСтрока.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИтогОтобранныеСтроки.Счетчик,
	|	втИтогОтобранныеСтроки.ВидРасчета,
	|	втИтогОтобранныеСтроки.ВидПоказаний,
	|	втИтогОтобранныеСтроки.Дом,
	|	втИтогОтобранныеСтроки.Помещение,
	|	0 КАК Количество,
	|	втИтогОтобранныеСтроки.ЛицевойСчет,
	|	втИтогОтобранныеСтроки.ДатаНачалаПоказаний,
	|	втИтогОтобранныеСтроки.ДатаОкончанияПоказаний,
	|	втИтогОтобранныеСтроки.НормативныеПоказания,
	|	втИтогОтобранныеСтроки.СреднемесячныеПоказания,
	|	втИтогОтобранныеСтроки.ЕдиницаИзмерения,
	|	НЕОПРЕДЕЛЕНО КАК МетодРасчета,
	|	втИтогОтобранныеСтроки.Ссылка,
	|	втИтогОтобранныеСтроки.НачальныеПоказания + втИтогОтобранныеСтроки.Количество КАК НачальныеПоказания,
	|	втИтогОтобранныеСтроки.НомерСтроки,
	|	ДОБАВИТЬКДАТЕ(втИтогОтобранныеСтроки.Период, МЕСЯЦ, 1) КАК Период
	|ПОМЕСТИТЬ втСледующийМесяц
	|ИЗ
	|	втИтогОтобранныеСтроки КАК втИтогОтобранныеСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСледующийМесяц.Счетчик,
	|	втСледующийМесяц.ВидРасчета,
	|	втСледующийМесяц.ВидПоказаний,
	|	втСледующийМесяц.Дом,
	|	втСледующийМесяц.Помещение,
	|	втСледующийМесяц.Количество,
	|	втСледующийМесяц.ЛицевойСчет,
	|	втСледующийМесяц.ДатаНачалаПоказаний,
	|	втСледующийМесяц.ДатаОкончанияПоказаний,
	|	втСледующийМесяц.НормативныеПоказания,
	|	втСледующийМесяц.СреднемесячныеПоказания,
	|	втСледующийМесяц.ЕдиницаИзмерения,
	|	втСледующийМесяц.МетодРасчета,
	|	втСледующийМесяц.Ссылка,
	|	втСледующийМесяц.НачальныеПоказания,
	|	втСледующийМесяц.НомерСтроки,
	|	втСледующийМесяц.Период
	|ПОМЕСТИТЬ втСледующийМесяцИтог
	|ИЗ
	|	втСледующийМесяц КАК втСледующийМесяц
	|		ЛЕВОЕ СОЕДИНЕНИЕ втИтогОтобранныеСтроки КАК втИтогОтобранныеСтроки
	|		ПО втСледующийМесяц.Период = втИтогОтобранныеСтроки.Период
	|			И втСледующийМесяц.Счетчик = втИтогОтобранныеСтроки.Счетчик
	|			И втСледующийМесяц.ВидПоказаний = втИтогОтобранныеСтроки.ВидПоказаний
	|ГДЕ
	|	втИтогОтобранныеСтроки.Ссылка ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИтог.Счетчик,
	|	втИтог.ВидРасчета,
	|	втИтог.ВидПоказаний,
	|	втИтог.Дом,
	|	втИтог.Помещение,
	|	втИтог.Количество,
	|	втИтог.ЛицевойСчет,
	|	втИтог.ДатаНачалаПоказаний,
	|	втИтог.ДатаОкончанияПоказаний,
	|	втИтог.НормативныеПоказания,
	|	втИтог.СреднемесячныеПоказания,
	|	втИтог.ЕдиницаИзмерения,
	|	втИтог.МетодРасчета,
	|	втИтог.Ссылка,
	|	втИтог.НачальныеПоказания,
	|	втИтог.НомерСтроки,
	|	втИтог.Период
	|ИЗ
	|	втИтог КАК втИтог
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИтогОтобранныеСтроки.Счетчик,
	|	втИтогОтобранныеСтроки.ВидРасчета,
	|	втИтогОтобранныеСтроки.ВидПоказаний,
	|	втИтогОтобранныеСтроки.Дом,
	|	втИтогОтобранныеСтроки.Помещение,
	|	втИтогОтобранныеСтроки.Количество,
	|	втИтогОтобранныеСтроки.ЛицевойСчет,
	|	втИтогОтобранныеСтроки.ДатаНачалаПоказаний,
	|	втИтогОтобранныеСтроки.ДатаОкончанияПоказаний,
	|	втИтогОтобранныеСтроки.НормативныеПоказания,
	|	втИтогОтобранныеСтроки.СреднемесячныеПоказания,
	|	втИтогОтобранныеСтроки.ЕдиницаИзмерения,
	|	втИтогОтобранныеСтроки.МетодРасчета,
	|	втИтогОтобранныеСтроки.Ссылка,
	|	втИтогОтобранныеСтроки.НачальныеПоказания,
	|	втИтогОтобранныеСтроки.НомерСтроки,
	|	втИтогОтобранныеСтроки.Период
	|ИЗ
	|	втИтогОтобранныеСтроки КАК втИтогОтобранныеСтроки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втСледующийМесяцИтог.Счетчик,
	|	втСледующийМесяцИтог.ВидРасчета,
	|	втСледующийМесяцИтог.ВидПоказаний,
	|	втСледующийМесяцИтог.Дом,
	|	втСледующийМесяцИтог.Помещение,
	|	втСледующийМесяцИтог.Количество,
	|	втСледующийМесяцИтог.ЛицевойСчет,
	|	втСледующийМесяцИтог.ДатаНачалаПоказаний,
	|	втСледующийМесяцИтог.ДатаОкончанияПоказаний,
	|	втСледующийМесяцИтог.НормативныеПоказания,
	|	втСледующийМесяцИтог.СреднемесячныеПоказания,
	|	втСледующийМесяцИтог.ЕдиницаИзмерения,
	|	втСледующийМесяцИтог.МетодРасчета,
	|	втСледующийМесяцИтог.Ссылка,
	|	втСледующийМесяцИтог.НачальныеПоказания,
	|	втСледующийМесяцИтог.НомерСтроки,
	|	втСледующийМесяцИтог.Период
	|ИЗ
	|	втСледующийМесяцИтог КАК втСледующийМесяцИтог";
	
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	РезультатНакопления = МассивРезультатов[МассивРезультатов.Количество()-2];
	РезультатСведений = МассивРезультатов[МассивРезультатов.Количество()-1];
	
	Выборка = РезультатНакопления.Выбрать();
	
	ВидПоказанийСчетчиковОбычные = Справочники.ркВидыПоказанийСчетчиков.Обычные;
	
	Пока Выборка.Следующий() Цикл
		
		НачальныеПоказания = Выборка.НачальныеПоказания;		
		
		ПериодДействия = Выборка.ДатаНачалаПоказаний;
		
		ДвижениеРК = НЗркПоказания.Добавить();
		
		ДвижениеРК.Период 			= Ссылка.Дата;
		Если ПроводитьПоказанияПриборовУчетаЗаПрошлыеПериодыКакПерерасчет И ПериодДействия < ДатаНачалаТекущегоРасчетногоПериода Тогда 
			ДвижениеРК.ТипОперации = ТипОперацииПерерасчетыПрошлыхПериодов;
		Иначе
			ДвижениеРК.ТипОперации = ТипОперацииНачисленияТекущегоПериода;
		КонецЕсли;
		
		ЛицевойСчет = Выборка.ЛицевойСчет;
		
		//ДвижениеРК.ВидНачисления 		= ВидНачисленияЕжемесячныеНачисления;
		ДвижениеРК.ПериодДействия 	= ПериодДействия;
		ДвижениеРК.ЛицевойСчет        = ЛицевойСчет;
		ДвижениеРК.Помещение          = Выборка.Помещение;
		ДвижениеРК.Дом                = Выборка.Дом;
		ДвижениеРК.Счетчик            = Выборка.Счетчик;
		ДвижениеРК.ВидРасчета         = Выборка.ВидРасчета;
		ДвижениеРК.ВидПоказаний       = Выборка.ВидПоказаний;
		//ДвижениеРК.ПоНормативу        = Истина;
		ДвижениеРК.ГрупповыеПоказания = Ложь;
		ДвижениеРК.Уровень			= Индивидуальный;
		ДвижениеРК.ЕдиницаИзмерения   = Выборка.ЕдиницаИзмерения;
		ДвижениеРК.Количество         = Выборка.Количество;
		ДвижениеРК.Делитель           = 1;
		
		ДвижениеРК.НачальноеКоличество= НачальныеПоказания;
		ДвижениеРК.ДатаНачала			= Выборка.ДатаНачалаПоказаний;
		ДвижениеРК.ДатаОкончания		= Выборка.ДатаОкончанияПоказаний;
				
	КонецЦикла;
	
	НЗркПоказания.Записать(Истина);
	
	
	рцПоказанияСчетчиковНЗ = РегистрыСведений.рцПоказанияСчетчиков.СоздатьНаборЗаписей();
	рцПоказанияСчетчиковНЗ.Отбор.Автор.Установить(Ссылка);
	рцПоказанияСчетчиковНЗ.Записать(Истина);
	
	Выборка = РезультатСведений.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		стрНЗ = рцПоказанияСчетчиковНЗ.Добавить();
		стрНЗ.Автор = Ссылка;
		стрНЗ.Счетчик = Выборка.Счетчик;
		стрНЗ.Период = Выборка.Период;
		стрНЗ.ДатаДокумента = Ссылка.Дата;
		стрНЗ.НачальныеПоказания = Выборка.НачальныеПоказания;
		стрНЗ.Количество = Выборка.Количество;
		стрНЗ.МетодРасчета = Выборка.МетодРасчета;
		стрНЗ.ВидПоказаний = Выборка.ВидПоказаний;

	КонецЦикла;
	рцПоказанияСчетчиковНЗ.Записать(Ложь);	

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьВремТаб(МенеджерВремТаб,ИмяВремтаб ="",Порядок = "")
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВремТаб;
	Запрос.Текст =
	"ВЫБРАТЬ
	| *
	|ИЗ
	| ВремТаб КАК ВремТаб
	|
	|УПОРЯДОЧИТЬ ПО Порядок";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВремТаб",ИмяВремтаб); 
	Если Порядок = "" тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"УПОРЯДОЧИТЬ ПО Порядок","");
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Порядок",Порядок);
	КонецЕсли; 
	
	ТЗ = Запрос.Выполнить().Выгрузить(); 
	
	Возврат ТЗ; 
	
КонецФункции

&НаСервере
Процедура ЗаписатьПоказания(пТЗ,КонстантыОбработки,Дозагрузка = Ложь)
	
	пТЗ.Сортировать("ПериодДействия Возр,КодСчетчика Возр, КонечныеПоказания Возр");
	ДокПоказанияСчетчиков = Неопределено;
	
	ТранзакцияАктивна = Ложь;
	ПредыдущийПериодДействия = Дата(1,1,1);
	ПредыдущийКодСчетчика = 0;
	Счетчик = 0;
	
	ДельтаПериода = 0;
	Для Каждого СтрокаТЗ ИЗ пТЗ Цикл
		Если СтрокаТЗ.ОтчетныйПериод >= ДатаОграничения И НЕ Дозагрузка Тогда
			Продолжить;
		КонецЕсли;
		Если ТранзакцияАктивна И (Счетчик = 1000 ИЛИ СтрокаТЗ.ПериодДействия <> ПредыдущийПериодДействия ИЛИ СтрокаТЗ.КодСчетчика = ПредыдущийКодСчетчика) Тогда
			ДокПоказанияСчетчиков.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
			ДокПоказанияСчетчиков.Записать(РежимЗаписиДокумента.Проведение);			
			Счетчик = 0;
			ТранзакцияАктивна = Ложь;
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
		Если НЕ ТранзакцияАктивна Тогда
			
			НачатьТранзакцию();
			ТранзакцияАктивна = Истина;
			ДокПоказанияСчетчиков = Документы.ркПоказанияСчетчиков.СоздатьДокумент();
			Если СтрокаТЗ.ПериодДействия = ПредыдущийПериодДействия Тогда
				ДельтаПериода = ДельтаПериода + 10;
			Иначе
				ДельтаПериода = 0;
			КонецЕсли;
			ДокПоказанияСчетчиков.Дата = СтрокаТЗ.ПериодДействия+ДельтаПериода;
			ДокПоказанияСчетчиков.Комментарий = "Загрузка данных "+ТекущаяДата();
			ДокПоказанияСчетчиков.Организация = Организация;
			ДокПоказанияСчетчиков.Ответственный = ПараметрыСеанса.ТекущийПользователь;			
			ДокПоказанияСчетчиков.ТипОперации = Перечисления.ркТипыОперацийПоказанийСчетчиков.ПоказанияЗаПериод;
			ДокПоказанияСчетчиков.ИсточникПоказаний = Перечисления.рцИсточникПоказанийИПУ.ИсторияПоказаний;
			
		КонецЕсли;
		
		НоваяСтрокаТЧ = ДокПоказанияСчетчиков.СоставРаспределенныхПоказаний.Добавить();
		НоваяСтрокаТЧ.ВидНачисления = Перечисления.ркВидыНачислений.ЕжемесячныеНачисления;
		НоваяСтрокаТЧ.ВидПоказаний = СтрокаТЗ.ВидПоказаний;
		НоваяСтрокаТЧ.ВидРасчета = КонстантыОбработки.ВидРасчетаЭлектроэнергия;
		НоваяСтрокаТЧ.ДатаНачала = СтрокаТЗ.ДатаНачала;
		НоваяСтрокаТЧ.ДатаОкончания = СтрокаТЗ.ДатаОкончания;
		НоваяСтрокаТЧ.Делитель = 1;
		НоваяСтрокаТЧ.Дом = СтрокаТЗ.Дом;
		НоваяСтрокаТЧ.ЕдиницаИзмерения = КонстантыОбработки.Квтч;
		НоваяСтрокаТЧ.Количество = СтрокаТЗ.Количество;
		НоваяСтрокаТЧ.ЛицевойСчет = СтрокаТЗ.ЛицевойСчет;
		НоваяСтрокаТЧ.НачальноеКоличество = СтрокаТЗ.НачальноеКоличество;
		НоваяСтрокаТЧ.ПериодДействия = СтрокаТЗ.ДатаНачала;
		НоваяСтрокаТЧ.Помещение = СтрокаТЗ.Помещение;
		НоваяСтрокаТЧ.Счетчик = СтрокаТЗ.Счетчик;
		НоваяСтрокаТЧ.ТипОперации = Перечисления.ркТипыОперацийНачисления.НачисленияТекущегоПериода;
		НоваяСтрокаТЧ.Уровень = Справочники.ркУровниСчетчиков.Индивидуальный;
		
		НоваяСтрокаТЧСостав = ДокПоказанияСчетчиков.Состав.Добавить();
		НоваяСтрокаТЧСостав.ВидНачисления = НоваяСтрокаТЧ.ВидНачисления;
		НоваяСтрокаТЧСостав.ВидПоказаний = НоваяСтрокаТЧ.ВидПоказаний;
		НоваяСтрокаТЧСостав.ДатаНачалаПоказаний = НоваяСтрокаТЧ.ДатаНачала;
		НоваяСтрокаТЧСостав.ДатаОкончанияПоказаний = НоваяСтрокаТЧ.ДатаОкончания;
		НоваяСтрокаТЧСостав.Дом = НоваяСтрокаТЧ.Дом;
		НоваяСтрокаТЧСостав.Количество = НоваяСтрокаТЧ.Количество;
		НоваяСтрокаТЧСостав.КонечныеПоказания = СтрокаТЗ.КонечныеПоказания;
		НоваяСтрокаТЧСостав.ЛицевойСчет = НоваяСтрокаТЧ.ЛицевойСчет;
		НоваяСтрокаТЧСостав.НачальныеПоказания = НоваяСтрокаТЧ.НачальноеКоличество;
		НоваяСтрокаТЧСостав.Помещение = НоваяСтрокаТЧ.Помещение;
		НоваяСтрокаТЧСостав.Счетчик = НоваяСтрокаТЧ.Счетчик;
		НоваяСтрокаТЧСостав.Переворот = СтрокаТЗ.Сброс;
		
		Счетчик = Счетчик+1;
		ПредыдущийПериодДействия = СтрокаТЗ.ПериодДействия;
		ПредыдущийКодСчетчика = СтрокаТЗ.КодСчетчика;
	КонецЦикла;
	Если ТранзакцияАктивна Тогда
		Если ДокПоказанияСчетчиков <> Неопределено Тогда
			ДокПоказанияСчетчиков.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
			ДокПоказанияСчетчиков.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	КонецЕсли;

КонецПроцедуры // ЗаписатьПоказания()

&НаСервере
Процедура ЗаписатьПоказанияГПУ(пТЗ,КонстантыОбработки)
	
	пТЗ.Сортировать("ПериодПоказаний Возр");
	ДокПоказанийГПУ = Неопределено;
	
	ТранзакцияАктивна = Ложь;
	ПредыдущийПериодДействия = Дата(1,1,1);
	Счетчик = 0;
	
	ДельтаПериода = 0;
	
	Для Каждого СтрокаТЗ ИЗ пТЗ Цикл
		
		Если ТранзакцияАктивна И (Счетчик = 1000 ИЛИ СтрокаТЗ.ПериодПоказаний <> ПредыдущийПериодДействия) Тогда
			Документы.ркПоказанияГрупповыхСчетчиков.ВыполнитьРаспределениеПоказанийСчетчиков(ДокПоказанийГПУ);
			ДокПоказанийГПУ.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
			ДокПоказанийГПУ.Записать(РежимЗаписиДокумента.Проведение);			
			Счетчик = 0;
			ТранзакцияАктивна = Ложь;
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
		Если НЕ ТранзакцияАктивна Тогда
			
			НачатьТранзакцию();
			ТранзакцияАктивна = Истина;
			ДокПоказанийГПУ = Документы.ркПоказанияГрупповыхСчетчиков.СоздатьДокумент();
			Если СтрокаТЗ.ПериодПоказаний = ПредыдущийПериодДействия Тогда
				ДельтаПериода = ДельтаПериода + 10;
			Иначе
				ДельтаПериода = 0;
			КонецЕсли;
			ДокПоказанийГПУ.Дата = СтрокаТЗ.ПериодПоказаний+ДельтаПериода;
			ДокПоказанийГПУ.Комментарий = "Загрузка данных "+ТекущаяДата();
			ДокПоказанийГПУ.Организация = Организация;
			ДокПоказанийГПУ.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			ДокПоказанийГПУ.ПериодПоказаний = НачалоМесяца(СтрокаТЗ.ПериодПоказаний);
			ДокПоказанийГПУ.ТипОперации = Перечисления.ркТипыОперацийПоказанийСчетчиков.ПоказанияЗаПериод;			
		КонецЕсли;
		
		СтрокаПоказаний = ДокПоказанийГПУ.Состав.Добавить();
		СтрокаПоказаний.Счетчик = СтрокаТЗ.Счетчик;		
		СтрокаПоказаний.ВидПоказаний = СтрокаТЗ.ВидПоказаний;
		СтрокаПоказаний.КонечныеПоказания = СтрокаТЗ.КонечныеПоказания;
		стрНачальныеПоказания = Документы.ркПоказанияГрупповыхСчетчиков.ПолучитьНачальныеПоказанияОДПУ(СтрокаПоказаний.Счетчик,СтрокаПоказаний.ВидПоказаний,СтрокаТЗ.ПериодПоказаний);
		//СтрокаПоказаний.НачальныеПоказания = СтрокаТЗ.НачальныеПоказания;
		СтрокаПоказаний.НачальныеПоказания = стрНачальныеПоказания.НачальныеПоказания;
		СтрокаПоказаний.ПериодДействияНачальныхПоказаний = стрНачальныеПоказания.ПериодДействияНачальныхПоказаний;
		СтрокаПоказаний.Количество = СтрокаТЗ.Количество;
		СтрокаПоказаний.КоэффициентТрансформации = СтрокаТЗ.КоэффициентТрансформации;
		
		ПредыдущийПериодДействия = СтрокаТЗ.ПериодПоказаний;
		Счетчик = Счетчик+1;
	КонецЦикла;

	Если ТранзакцияАктивна Тогда
		Если ДокПоказанийГПУ <> Неопределено Тогда
			Документы.ркПоказанияГрупповыхСчетчиков.ВыполнитьРаспределениеПоказанийСчетчиков(ДокПоказанийГПУ);
			ДокПоказанийГПУ.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
			ДокПоказанийГПУ.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
	
КонецПроцедуры // ЗаписатьПоказанияГПУ()


&НаСервере	
Процедура ВосстановитьНормыИТарифы(пАдрес)
	
	КонстантыОбработки = ПолучитьКонстантыОбработки();
	
	ФайлПриемник = ПолучитьИмяВременногоФайла("dat");
	ДанныеХранилища = ПолучитьИзВременногоХранилища(пАдрес);
	ДанныеХранилища.Записать(ФайлПриемник);
	
	НормыИТарифыТЗ = ЗначениеИзФайла(ФайлПриемник);
	СтатусПроживает = Константы.ркСтатусПроживает.Получить();
	Счетчик = 0;
	ТранзакцияАктивна = Ложь;
	ДокИзм = Неопределено;
	ДокИзмТарифа = Неопределено;
	ДокИзмСв = Неопределено;
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.КоличествоКомнат,
		|	ТЗ.КоличествоЧеловек,
		|	ТЗ.МКД,
		|	ТЗ.МОП,
		|	ВЫРАЗИТЬ(ТЗ.Наименование КАК СТРОКА(150)) КАК Наименование,
		|	ТЗ.Норматив,
		|	ТЗ.Период,
		|	ВЫРАЗИТЬ(ТЗ.СпособРасчета КАК СТРОКА(150)) КАК СпособРасчета,
		|	ТЗ.Тариф,
		|	ВЫРАЗИТЬ(ТЗ.ТипПлиты КАК СТРОКА(150)) КАК ТипПлиты
		|ПОМЕСТИТЬ втТЗ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТЗ.КоличествоКомнат,
		|	втТЗ.КоличествоЧеловек,
		|	втТЗ.МКД,
		|	втТЗ.МОП,
		|	втТЗ.Наименование,
		|	втТЗ.Норматив,
		|	втТЗ.Период,
		|	втТЗ.СпособРасчета,
		|	втТЗ.Тариф,
		|	втТЗ.ТипПлиты
		|ПОМЕСТИТЬ втПять
		|ИЗ
		|	втТЗ КАК втТЗ
		|ГДЕ
		|	втТЗ.КоличествоКомнат = 4
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	5 КАК КоличествоКомнат
		|ПОМЕСТИТЬ втШестьСемьЦифры
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	6
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	7
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втШестьСемьЦифры.КоличествоКомнат,
		|	втПять.КоличествоЧеловек,
		|	втПять.МКД,
		|	втПять.МОП,
		|	втПять.Наименование,
		|	втПять.Норматив,
		|	втПять.Период,
		|	втПять.СпособРасчета,
		|	втПять.Тариф,
		|	втПять.ТипПлиты
		|ПОМЕСТИТЬ втШестьСемь
		|ИЗ
		|	втПять КАК втПять
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втШестьСемьЦифры КАК втШестьСемьЦифры
		|		ПО (ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втШестьСемь.КоличествоКомнат,
		|	втШестьСемь.КоличествоЧеловек,
		|	втШестьСемь.МКД,
		|	втШестьСемь.МОП,
		|	втШестьСемь.Наименование,
		|	втШестьСемь.Норматив,
		|	втШестьСемь.Период,
		|	втШестьСемь.СпособРасчета,
		|	втШестьСемь.Тариф,
		|	втШестьСемь.ТипПлиты
		|ПОМЕСТИТЬ втНедостающиеШестьСемь
		|ИЗ
		|	втШестьСемь КАК втШестьСемь
		|		ЛЕВОЕ СОЕДИНЕНИЕ втТЗ КАК втТЗ
		|		ПО втШестьСемь.КоличествоКомнат = втТЗ.КоличествоКомнат
		|			И втШестьСемь.КоличествоЧеловек = втТЗ.КоличествоЧеловек
		|			И втШестьСемь.МКД = втТЗ.МКД
		|			И втШестьСемь.МОП = втТЗ.МОП
		|			И втШестьСемь.Наименование = втТЗ.Наименование
		|			И втШестьСемь.Период = втТЗ.Период
		|			И втШестьСемь.СпособРасчета = втТЗ.СпособРасчета
		|			И втШестьСемь.ТипПлиты = втТЗ.ТипПлиты
		|ГДЕ
		|	втТЗ.КоличествоКомнат ЕСТЬ NULL 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТЗ.КоличествоКомнат,
		|	втТЗ.КоличествоЧеловек,
		|	втТЗ.МКД,
		|	втТЗ.МОП,
		|	втТЗ.Наименование,
		|	втТЗ.Норматив,
		|	втТЗ.Период,
		|	втТЗ.СпособРасчета,
		|	втТЗ.Тариф,
		|	втТЗ.ТипПлиты
		|ИЗ
		|	втТЗ КАК втТЗ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втНедостающиеШестьСемь.КоличествоКомнат,
		|	втНедостающиеШестьСемь.КоличествоЧеловек,
		|	втНедостающиеШестьСемь.МКД,
		|	втНедостающиеШестьСемь.МОП,
		|	втНедостающиеШестьСемь.Наименование,
		|	втНедостающиеШестьСемь.Норматив,
		|	втНедостающиеШестьСемь.Период,
		|	втНедостающиеШестьСемь.СпособРасчета,
		|	втНедостающиеШестьСемь.Тариф,
		|	втНедостающиеШестьСемь.ТипПлиты
		|ИЗ
		|	втНедостающиеШестьСемь КАК втНедостающиеШестьСемь";
		
	Запрос.УстановитьПараметр("ТЗ",НормыИТарифыТЗ);
	РезультатЗапроса = Запрос.Выполнить();
	
	НормыИТарифыИзмененная = РезультатЗапроса.Выгрузить();
	
	
	Для Каждого стрНормыИТарифыТЗ Из НормыИТарифыИзмененная Цикл
		
		//Период
		//Наименование
		//Норматив
		//Тариф
		//
		//
		
		Если Счетчик = 0 И НЕ ТранзакцияАктивна Тогда
			НачатьТранзакцию();
			ТранзакцияАктивна = Истина;
			ДокИзм = Документы.ркИзменениеНорм.СоздатьДокумент();
			ДокИзм.Дата = ДатаОткрытия;
			ДокИзм.Комментарий = "Загрузка данных "+ТекущаяДата();
			ДокИзм.Организация = Организация;
			ДокИзм.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			
			ДокИзмТарифа = Документы.ркИзменениеТарифов.СоздатьДокумент();
			ДокИзмТарифа.Дата = ДатаОткрытия;
			ДокИзмТарифа.Комментарий = "Загрузка данных "+ТекущаяДата();
			ДокИзмТарифа.Организация = Организация;
			ДокИзмТарифа.Ответственный = ПараметрыСеанса.ТекущийПользователь;

			ДокИзмСв = Документы.ркИзменениеЗначенийСвойствОбъектов.СоздатьДокумент();
			ДокИзмСв.Дата = ДатаОткрытия;
			ДокИзмСв.Комментарий = "Загрузка данных "+ТекущаяДата();
			ДокИзмСв.Организация = Организация;
			ДокИзмСв.Ответственный = ПараметрыСеанса.ТекущийПользователь;

			
			
		КонецЕсли;
		Счетчик = Счетчик + 1;
		
		//Сгенерировать наименование
		
		//текНаименованиеГруппы = стрНормыИТарифыТЗ.Наименование +  " "
		//						+стрНормыИТарифыТЗ.КоличествоКомнат+" ком., "
		//						+?(стрНормыИТарифыТЗ.ТипПлиты = NULL,"",стрНормыИТарифыТЗ.ТипПлиты+ " пл., ")
		//						+стрНормыИТарифыТЗ.МКД+" МКД, "
		//						+стрНормыИТарифыТЗ.МОП +" МОП";
		тСтрНаименование = СокрЛП(стрНормыИТарифыТЗ.Наименование);
		тСтрСпособРасчета = СокрЛП(стрНормыИТарифыТЗ.СпособРасчета);
		тСтрТипПлиты = СокрЛП(стрНормыИТарифыТЗ.ТипПлиты);
		текНаименованиеГруппы = ?(ЗначениеЗаполнено(тСтрНаименование),тСтрНаименование,"Безымянный");								
		текНаименование = ?(ЗначениеЗаполнено(тСтрНаименование),тСтрНаименование,"Безымянный") +  " "+стрНормыИТарифыТЗ.КоличествоКомнат+" ком., "+стрНормыИТарифыТЗ.КоличествоЧеловек+" чел., "+?(тСтрТипПлиты = NULL,"",тСтрТипПлиты+ " пл., ")+стрНормыИТарифыТЗ.МКД+" МКД";
		
		//создать группу норм
		
		текГруппаВидаНормы = Справочники.ркВидыНорм.НайтиПоНаименованию(текНаименованиеГруппы,Истина);
		текВидТарифа = Справочники.ркВидыТарифов.НайтиПоНаименованию(текНаименованиеГруппы,Истина);
		Если текГруппаВидаНормы.Пустая() Тогда
			НоваяГруппаВидаНормы = Справочники.ркВидыНорм.СоздатьГруппу();
			НоваяГруппаВидаНормы.Наименование = текНаименованиеГруппы;
			
			//1)
			НоваяСтрокаТЧ = НоваяГруппаВидаНормы.СоставСвойствПоискаВидаНормы.Добавить();
			НоваяСтрокаТЧ.СвойствоВидаНормыОт = КонстантыОбработки.КоличествоКомнатНормы;
			НоваяСтрокаТЧ.СвойствоВидаНормыПо = КонстантыОбработки.КоличествоКомнатНормы;
			НоваяСтрокаТЧ.СвойствоЛицевогоСчетаДома = КонстантыОбработки.КоличествоКомнатНормы;
			НоваяСтрокаТЧ.ТипОбъектаПоискаВидаНормы = Перечисления.ркТипыОбъектовПоискаВидовНорм.СправочникЛицевыхСчетов;
			//2)
			НоваяСтрокаТЧ = НоваяГруппаВидаНормы.СоставСвойствПоискаВидаНормы.Добавить();
			НоваяСтрокаТЧ.СвойствоВидаНормыОт = КонстантыОбработки.ТипПлитыНормы;
			НоваяСтрокаТЧ.СвойствоВидаНормыПо = КонстантыОбработки.ТипПлитыНормы;
			НоваяСтрокаТЧ.СвойствоЛицевогоСчетаДома = КонстантыОбработки.ТипПлитыНормы;
			НоваяСтрокаТЧ.ТипОбъектаПоискаВидаНормы = Перечисления.ркТипыОбъектовПоискаВидовНорм.СправочникЛицевыхСчетов;
			//3)
			НоваяСтрокаТЧ = НоваяГруппаВидаНормы.СоставСвойствПоискаВидаНормы.Добавить();
			НоваяСтрокаТЧ.СвойствоВидаНормыОт = КонстантыОбработки.МКДНормы;
			НоваяСтрокаТЧ.СвойствоВидаНормыПо = КонстантыОбработки.МКДНормы;
			НоваяСтрокаТЧ.СвойствоЛицевогоСчетаДома = КонстантыОбработки.МКДНормы;
			НоваяСтрокаТЧ.ТипОбъектаПоискаВидаНормы = Перечисления.ркТипыОбъектовПоискаВидовНорм.СправочникДомов;

			Если НЕ ЗначениеЗаполнено(НоваяГруппаВидаНормы.Код) Тогда
				НоваяГруппаВидаНормы.УстановитьНовыйКод();
			КонецЕсли;
			НоваяГруппаВидаНормы.ОбменДанными.Загрузка = Истина;
			НоваяГруппаВидаНормы.Записать();
			текГруппаВидаНормы = НоваяГруппаВидаНормы.Ссылка;
			
			
			Если текВидТарифа.Пустая() Тогда
				НовыйВидТарифа = Справочники.ркВидыТарифов.СоздатьЭлемент();
				НовыйВидТарифа.ВидРасчета = КонстантыОбработки.ВидРасчетаЭлектроэнергия;
				НовыйВидТарифа.Наименование = текНаименованиеГруппы;
				НовыйВидТарифа.ЕдиницыУчета = КонстантыОбработки.Квтч;
				НовыйВидТарифа.ВидНормы = текГруппаВидаНормы;
				СтрокаТЧ = НовыйВидТарифа.СоставДоступныхЕдиницРасчета.Добавить();
				Если тСтрСпособРасчета = "По количеству человек" Тогда
					СтрокаТЧ.ЕдиницаРасчета = КонстантыОбработки.ЕдиницаКоличествоПроживающих;
				ИначеЕсли тСтрСпособРасчета = "По приборам учета" Тогда
					СтрокаТЧ.ЕдиницаРасчета = КонстантыОбработки.ЕдиницаСчетчик;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(НовыйВидТарифа.Код) Тогда
					НовыйВидТарифа.УстановитьНовыйКод();
				КонецЕсли;

				НовыйВидТарифа.ОбменДанными.Загрузка = Истина;
				НовыйВидТарифа.Записать();			
				
				текВидТарифа = НовыйВидТарифа.Ссылка;
			КонецЕсли;
						
		КонецЕсли;
		
		
		СтруктураПоиска = Новый Структура("ВидТарифа,НачалоДействия", текВидТарифа,стрНормыИТарифыТЗ.Период);
		НайденныеСтроки = ДокИзмТарифа.Состав.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтрокаДокТарифа = ДокИзмТарифа.Состав.Добавить();
			СтрокаДокТарифа.ВидТарифа = текВидТарифа;
			СтрокаДокТарифа.НачалоДействия = стрНормыИТарифыТЗ.Период;
		Иначе
			СтрокаДокТарифа = НайденныеСтроки[0];
		КонецЕсли;
		СтрокаДокТарифа.ПериодДействияТарифа = Перечисления.ркПериодыДействияТарифа.Месяц;
		СтрокаДокТарифа.ТипТарифа  = Справочники.ркТипыТарифов.Основной;
		СтрокаДокТарифа.Цена = ?(стрНормыИТарифыТЗ.Тариф = NULL,0,стрНормыИТарифыТЗ.Тариф);
		
		текВидНормы = Справочники.ркВидыНорм.НайтиПоНаименованию(текНаименование,Истина);
		Если текВидНормы.Пустая() Тогда
			НовыйВидНормы = Справочники.ркВидыНорм.СоздатьЭлемент();
			НовыйВидНормы.Родитель = текГруппаВидаНормы;
			НовыйВидНормы.ЕдиницаИзмеренияИсходныхДанных = КонстантыОбработки.Человек;
			НовыйВидНормы.ЕдиницаИзмерения = КонстантыОбработки.Квтч;
			НовыйВидНормы.Наименование = текНаименование;
			НовыйВидНормы.НазначениеКоличестваОбъектовРасчета = стрНормыИТарифыТЗ.КоличествоЧеловек;
			СтрокаТЧ = НовыйВидНормы.НазначениеСоставСтатусовОбъектовРасчета.Добавить();
			СтрокаТЧ.СтатусОбъектовРасчета = СтатусПроживает;

			Если НЕ ЗначениеЗаполнено(НовыйВидНормы.Код) Тогда
				НовыйВидНормы.УстановитьНовыйКод();
			КонецЕсли;
			НовыйВидНормы.ОбменДанными.Загрузка = Истина;
			НовыйВидНормы.Записать();
			текВидНормы = НовыйВидНормы.Ссылка;
		КонецЕсли;
		
		//стрДокИзмСв = ДокИзмСв.Состав.Добавить();
		//стрДокИзмСв.НачалоДействия = ДобавитьМесяц(НачалоГода(ДатаОткрытия),-24);
		//стрДокИзмСв.Объект = текВидНормы;
		//стрДокИзмСв.Свойство = НайтиСвойствоЛС("КоличествоПрописанных");;
		//стрДокИзмСв.Значение = стрНормыИТарифыТЗ.КоличествоЧеловек;
		
		СтруктураПоиска = Новый Структура("НачалоДействия,Объект,Свойство", ДобавитьМесяц(НачалоГода(ДатаОткрытия),-24),текВидНормы,КонстантыОбработки.КоличествоКомнатНормы);
		НайденныеСтроки = ДокИзмСв.Состав.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() = 0 Тогда
			стрДокИзмСв = ДокИзмСв.Состав.Добавить();
			стрДокИзмСв.НачалоДействия = ДобавитьМесяц(НачалоГода(ДатаОткрытия),-24);
			стрДокИзмСв.Объект = текВидНормы;
			стрДокИзмСв.Свойство = КонстантыОбработки.КоличествоКомнатНормы;
		Иначе
			стрДокИзмСв = НайденныеСтроки[0];
		КонецЕсли;
		стрДокИзмСв.Значение = стрНормыИТарифыТЗ.КоличествоКомнат;
		
		СтруктураПоиска = Новый Структура("НачалоДействия,Объект,Свойство", ДобавитьМесяц(НачалоГода(ДатаОткрытия),-24),текВидНормы,КонстантыОбработки.ТипПлитыНормы);
		НайденныеСтроки = ДокИзмСв.Состав.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() = 0 Тогда
			стрДокИзмСв = ДокИзмСв.Состав.Добавить();
			стрДокИзмСв.НачалоДействия = ДобавитьМесяц(НачалоГода(ДатаОткрытия),-24);
			стрДокИзмСв.Объект = текВидНормы;
			стрДокИзмСв.Свойство = КонстантыОбработки.ТипПлитыНормы;
		Иначе
			стрДокИзмСв = НайденныеСтроки[0];
		КонецЕсли;
		стрДокИзмСв.Значение = ПолучитьЗначениеСвойства(стрДокИзмСв.Свойство,тСтрТипПлиты);		

		СтруктураПоиска = Новый Структура("НачалоДействия,Объект,Свойство", ДобавитьМесяц(НачалоГода(ДатаОткрытия),-24),текВидНормы,КонстантыОбработки.МКДНормы);
		НайденныеСтроки = ДокИзмСв.Состав.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() = 0 Тогда
			стрДокИзмСв = ДокИзмСв.Состав.Добавить();
			стрДокИзмСв.НачалоДействия = ДобавитьМесяц(НачалоГода(ДатаОткрытия),-24);
			стрДокИзмСв.Объект = текВидНормы;
			стрДокИзмСв.Свойство = КонстантыОбработки.МКДНормы;
		Иначе
			стрДокИзмСв = НайденныеСтроки[0];
		КонецЕсли;
		стрДокИзмСв.Значение = ПолучитьЗначениеСвойства(стрДокИзмСв.Свойство,стрНормыИТарифыТЗ.МКД);		

		//СтруктураПоиска = Новый Структура("НачалоДействия,Объект,Свойство", ДобавитьМесяц(НачалоГода(ДатаОткрытия),-24),текВидНормы,КонстантыОбработки.МОПНормы);
		//НайденныеСтроки = ДокИзмСв.Состав.НайтиСтроки(СтруктураПоиска);
		//Если НайденныеСтроки.Количество() = 0 Тогда
		//	стрДокИзмСв = ДокИзмСв.Состав.Добавить();
		//	стрДокИзмСв.НачалоДействия = ДобавитьМесяц(НачалоГода(ДатаОткрытия),-24);
		//	стрДокИзмСв.Объект = текВидНормы;
		//	стрДокИзмСв.Свойство = КонстантыОбработки.МОПНормы;
		//Иначе
		//	стрДокИзмСв = НайденныеСтроки[0];
		//КонецЕсли;
		//стрДокИзмСв.Значение = ПолучитьЗначениеСвойства(стрДокИзмСв.Свойство,стрНормыИТарифыТЗ.МОП);		

		
		СтруктураПоиска = Новый Структура("НачалоДействия,ВидНормы,ТипНормы", стрНормыИТарифыТЗ.Период,текВидНормы,Справочники.ркТипыНорм.Общий);
		НайденныеСтроки = ДокИзм.Состав.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтрокаДок = ДокИзм.Состав.Добавить();
			СтрокаДок.НачалоДействия = стрНормыИТарифыТЗ.Период;
			СтрокаДок.ВидНормы = текВидНормы;
			СтрокаДок.ТипНормы = Справочники.ркТипыНорм.Общий;
		Иначе
			СтрокаДок = НайденныеСтроки[0];
		КонецЕсли;
		СтрокаДок.ЗначениеНормы = стрНормыИТарифыТЗ.Норматив;		
		
		Если Счетчик >= 5000 И ТранзакцияАктивна Тогда 
			Если ДокИзм.Состав.Количество() > 0 Тогда
				ДокИзм.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
				ДокИзм.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			Если ДокИзмТарифа.Состав.Количество() > 0 Тогда
				ДокИзмТарифа.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
				ДокИзмТарифа.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			Если ДокИзмСв.Состав.Количество() > 0 Тогда
				ДокИзмСв.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
				ДокИзмСв.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;

			ЗафиксироватьТранзакцию();
			Счетчик = 0;
			ТранзакцияАктивна = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТранзакцияАктивна Тогда
		
		Если ДокИзм <> Неопределено и ДокИзм.Состав.Количество()>0 Тогда
			ДокИзм.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
			ДокИзм.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		Если ДокИзмТарифа <> Неопределено и ДокИзмТарифа.Состав.Количество()>0 Тогда
			ДокИзмТарифа.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
			ДокИзмТарифа.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		Если ДокИзмСв <> Неопределено и ДокИзмСв.Состав.Количество()>0 Тогда
			ДокИзмСв.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
			ДокИзмСв.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;

		ЗафиксироватьТранзакцию();
		
	КонецЕсли;

	//спр ркВидыНорм
	//РС ркНормы
	//док ркИзменениеНорм
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайлОбмена(Команда)
	
	СписокФайлов = НайтиФайлы(КаталогДанных,"Выгр*.dat");
	Для Каждого тФайл Из СписокФайлов Цикл
		Сообщить("Начало чтения из файла: "+тФайл.ПолноеИмя+" "+ТекущаяДатаСеансаНаСервере());		
		ФайлИсточник = тФайл.ПолноеИмя;
		Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ФайлИсточник));	
		ВосстановитьЗначения(Адрес);	
		Сообщить("Окончение чтения из файла: "+тФайл.ПолноеИмя+" "+ТекущаяДатаСеансаНаСервере());		
	КонецЦикла;
	Сообщить("Загружены основные данные");

КонецПроцедуры



&НаКлиенте
Процедура ЗагрузитьНормыИТарифы(Команда)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр = "(*.dat)|*.dat"; 
	
	Если Не ДиалогВыбораФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	Файл = Новый Файл(ДиалогВыбораФайла.ПолноеИмяФайла);
	ФайлИсточник = Файл.ПолноеИмя;
	Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ФайлИсточник));
	
	ВосстановитьНормыИТарифы(Адрес);	
	
	ЗаменитьГруппуВидовНормНаСервере();
	Сообщить("Загружены нормы и тарифы: " +ТекущаяДатаСеансаНаСервере());
КонецПроцедуры

&НаСервере
Процедура ЗаменитьГруппуВидовНормНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ркВидыТарифов.Ссылка,
		|	ркВидыТарифов.Наименование
		|ИЗ
		|	Справочник.ркВидыТарифов КАК ркВидыТарифов
		|ГДЕ
		|	НЕ ркВидыТарифов.Наименование ПОДОБНО ""%норматив%""";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Лев(ВыборкаДетальныеЗаписи.Наименование,СтрДлина("Электроотопление")) = "Электроотопление" Тогда
			тИмяГруппыНормы = "Электроотопление норматив";
		Иначе
			тИмяГруппыНормы = СтрЗаменить(ВыборкаДетальныеЗаписи.Наименование,"день","");
			тИмяГруппыНормы = СтрЗаменить(тИмяГруппыНормы,"ночь","");
			тИмяГруппыНОрмы = СтрЗаменить(тИмяГруппыНормы,"прибор учета","норматив");
			тИмяГруппыНОрмы = СтрЗаменить(тИмяГруппыНормы,"()","");
			Пока Найти(тИмяГруппыНОрмы,"  ")>0 Цикл
				тИмяГруппыНОрмы = стрЗаменить(тИмяГруппыНОрмы,"  "," ");
			КонецЦикла;		
			тИмяГруппыНормы = СокрЛП(тИмяГруппыНОрмы);
		КонецЕсли;
		Если тИмяГруппыНормы = "Электроплиты норматив" Тогда
			тИмяГруппыНормы = "Электроплиты норматив город";
		КонецЕсли;
		
		Запрос2 = Новый Запрос;
		Запрос2.Текст = 
		"ВЫБРАТЬ
		|	ркВидыНорм.Ссылка
		|ИЗ
		|	Справочник.ркВидыНорм КАК ркВидыНорм
		|ГДЕ
		|	ркВидыНорм.ЭтоГруппа
		|	И ркВидыНорм.Наименование = &Наименование";
		
		Запрос2.УстановитьПараметр("Наименование",тИмяГруппыНормы);
		РезультатЗапроса2 = Запрос2.Выполнить();
		ВыборкаДетальныеЗаписи2 = РезультатЗапроса2.Выбрать();
		
		Если ВыборкаДетальныеЗаписи2.Следующий() Тогда
			тОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			тОбъект.ВидНормы = ВыборкаДетальныеЗаписи2.Ссылка;
			тОбъект.Записать();
		КонецЕсли;		
		
	КонецЦикла;
	

КонецПроцедуры // ЗаменитьГруппуВидовНормНаСервере()


&НаСервереБезКонтекста
Функция ТекущаяДатаСеансаНаСервере()
	Возврат ТекущаяДатаСеанса();
КонецФункции

&НаКлиенте
Процедура ПрочитатьСвойства(Команда)
	Сообщить("Начало чтения из файла: " +ТекущаяДатаСеансаНаСервере());
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр = "(*.dat)|*.dat"; 
	
	Если Не ДиалогВыбораФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	Файл = Новый Файл(ДиалогВыбораФайла.ПолноеИмяФайла);
	ФайлИсточник = Файл.ПолноеИмя;
	Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ФайлИсточник));
	
	//ПрочитатьСвойстваНаСервере(ДиалогВыбораФайла.ПолноеИмяФайла);
	ПрочитатьСвойстваНаСервере(Адрес);
	
	Сообщить("Окончение чтения из файла: " +ТекущаяДатаСеансаНаСервере());

КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьОбъектыРасчета(Команда)
	ЗаполнитьОбъектыРасчетаНаСервере();
	Сообщить("Заполнены объекты расчета");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбъектыРасчетаНаСервере()
	
	КонстантыОбработки = ПолучитьКонстантыОбработки();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ркЗначенияПериодическихСвойствОбъектов.Объект КАК Объект,
		|	ркЗначенияПериодическихСвойствОбъектов.Значение,
		|	ркЗначенияПериодическихСвойствОбъектов.Период КАК Период,
		|	ВЫРАЗИТЬ(ркЗначенияПериодическихСвойствОбъектов.Объект КАК Справочник.ркЛицевыеСчета).Наименование КАК Наименование
		|ИЗ
		|	РегистрСведений.ркЗначенияПериодическихСвойствОбъектов КАК ркЗначенияПериодическихСвойствОбъектов
		|ГДЕ
		|	ркЗначенияПериодическихСвойствОбъектов.Свойство = &Свойство
		|	И ркЗначенияПериодическихСвойствОбъектов.Объект ССЫЛКА Справочник.ркЛицевыеСчета
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период
		|ИТОГИ ПО
		|	Объект";
	
	Запрос.УстановитьПараметр("Свойство", КонстантыОбработки.КоличествоЧеловекНормы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбъект = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СтатусПроживает = Константы.ркСтатусПроживает.Получить();
	
	ТранзакцияАктивна = Ложь;
	Счетчик = 0;
	Пока ВыборкаОбъект.Следующий() Цикл
		// Вставить обработку выборки ВыборкаОбъект
		
		Если НЕ ТранзакцияАктивна И Счетчик = 0 Тогда
			НачатьТранзакцию();
			ТранзакцияАктивна = Истина;
		КонецЕсли;
		ВыборкаДетальныеЗаписи = ВыборкаОбъект.Выбрать();
		
		текКоличество = 0;
		СписокПроживающих = Новый СписокЗначений;
		//используем пометку
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ДокИзм = Документы.ркИзменениеСтатусовОбъектовРасчета.СоздатьДокумент();			
			ДокИзм.Дата = ВыборкаДетальныеЗаписи.Период;
			ДокИзм.Организация = Организация;
			ДокИзм.Комментарий = "Перенос данных "+ТекущаяДата();
			
			Разность = ВыборкаДетальныеЗаписи.Значение - текКоличество;
			Если Разность > 0 Тогда
				Для Р = 0 По Разность-1 Цикл
					//добавить
					//если есть в списке без пометки - восстанавливаем
					ФЛ = Неопределено;
					
					Для Каждого Элемент Из СписокПроживающих Цикл
						
						Если НЕ Элемент.Пометка Тогда
							
							ФЛ = Элемент.Значение;
							Элемент.Пометка = Истина;
							Прервать;
							
						КонецЕсли;
						Если ФЛ <> Неопределено Тогда
							Прервать;
						КонецЕсли;
						
					КонецЦикла;
					
					Если ФЛ = Неопределено Тогда
						НовоеФЛ = Справочники.ФизическиеЛица.СоздатьЭлемент();
						НовоеФЛ.УстановитьНовыйКод();
						НовоеФЛ.Наименование = ВыборкаДетальныеЗаписи.Наименование+" "+НовоеФЛ.Код;
						НовоеФЛ.ОбменДанными.Загрузка = Истина;
						НовоеФЛ.Записать();
						ФЛ = НовоеФЛ.Ссылка;
						СписокПроживающих.Добавить(ФЛ,,Истина);
					КонецЕсли;
					//если в списке нет - созаем физлицо, добавляем в список с пометкой
					//Документы.ркИзменениеСтатусовОбъектовРасчета
					
					стрДокИзм = ДокИзм.Состав.Добавить();
					стрДокИзм.НачалоДействия = ВыборкаДетальныеЗаписи.Период;
					стрДокИзм.ЛицевойСчет = ВыборкаДетальныеЗаписи.Объект;
					стрДокИзм.ОбъектРасчета = ФЛ;
					стрДокИзм.СтатусОбъектаРасчета = СтатусПроживает;
					стрДокИзм.Включен = Истина;
					
				КонецЦикла;
			Иначе
				Для Р = 0 По -Разность-1 Цикл
					//удалить
					//снимаем пометку в списке
					ФЛ = Неопределено;
					Для Каждого Элемент Из СписокПроживающих Цикл
						Если Элемент.Пометка Тогда
							ФЛ = Элемент.Значение;
							Элемент.Пометка = Ложь;
							Прервать;
						КонецЕсли;
						Если ФЛ <> Неопределено Тогда
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					стрДокИзм = ДокИзм.Состав.Добавить();
					стрДокИзм.НачалоДействия = ВыборкаДетальныеЗаписи.Период;
					стрДокИзм.ЛицевойСчет = ВыборкаДетальныеЗаписи.Объект;
					стрДокИзм.ОбъектРасчета = ФЛ;
					стрДокИзм.СтатусОбъектаРасчета = СтатусПроживает;
					стрДокИзм.Включен = Ложь;
					
					//Документы.ркИзменениеСтатусовОбъектовРасчета
				КонецЦикла;				
			КонецЕсли;
			текКоличество = ВыборкаДетальныеЗаписи.Значение;
			ДокИзм.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
			ДокИзм.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЦикла;
		Счетчик = Счетчик + 1;
		Если ТранзакцияАктивна И Счетчик >= 1000 Тогда
			ТранзакцияАктивна = Ложь;
			Счетчик = 0;
			ЗафиксироватьТранзакцию();
		КонецЕсли;
	КонецЦикла;
	Если ТранзакцияАктивна Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНежилые(Команда)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр = "(*.dat)|*.dat"; 
	
	Если Не ДиалогВыбораФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	Файл = Новый Файл(ДиалогВыбораФайла.ПолноеИмяФайла);
	ФайлИсточник = Файл.ПолноеИмя;
	Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ФайлИсточник));
	
	ВосстановитьНежилые(Адрес);
	
	Сообщить("Загружены нежилые помещения: " +ТекущаяДатаСеансаНаСервере());

КонецПроцедуры

&НаСервере	
Процедура ВосстановитьНежилые(пАдрес)
	
	КонстантыОбработки = ПолучитьКонстантыОбработки();
	
	ФайлПриемник = ПолучитьИмяВременногоФайла("dat");
	ДанныеХранилища = ПолучитьИзВременногоХранилища(пАдрес);
	ДанныеХранилища.Записать(ФайлПриемник);
	
	НежилыеТЗ = ЗначениеИзФайла(ФайлПриемник);

	Счетчик = 0;
	ТранзакцияАктивна = Ложь;
	
	//
	
	// Абонент-нежилое помещение
	
	//ДатаДобавления	
	//ДатаРасторженияДоговора	
	//Наименование
	//НомерДоговора	
	//ОтдельныйВвод	
	//Площадь	
	//УчаствуетВМОП
	
	// // Дом // //
	//Код
	//Корпус
	//Дом
	//ДомНаименование
	//Улица
	
	// // Тариф // //
	//ТарифКод
	//ТарифНаименование
	
	// // Прибор учета // //
	//ПУКод
	//ПУНаименование
	//ЗаводскойНомер
	//ДатаВыпуска
	//ТипПрибораУчетаНаименование
	//НомерПломбы
	//ДатаПоверкиСчетчика
	//ДатаУстановкиСчетчика
	//ЕИРЦномерПУ
	//Отключен
	//Коэффициент

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.ДатаДобавления,
		|	ТЗ.ДатаРасторженияДоговора,
		|	ТЗ.Наименование,
		|	ТЗ.НомерДоговора,
		|	ТЗ.ОтдельныйВвод,
		|	ТЗ.Площадь,
		|	ТЗ.УчаствуетВМОП,
		|	ТЗ.Код КАК КодДома,
		|	ТЗ.Корпус,
		|	ТЗ.Дом КАК ДомНомер,
		|	ТЗ.ДомНаименование,
		|	ТЗ.Улица,
		|	ТЗ.ТарифКод,
		|	ТЗ.ТарифНаименование,
		|	ТЗ.ПУКод,
		|	ТЗ.ПУНаименование,
		|	ТЗ.ЗаводскойНомер,
		|	ТЗ.ДатаВыпуска,
		|	ТЗ.ТипПрибораУчетаНаименование,
		|	ТЗ.НомерПломбы,
		|	ТЗ.ДатаПоверкиСчетчика,
		|	ТЗ.ДатаУстановкиСчетчика,
		|	ТЗ.ЕИРЦНомерПУ,
		|	ТЗ.Отключен,
		|	ТЗ.Коэффициент,
		|	ТЗ.КодНП
		|ПОМЕСТИТЬ втТЗ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТЗ.ДатаДобавления,
		|	втТЗ.ДатаРасторженияДоговора,
		|	втТЗ.Наименование,
		|	втТЗ.НомерДоговора,
		|	втТЗ.ОтдельныйВвод,
		|	втТЗ.Площадь,
		|	втТЗ.УчаствуетВМОП,
		|	втТЗ.КодДома,
		|	втТЗ.Корпус,
		|	втТЗ.ДомНомер,
		|	втТЗ.ДомНаименование,
		|	втТЗ.Улица,
		|	втТЗ.ТарифКод,
		|	втТЗ.ТарифНаименование,
		|	втТЗ.ПУКод,
		|	втТЗ.ПУНаименование,
		|	втТЗ.ЗаводскойНомер,
		|	втТЗ.ДатаВыпуска,
		|	втТЗ.ТипПрибораУчетаНаименование,
		|	втТЗ.НомерПломбы,
		|	втТЗ.ДатаПоверкиСчетчика,
		|	втТЗ.ДатаУстановкиСчетчика,
		|	втТЗ.ЕИРЦНомерПУ,
		|	втТЗ.Отключен,
		|	втТЗ.Коэффициент,
		|	ркУлицы.Ссылка КАК НайденнаяУлица,
		|	втТЗ.КодНП
		|ПОМЕСТИТЬ втУлицы
		|ИЗ
		|	втТЗ КАК втТЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ркУлицы КАК ркУлицы
		|		ПО втТЗ.Улица = ркУлицы.Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втУлицы.ДатаДобавления,
		|	втУлицы.ДатаРасторженияДоговора,
		|	втУлицы.Наименование,
		|	втУлицы.НомерДоговора,
		|	втУлицы.ОтдельныйВвод,
		|	втУлицы.Площадь,
		|	втУлицы.УчаствуетВМОП,
		|	втУлицы.КодДома,
		|	втУлицы.Корпус,
		|	втУлицы.ДомНомер,
		|	втУлицы.ДомНаименование,
		|	втУлицы.Улица,
		|	втУлицы.ТарифКод,
		|	втУлицы.ТарифНаименование,
		|	втУлицы.ПУКод,
		|	втУлицы.ПУНаименование,
		|	втУлицы.ЗаводскойНомер,
		|	втУлицы.ДатаВыпуска,
		|	втУлицы.ТипПрибораУчетаНаименование,
		|	втУлицы.НомерПломбы,
		|	втУлицы.ДатаПоверкиСчетчика,
		|	втУлицы.ДатаУстановкиСчетчика,
		|	втУлицы.ЕИРЦНомерПУ,
		|	втУлицы.Отключен,
		|	втУлицы.Коэффициент,
		|	втУлицы.НайденнаяУлица,
		|	ркДома.Ссылка КАК НайденныйДом,
		|	втУлицы.КодНП
		|ПОМЕСТИТЬ втДома
		|ИЗ
		|	втУлицы КАК втУлицы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ркДома КАК ркДома
		|		ПО втУлицы.НайденнаяУлица = ркДома.Владелец
		|			И втУлицы.ДомНомер = ркДома.Номер
		|			И втУлицы.Корпус = ркДома.Корпус
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДома.ДатаДобавления КАК ДатаДобавления,
		|	втДома.ДатаРасторженияДоговора КАК ДатаРасторженияДоговора,
		|	втДома.Наименование КАК Наименование,
		|	втДома.НомерДоговора КАК НомерДоговора,
		|	втДома.ОтдельныйВвод КАК ОтдельныйВвод,
		|	втДома.Площадь КАК Площадь,
		|	втДома.УчаствуетВМОП КАК УчаствуетВМОП,
		|	втДома.КодДома КАК КодДома,
		|	втДома.Корпус КАК Корпус,
		|	втДома.ДомНомер КАК ДомНомер,
		|	втДома.ДомНаименование КАК ДомНаименование,
		|	втДома.Улица КАК Улица,
		|	втДома.ТарифКод КАК ТарифКод,
		|	втДома.ТарифНаименование КАК ТарифНаименование,
		|	втДома.ПУКод,
		|	втДома.ПУНаименование,
		|	втДома.ЗаводскойНомер,
		|	втДома.ДатаВыпуска,
		|	втДома.ТипПрибораУчетаНаименование,
		|	втДома.НомерПломбы,
		|	втДома.ДатаПоверкиСчетчика,
		|	втДома.ДатаУстановкиСчетчика,
		|	втДома.ЕИРЦНомерПУ,
		|	втДома.Отключен,
		|	втДома.Коэффициент,
		|	втДома.НайденнаяУлица КАК НайденнаяУлица,
		|	втДома.НайденныйДом КАК НайденныйДом,
		|	ркЛицевыеСчетаДополнительныеРеквизиты.Ссылка КАК НайденныйЛС,
		|	втДома.КодНП
		|ПОМЕСТИТЬ втАбоненты
		|ИЗ
		|	втДома КАК втДома
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ркЛицевыеСчета.ДополнительныеРеквизиты КАК ркЛицевыеСчетаДополнительныеРеквизиты
		|		ПО втДома.ПУКод = ркЛицевыеСчетаДополнительныеРеквизиты.Значение
		|			И (ркЛицевыеСчетаДополнительныеРеквизиты.Свойство = &СвойствоИсходныйКод)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втАбоненты.ДатаДобавления КАК ДатаДобавления,
		|	втАбоненты.ДатаРасторженияДоговора КАК ДатаРасторженияДоговора,
		|	втАбоненты.Наименование КАК Наименование,
		|	втАбоненты.НомерДоговора КАК НомерДоговора,
		|	втАбоненты.ОтдельныйВвод КАК ОтдельныйВвод,
		|	втАбоненты.Площадь КАК Площадь,
		|	втАбоненты.УчаствуетВМОП КАК УчаствуетВМОП,
		|	втАбоненты.КодДома КАК КодДома,
		|	втАбоненты.Корпус КАК Корпус,
		|	втАбоненты.ДомНомер КАК ДомНомер,
		|	втАбоненты.ДомНаименование КАК ДомНаименование,
		|	втАбоненты.Улица КАК Улица,
		|	втАбоненты.ТарифКод КАК ТарифКод,
		|	втАбоненты.ТарифНаименование КАК ТарифНаименование,
		|	втАбоненты.ПУКод,
		|	втАбоненты.ПУНаименование,
		|	втАбоненты.ЗаводскойНомер,
		|	втАбоненты.ДатаВыпуска,
		|	втАбоненты.ТипПрибораУчетаНаименование,
		|	втАбоненты.НомерПломбы,
		|	втАбоненты.ДатаПоверкиСчетчика,
		|	втАбоненты.ДатаУстановкиСчетчика,
		|	втАбоненты.ЕИРЦНомерПУ,
		|	втАбоненты.Отключен,
		|	втАбоненты.Коэффициент,
		|	втАбоненты.НайденнаяУлица КАК НайденнаяУлица,
		|	втАбоненты.НайденныйДом КАК НайденныйДом,
		|	втАбоненты.НайденныйЛС КАК НайденныйЛС,
		|	ркСчетчикиДополнительныеРеквизиты.Ссылка КАК НайденныйСчетчик,
		|	втАбоненты.КодНП КАК КодНП,
		|	ркВидыТарифов.Ссылка КАК НайденныйТариф
		|ИЗ
		|	втАбоненты КАК втАбоненты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ркСчетчики.ДополнительныеРеквизиты КАК ркСчетчикиДополнительныеРеквизиты
		|		ПО втАбоненты.ПУКод = ркСчетчикиДополнительныеРеквизиты.Значение
		|			И (ркСчетчикиДополнительныеРеквизиты.Свойство = &СвойствоИсходныйКод)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ркВидыТарифов КАК ркВидыТарифов
		|		ПО втАбоненты.ТарифНаименование = ркВидыТарифов.Наименование
		|ИТОГИ
		|	МАКСИМУМ(ДатаДобавления),
		|	МАКСИМУМ(ДатаРасторженияДоговора),
		|	МАКСИМУМ(Наименование),
		|	МАКСИМУМ(НомерДоговора),
		|	МАКСИМУМ(ОтдельныйВвод),
		|	МАКСИМУМ(Площадь),
		|	МАКСИМУМ(УчаствуетВМОП),
		|	МАКСИМУМ(КодДома),
		|	МАКСИМУМ(Корпус),
		|	МАКСИМУМ(ДомНомер),
		|	МАКСИМУМ(ДомНаименование),
		|	МАКСИМУМ(Улица),
		|	МАКСИМУМ(ТарифКод),
		|	МАКСИМУМ(ТарифНаименование),
		|	МАКСИМУМ(НайденнаяУлица),
		|	МАКСИМУМ(НайденныйДом),
		|	МАКСИМУМ(НайденныйЛС),
		|	МАКСИМУМ(НайденныйТариф)
		|ПО
		|	КодНП";
		
	Запрос.УстановитьПараметр("ТЗ",НежилыеТЗ);
	Запрос.УстановитьПараметр("СвойствоИсходныйКод",КонстантыОбработки.СвойствоИсходныйКод);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		
		Если Счетчик = 0 И НЕ ТранзакцияАктивна Тогда
			НачатьТранзакцию();
			ТранзакцияАктивна = Истина;
			
			ДокИзм = Документы.ркИзменениеЗначенийСвойствОбъектов.СоздатьДокумент();
			ДокИзм.Дата = ДатаОткрытия;
			ДокИзм.Комментарий = "Загрузка данных "+ТекущаяДата();
			ДокИзм.Организация = Организация;
			ДокИзм.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			
			
			ДокСоставНачислений = Документы.ркИзменениеСоставаНачислений.СоздатьДокумент();
			ДокСоставНачислений.Дата = ДатаОткрытия;
			ДокСоставНачислений.Организация = Организация;
			ДокСоставНачислений.Комментарий = "Загрузка данных "+ТекущаяДата();
			ДокСоставНачислений.Ответственный = ПараметрыСеанса.ТекущийПользователь;

		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Выборка.НайденнаяУлица) Тогда
			Сообщить("Не найдена улица "+Выборка.Улица + " для помещения "+Выборка.Наименование);
			Продолжить;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Выборка.НайденныйДом) Тогда
			Сообщить("Не найден дом" + Выборка.ДомНаименование+" для помещения "+Выборка.Наименование);
			//стрДома = Новый Структура("Наименование,Улица,Корпус,Номер,ДатаПостановкиНаУчет,ДатаСнятияСУчета,УК");
			//ЗаполнитьЗначенияСвойств(стрДома,стрДомаТЗ);
			//стрДома.Наименование = стрДомаТЗ.НаименованиеТекст;
			//ДомСсылка = Справочники.ркДома.НайтиПоНаименованию(стрДома.Наименование,Истина);
			//ЭтоНовыйДом = ДомСсылка.Пустая();
			//текДом = ПолучитьДом(стрДома,ДатаОткрытия,КонстантыОбработки.МКДНормы,стрДомаТЗ.ДопРеквизиты.Количество()>0);

			//Продолжить;
		КонецЕсли;
		тАбонент = Выборка.НайденныйЛС;
		Если НЕ ЗначениеЗаполнено(тАбонент) Тогда
			
			НаименованиеГруппыЛицевыхСчетов = Выборка.Улица+", "+Выборка.ДомНомер + ?(ЗначениеЗаполнено(Выборка.Корпус),", "+Выборка.Корпус,"");
			ГруппаЛицевыхСчетов = Справочники.ркЛицевыеСчета.НайтиПоНаименованию(НаименованиеГруппыЛицевыхСчетов,Истина);
			Если ГруппаЛицевыхСчетов.Пустая() Тогда
				ГруппаЛицевыхСчетов = Справочники.ркЛицевыеСчета.СоздатьГруппу();
				ГруппаЛицевыхСчетов.Наименование = НаименованиеГруппыЛицевыхСчетов;
				Если НЕ ЗначениеЗаполнено(ГруппаЛицевыхСчетов.Код) Тогда
					ГруппаЛицевыхСчетов.УстановитьНовыйКод("Гр-");
				КонецЕсли;
				ГруппаЛицевыхСчетов.ОбменДанными.Загрузка = Истина;
				ГруппаЛицевыхСчетов.Записать();
				ГруппаЛицевыхСчетов = ГруппаЛицевыхСчетов.Ссылка;
			КонецЕсли;
			тДом = Выборка.НайденныйДом;
			Если НЕ ЗначениеЗаполнено(тДом) ТОгда
				тНовыйДом = Справочники.ркДома.СоздатьЭлемент();
				тНовыйДом.Наименование = Выборка.ДомНаименование;
				тНовыйДом.Номер = Выборка.ДомНомер;
				тНовыйДом.Корпус = Выборка.Корпус;
				тНовыйДом.Владелец = Выборка.НайденнаяУлица;
				тНовыйДом.УстановитьНовыйКод();
				тНовыйДом.ОбменДанными.Загрузка = Истина;
				
				СтрокаДопРеквизитов = тНовыйДом.ДополнительныеРеквизиты.Добавить();
				СтрокаДопРеквизитов.Свойство = КонстантыОбработки.СвойствоИсходныйКод;
				СтрокаДопРеквизитов.Значение = СокрЛП(Выборка.КодДома);
				
				тНовыйДом.Записать();
				тДом = тНовыйДом.Ссылка;
			КонецЕсли;
			НовыйАбонент = Справочники.ркЛицевыеСчета.СоздатьЭлемент();
			НовыйАбонент.Наименование = Выборка.Наименование;
			НовыйАбонент.Родитель = ГруппаЛицевыхСчетов;
			НовыйАбонент.Дом = тДом;
			НовыйАбонент.ДатаЗакрытия = Выборка.ДатаРасторженияДоговора;
			НовыйАбонент.ДатаОткрытия = Выборка.ДатаДобавления;
			НовыйАбонент.НежилоеПомещение = Истина;
			НовоеПомещение = Справочники.ркПомещения.СоздатьЭлемент();
			НовоеПомещение.Наименование = Выборка.Наименование;
			НовоеПомещение.Тип = КонстантыОбработки.ТипПомещенияКвартира;
			НовоеПомещение.Владелец = тДом;
			НовоеПомещение.Номер = "0";
			НовоеПомещение.УстановитьНовыйКод();
			НовоеПомещение.Записать();
			НовыйАбонент.Помещение = НовоеПомещение.Ссылка;
			
			СтрокаДопРеквизитов = НовыйАбонент.ДополнительныеРеквизиты.Добавить();
			СтрокаДопРеквизитов.Свойство = КонстантыОбработки.СвойствоИсходныйКод;
			СтрокаДопРеквизитов.Значение = СокрЛП(Выборка.КодНП);
			
			СтрокаДопРеквизитов = НовыйАбонент.ДополнительныеРеквизиты.Добавить();
			СтрокаДопРеквизитов.Свойство = КонстантыОбработки.СвойствоНомерДоговора;
			СтрокаДопРеквизитов.Значение = Выборка.НомерДоговора;
			
			СтрокаДопРеквизитов = НовыйАбонент.ДополнительныеРеквизиты.Добавить();
			СтрокаДопРеквизитов.Свойство = КонстантыОбработки.СвойствоОтдельныйВвод;
			СтрокаДопРеквизитов.Значение = Выборка.ОтдельныйВвод;
			
			//СтрокаДопРеквизитов = НовыйАбонент.ДополнительныеРеквизиты.Добавить();
			//СтрокаДопРеквизитов.Свойство = КонстантыОбработки.СвойствоПлощадь;
			//СтрокаДопРеквизитов.Значение = Выборка.Площадь;
			текДатаИзменения = НачалоГода(ДатаОткрытия);


			СтрокаДопРеквизитов = НовыйАбонент.ДополнительныеРеквизиты.Добавить();
			СтрокаДопРеквизитов.Свойство = КонстантыОбработки.СвойствоУчаствуетВМОП;
			СтрокаДопРеквизитов.Значение = Выборка.УчаствуетВМОП;
			НовыйАбонент.УстановитьНовыйКод();
			НовыйАбонент.Записать();
			тАбонент = НовыйАбонент.Ссылка;
			
			СтруктураПоиска = Новый Структура("НачалоДействия,Объект,Свойство", текДатаИзменения,НовыйАбонент.Ссылка,КонстантыОбработки.СвойствоПлощадь);
			НайденныеСтроки = докИзм.Состав.НайтиСтроки(СтруктураПоиска);
			НоваяСтрокаДок = Неопределено;
			Если НайденныеСтроки.Количество()>0 Тогда
				НоваяСтрокаДок = НайденныеСтроки[0];
			Иначе
				НоваяСтрокаДок = докИзм.Состав.Добавить();
			КонецЕсли;
			НоваяСтрокаДок.Объект = НовыйАбонент.Ссылка;                                                 
			НоваяСтрокаДок.НачалоДействия = текДатаИзменения;
			НоваяСтрокаДок.Свойство = КонстантыОбработки.СвойствоПлощадь;
			НоваяСтрокаДок.Значение = Выборка.Площадь;					

		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("НачалоДействия,ЛицевойСчет,ВидРасчета", ДатаОткрытия, тАбонент, КонстантыОбработки.ВидРасчетаЭлектроэнергия);
		НайденныеСтроки = ДокСоставНачислений.Состав.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрокаСоставНачислений = ДокСоставНачислений.Состав.Добавить();
			НоваяСтрокаСоставНачислений.НачалоДействия = ДатаОткрытия;
			НоваяСтрокаСоставНачислений.ЛицевойСчет = тАбонент;
			НоваяСтрокаСоставНачислений.ВидРасчета = КонстантыОбработки.ВидРасчетаЭлектроэнергия;
			Если ЗначениеЗаполнено(Выборка.НайденныйТариф) Тогда
				НоваяСтрокаСоставНачислений.ВидТарифа = Выборка.НайденныйТариф;
				Если НоваяСтрокаСоставНачислений.ВидТарифа.СоставДоступныхЕдиницРасчета.Количество()>0 Тогда
					НоваяСтрокаСоставНачислений.ЕдиницаРасчета = НоваяСтрокаСоставНачислений.ВидТарифа.СоставДоступныхЕдиницРасчета[0].ЕдиницаРасчета;
				Иначе
					НоваяСтрокаСоставНачислений.ЕдиницаРасчета = грЕдиницаРасчета;
				КонецЕсли;				
			Иначе
				НоваяСтрокаСоставНачислений.ВидТарифа = грВидТарифа;
				НоваяСтрокаСоставНачислений.ЕдиницаРасчета = грЕдиницаРасчета;
			КонецЕсли;
			НоваяСтрокаСоставНачислений.СтатусУчастияВРасчетах = КонстантыОбработки.СтатусУчастияВРасчетахСнято;			
			НоваяСтрокаСоставНачислений.УК = тДом.УК;
		КонецЕсли;
		
		ВыборкаСчетчики = Выборка.Выбрать();
		
		Пока ВыборкаСчетчики.Следующий() Цикл
			//проверить вдруг уже есть
			Если НЕ ЗначениеЗаполнено(ВыборкаСчетчики.НайденныйСчетчик) Тогда
				//создавать счетчик
				//если есть информация о нем
				Если НЕ ЗначениеЗаполнено(ВыборкаСчетчики.ПУКод) Тогда
					Продолжить;
				КонецЕсли;
				НовыйСчетчик = Справочники.ркСчетчики.СоздатьЭлемент();
				//НовыйСчетчик.Наименование = ВыборкаСчетчики.ПУНаименование;
				НовыйСчетчик.Наименование = ВыборкаСчетчики.ЗаводскойНомер;
				НовыйСчетчик.Номер = ВыборкаСчетчики.ЗаводскойНомер;				
				НовыйСчетчик.Владелец = тАбонент.Помещение;
				НовыйСчетчик.ДатаВыпуска = ВыборкаСчетчики.ДатаВыпуска;
				
				СтрокаТЧ = НовыйСчетчик.ДополнительныеРеквизиты.Добавить();
				СтрокаТЧ.Свойство = КонстантыОбработки.СвойствоТипПрибораУчета;
				СтрокаТЧ.Значение = ВыборкаСчетчики.ТипПрибораУчетаНаименование;
				
				СтрокаТЧ = НовыйСчетчик.ДополнительныеРеквизиты.Добавить();
				СтрокаТЧ.Свойство = КонстантыОбработки.СвойствоНомерПломбы;
				СтрокаТЧ.Значение = ВыборкаСчетчики.НомерПломбы;
				
				СтрокаТЧ = НовыйСчетчик.ДополнительныеРеквизиты.Добавить();
				СтрокаТЧ.Свойство = КонстантыОбработки.СвойствоДатаПоверки;
				СтрокаТЧ.Значение = ВыборкаСчетчики.ДатаПоверкиСчетчика;
				
				СтрокаТЧ = НовыйСчетчик.ДополнительныеРеквизиты.Добавить();
				СтрокаТЧ.Свойство = КонстантыОбработки.СвойствоДатаУстановки;
				СтрокаТЧ.Значение = ВыборкаСчетчики.ДатаУстановкиСчетчика;

				СтрокаТЧ = НовыйСчетчик.ДополнительныеРеквизиты.Добавить();
				СтрокаТЧ.Свойство = КонстантыОбработки.СвойствоЕИРЦНомерПУ;
				СтрокаТЧ.Значение = ВыборкаСчетчики.ЕИРЦНомерПУ;

				СтрокаТЧ = НовыйСчетчик.ДополнительныеРеквизиты.Добавить();
				СтрокаТЧ.Свойство = КонстантыОбработки.СвойствоОтключен;
				СтрокаТЧ.Значение = ВыборкаСчетчики.Отключен;
				
				СтрокаТЧ = НовыйСчетчик.ДополнительныеРеквизиты.Добавить();
				СтрокаТЧ.Свойство = КонстантыОбработки.СвойствоКоэффициент;
				СтрокаТЧ.Значение = ВыборкаСчетчики.Коэффициент;
				
				СтрокаТЧ = НовыйСчетчик.ДополнительныеРеквизиты.Добавить();
				СтрокаТЧ.Свойство = КонстантыОбработки.СвойствоИсходныйКод;
				СтрокаТЧ.Значение = СокрЛП(ВыборкаСчетчики.ПУКод);
				
				СтрокаТЧ = НовыйСчетчик.ВидыРасчетов.Добавить();
				СтрокаТЧ.ВидПоказаний = Справочники.ркВидыПоказанийСчетчиков.Обычные;
				СтрокаТЧ.ВидРасчета = КонстантыОбработки.ВидРасчетаЭлектроэнергия;
				СтрокаТЧ.ЕдиницаРасчетаНормативногоКоличества = КонстантыОбработки.ЕдиницаКоличествоПроживающих;
				
				НовыйСчетчик.Уровень = Справочники.ркУровниСчетчиков.Индивидуальный;
				
				НовыйСчетчик.УстановитьНовыйКод();
				НовыйСчетчик.Записать();

			КонецЕсли;
		КонецЦикла;
		Счетчик = Счетчик + 1;
		Если Счетчик >= 1000 И ТранзакцияАктивна Тогда
			
			Если ДокИзм.Состав.Количество() > 0 Тогда
				ДокИзм.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
				ДокИзм.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			Если ДокСоставНачислений.Состав.Количество() > 0 Тогда
				ДокСоставНачислений.Состав.Свернуть("НачалоДействия,ЛицевойСчет,ВидРасчета,ВидТарифа,СтатусУчастияВРасчетах,ЕдиницаРасчета,УК");
				ДокСоставНачислений.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
				ДокСоставНачислений.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;			
			Счетчик = 0;
			ТранзакцияАктивна = Ложь;
			ЗафиксироватьТранзакцию();
			
		КонецЕсли;
	КонецЦикла;
	
	Если ТранзакцияАктивна Тогда
		Если ДокИзм.Состав.Количество() > 0 Тогда
			ДокИзм.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
			ДокИзм.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		Если ДокСоставНачислений.Состав.Количество() > 0 Тогда
			ДокСоставНачислений.Состав.Свернуть("НачалоДействия,ЛицевойСчет,ВидРасчета,ВидТарифа,СтатусУчастияВРасчетах,ЕдиницаРасчета,УК");
			ДокСоставНачислений.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
			ДокСоставНачислений.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	КонецЕсли;	

	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНачисленияНежилых(Команда)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр = "(*.dat)|*.dat"; 
	
	Если Не ДиалогВыбораФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	Файл = Новый Файл(ДиалогВыбораФайла.ПолноеИмяФайла);
	ФайлИсточник = Файл.ПолноеИмя;
	Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ФайлИсточник));
	
	ЗагрузитьНачисленияНежилыхНаСервере(Адрес);
	
	Сообщить("Загружены начисления нежилых: " +ТекущаяДатаСеансаНаСервере());
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНачисленияНежилыхНаСервере(пАдрес)
	
	КонстантыОбработки = ПолучитьКонстантыОбработки();
	ФайлПриемник = ПолучитьИмяВременногоФайла("dat");
	ДанныеХранилища = ПолучитьИзВременногоХранилища(пАдрес);
	ДанныеХранилища.Записать(ФайлПриемник);
	
	НачисленияНежилыхТЗ = ЗначениеИзФайла(ФайлПриемник);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.НежилоеПомещениеКод,
		|	ТЗ.НежилоеПомещениеНаименование,
		|	ТЗ.Объем,
		|	ТЗ.Период,
		|	ТЗ.ПриборУчетаКод,
		|	ТЗ.ПриборУчетаНаименование
		|ПОМЕСТИТЬ втТЗ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТЗ.НежилоеПомещениеКод,
		|	втТЗ.НежилоеПомещениеНаименование,
		|	втТЗ.Объем,
		|	втТЗ.Период,
		|	втТЗ.ПриборУчетаКод,
		|	втТЗ.ПриборУчетаНаименование,
		|	ркЛицевыеСчетаДополнительныеРеквизиты.Ссылка КАК НайденныйАбонент,
		|	ркСчетчикиДополнительныеРеквизиты.Ссылка КАК НайденныйПУ,
		|	ркЛицевыеСчетаДополнительныеРеквизиты.Ссылка.Дом.УК
		|ИЗ
		|	втТЗ КАК втТЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ркСчетчики.ДополнительныеРеквизиты КАК ркСчетчикиДополнительныеРеквизиты
		|		ПО втТЗ.ПриборУчетаКод = ркСчетчикиДополнительныеРеквизиты.Значение
		|			И (ркСчетчикиДополнительныеРеквизиты.Свойство = &СвойствоИсходныйКод)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ркЛицевыеСчета.ДополнительныеРеквизиты КАК ркЛицевыеСчетаДополнительныеРеквизиты
		|		ПО втТЗ.НежилоеПомещениеКод = ркЛицевыеСчетаДополнительныеРеквизиты.Значение
		|			И (ркЛицевыеСчетаДополнительныеРеквизиты.Свойство = &СвойствоИсходныйКод)";
		
	Запрос.УстановитьПараметр("ТЗ",НачисленияНежилыхТЗ);
	Запрос.УстановитьПараметр("СвойствоИсходныйКод",КонстантыОбработки.СвойствоИсходныйКод);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	ДокНачислениеГр = Документы.ркНачисления.СоздатьДокумент();
	ДокНачислениеГр.Дата = ДобавитьМесяц(ДатаОткрытия,-1);
	ДокНачислениеГр.Организация = Организация;
	ДокНачислениеГр.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	ДокНачислениеГр.НаОбщедомовыеНужды = Истина;
	ДокНачислениеГр.Комментарий = "Не проводить: Загрузка данных " + ТекущаяДата();
	ДокНачислениеГр.Проведен = Истина;
	ДокНачислениеГр.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
	ДокНачислениеГр.Записать(РежимЗаписиДокумента.Запись);
	
	НЗгр = РегистрыНакопления.ркНачисления.СоздатьНаборЗаписей();
	НЗгр.Отбор.Регистратор.Установить(ДокНачислениеГр.Ссылка);
	НЗгр.Прочитать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.НайденныйАбонент) Тогда
			Сообщить("не найден абонент " + ВыборкаДетальныеЗаписи.НежилоеПомещениеНаименование);
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПриборУчетаНаименование) И НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.НайденныйПУ) Тогда
			Сообщить("не найден пу"+ВыборкаДетальныеЗаписи.ПриборУчетаНаименование);
			Продолжить;
		КонецЕсли;
		
		НоваяЗаписьНачислений = НЗгр.Добавить();
		НоваяЗаписьНачислений.Регистратор = ДокНачислениеГр;
		НоваяЗаписьНачислений.ВидНачисления = Перечисления.ркВидыНачислений.ЕжемесячныеНачисления;
		НоваяЗаписьНачислений.ВидРасчета = КонстантыОбработки.ВидРасчетаЭлектроэнергия;
		НоваяЗаписьНачислений.КоличествоВПределахНормы = ВыборкаДетальныеЗаписи.Объем;
		НоваяЗаписьНачислений.ЛицевойСчет = ВыборкаДетальныеЗаписи.НайденныйАбонент;
		НоваяЗаписьНачислений.НаОбщедомовыеНужды = Ложь;
		НоваяЗаписьНачислений.Период = ВыборкаДетальныеЗаписи.Период;
		НоваяЗаписьНачислений.ПериодЗадолженности = ВыборкаДетальныеЗаписи.Период;
		НоваяЗаписьНачислений.Поставщик = КонстантыОбработки.Поставщик;
		НоваяЗаписьНачислений.ТипОперации = Перечисления.ркТипыОперацийНачисления.НачисленияТекущегоПериода;
		НоваяЗаписьНачислений.УК = ВыборкаДетальныеЗаписи.ДомУК;
		НоваяЗаписьНачислений.ВидНормы = ГрВидНормы;
		НоваяЗаписьНачислений.ВидТарифа = ГрВидТарифа;		
		НоваяЗаписьНачислений.ЕдиницаИзмерения = грВидТарифа.ЕдиницыУчета;		
		НоваяЗаписьНачислений.ЕдиницаРасчета = грЕдиницаРасчета;
		
	КонецЦикла;
	НЗгр.Записать(Истина);
	Сообщить("Создан документ "+ДокНачислениеГр);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСвойстваСчетчиков(Команда)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр = "(*.dat)|*.dat"; 
	
	Если Не ДиалогВыбораФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	Файл = Новый Файл(ДиалогВыбораФайла.ПолноеИмяФайла);
	ФайлИсточник = Файл.ПолноеИмя;
	Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ФайлИсточник));
	
	ЗагрузитьСвойстваСчетчиковНаСервере(Адрес);
	
	Сообщить("Загружены свойства счетчиков: " +ТекущаяДатаСеансаНаСервере());
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСвойстваСчетчиковНаСервере(пАдрес)
	
	КонстантыОбработки = ПолучитьКонстантыОбработки();
	ФайлПриемник = ПолучитьИмяВременногоФайла("dat");
	ДанныеХранилища = ПолучитьИзВременногоХранилища(пАдрес);
	ДанныеХранилища.Записать(ФайлПриемник);
	
	ПУТЗ = ЗначениеИзФайла(ФайлПриемник);
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.ВидЭнергоназначений,
		|	ТЗ.Владелец,
		|	ТЗ.ЗаводскойНомер,
		|	ТЗ.Код,
		|	ТЗ.Наименование,
		|	ТЗ.ТипВладельца,
		|	ТЗ.ТипПрибораУчета,
		|	ТЗ.ВладелецКод
		|ПОМЕСТИТЬ втТЗ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТЗ.ВидЭнергоназначений,
		|	втТЗ.Владелец,
		|	втТЗ.ЗаводскойНомер,
		|	втТЗ.Код,
		|	втТЗ.Наименование,
		|	втТЗ.ТипВладельца,
		|	втТЗ.ТипПрибораУчета,
		|	втТЗ.ВладелецКод,
		|	ркЛицевыеСчета.Ссылка КАК НайденныйЛС
		|ПОМЕСТИТЬ втЛС
		|ИЗ
		|	втТЗ КАК втТЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ркЛицевыеСчета КАК ркЛицевыеСчета
		|		ПО втТЗ.Владелец = ркЛицевыеСчета.Наименование
		|ГДЕ
		|	(втТЗ.ТипВладельца = ""Абонент""
		|			ИЛИ втТЗ.ТипВладельца = ""НП"")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЛС.ВидЭнергоназначений,
		|	втЛС.Владелец,
		|	втЛС.ЗаводскойНомер,
		|	втЛС.Код,
		|	втЛС.Наименование,
		|	втЛС.ТипВладельца,
		|	втЛС.ТипПрибораУчета,
		|	втЛС.ВладелецКод,
		|	МИНИМУМ(ркСчетчики.Ссылка) КАК НайденныйСчетчик
		|ПОМЕСТИТЬ втСчетчикиЛС
		|ИЗ
		|	втЛС КАК втЛС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ркСчетчики КАК ркСчетчики
		|		ПО втЛС.ЗаводскойНомер = ркСчетчики.Номер
		|			И втЛС.НайденныйЛС.Помещение = ркСчетчики.Владелец
		|
		|СГРУППИРОВАТЬ ПО
		|	втЛС.ТипПрибораУчета,
		|	втЛС.ВладелецКод,
		|	втЛС.ВидЭнергоназначений,
		|	втЛС.Владелец,
		|	втЛС.ЗаводскойНомер,
		|	втЛС.Код,
		|	втЛС.Наименование,
		|	втЛС.ТипВладельца
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТЗ.ВидЭнергоназначений,
		|	втТЗ.Владелец,
		|	втТЗ.ЗаводскойНомер,
		|	втТЗ.Код,
		|	втТЗ.Наименование,
		|	втТЗ.ТипВладельца,
		|	втТЗ.ТипПрибораУчета,
		|	втТЗ.ВладелецКод,
		|	МИНИМУМ(ркСчетчики.Ссылка) КАК НайденныйСчетчик
		|ПОМЕСТИТЬ втСчетчикиДом
		|ИЗ
		|	втТЗ КАК втТЗ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ркСчетчики КАК ркСчетчики
		|		ПО (ркСчетчики.Владелец ССЫЛКА Справочник.ркДома)
		|			И втТЗ.ЗаводскойНомер = ркСчетчики.Номер
		|ГДЕ
		|	втТЗ.ТипВладельца = ""Дом""
		|
		|СГРУППИРОВАТЬ ПО
		|	втТЗ.ТипВладельца,
		|	втТЗ.ВладелецКод,
		|	втТЗ.Наименование,
		|	втТЗ.ТипПрибораУчета,
		|	втТЗ.Код,
		|	втТЗ.ЗаводскойНомер,
		|	втТЗ.ВидЭнергоназначений,
		|	втТЗ.Владелец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втСчетчикиЛС.ВидЭнергоназначений,
		|	втСчетчикиЛС.Владелец,
		|	втСчетчикиЛС.ЗаводскойНомер,
		|	втСчетчикиЛС.Код,
		|	втСчетчикиЛС.Наименование,
		|	втСчетчикиЛС.ТипВладельца,
		|	втСчетчикиЛС.ТипПрибораУчета,
		|	втСчетчикиЛС.ВладелецКод,
		|	втСчетчикиЛС.НайденныйСчетчик
		|ИЗ
		|	втСчетчикиЛС КАК втСчетчикиЛС
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втСчетчикиДом.ВидЭнергоназначений,
		|	втСчетчикиДом.Владелец,
		|	втСчетчикиДом.ЗаводскойНомер,
		|	втСчетчикиДом.Код,
		|	втСчетчикиДом.Наименование,
		|	втСчетчикиДом.ТипВладельца,
		|	втСчетчикиДом.ТипПрибораУчета,
		|	втСчетчикиДом.ВладелецКод,
		|	втСчетчикиДом.НайденныйСчетчик
		|ИЗ
		|	втСчетчикиДом КАК втСчетчикиДом";
		
	Запрос.УстановитьПараметр("ТЗ",ПУТЗ);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Сч = 0;
	Пока Выборка.Следующий() Цикл
		
		тСчетчик = Выборка.НайденныйСчетчик.ПолучитьОбъект();

		СтруктураПоиска = Новый Структура("Свойство", КонстантыОбработки.СвойствоТипПрибораУчета);
		НайденныеСтроки = тСчетчик.ДополнительныеРеквизиты.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() > 0 Тогда
			стрДополнительныеРеквизиты = НайденныеСтроки[0];
		Иначе
			стрДополнительныеРеквизиты = тСчетчик.ДополнительныеРеквизиты.Добавить();
		КонецЕсли;
		стрДополнительныеРеквизиты.Свойство = КонстантыОбработки.СвойствоТипПрибораУчета;
		стрДополнительныеРеквизиты.Значение = ПолучитьЗначениеСвойства(стрДополнительныеРеквизиты.Свойство,Выборка.ТипПрибораУчета);

		СтруктураПоиска = Новый Структура("Свойство", КонстантыОбработки.СвойствоВидЭнергоназначений);
		НайденныеСтроки = тСчетчик.ДополнительныеРеквизиты.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() > 0 Тогда
			стрДополнительныеРеквизиты = НайденныеСтроки[0];
		Иначе
			стрДополнительныеРеквизиты = тСчетчик.ДополнительныеРеквизиты.Добавить();
		КонецЕсли;
		стрДополнительныеРеквизиты.Свойство = КонстантыОбработки.СвойствоВидЭнергоназначений;
		стрДополнительныеРеквизиты.Значение = ПолучитьЗначениеСвойства(стрДополнительныеРеквизиты.Свойство,Выборка.ВидЭнергоназначений);
		
		тСчетчик.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНормыОДН(Команда)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр = "(*.dat)|*.dat"; 
	
	Если Не ДиалогВыбораФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	Файл = Новый Файл(ДиалогВыбораФайла.ПолноеИмяФайла);
	ФайлИсточник = Файл.ПолноеИмя;
	Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ФайлИсточник));
	
	ЗагрузитьНормыОДННаСервере(Адрес);
	
	Сообщить("Загружены нормы ОДН: " +ТекущаяДатаСеансаНаСервере());
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНормыОДННаСервере(пАдрес)
	
	КонстантыОбработки = ПолучитьКонстантыОбработки();
	ФайлПриемник = ПолучитьИмяВременногоФайла("dat");
	ДанныеХранилища = ПолучитьИзВременногоХранилища(пАдрес);
	ДанныеХранилища.Записать(ФайлПриемник);
	
	ТЗ = ЗначениеИзФайла(ФайлПриемник);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.Период,
		|	ТЗ.ДомПредставление,
		|	ТЗ.ЗначениеНормативаМОП,
		|	ТЗ.Этажность
		|ПОМЕСТИТЬ втТЗ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТЗ.Период,
		|	втТЗ.ДомПредставление,
		|	втТЗ.ЗначениеНормативаМОП,
		|	втТЗ.Этажность,
		|	ркДома.Ссылка
		|ИЗ
		|	втТЗ КАК втТЗ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ркДома КАК ркДома
		|		ПО ВЫРАЗИТЬ(втТЗ.ДомПредставление КАК СТРОКА(250)) = ркДома.Наименование";
		
	Запрос.УстановитьПараметр("ТЗ",ТЗ);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДом = РезультатЗапроса.Выбрать();
	
	Счетчик = 0;
	Док = Неопределено;
	
	Пока ВыборкаДом.Следующий() Цикл
		
		Если Счетчик = 0 Тогда
			Док = Документы.рцПараметрыРасчетаОДН.СоздатьДокумент();
			Док.Дата = ДатаОткрытия;
			Док.Комментарий = "Загрузка данных "+ТекущаяДата();
			Док.Организация = Организация;
			Док.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			Док.УстановитьНовыйНомер();
		КонецЕсли;
		
		тДом = ВыборкаДом.Ссылка;
		
		СтруктураПоиска = Новый Структура("Дом,НачалоДействия", тДом,ВыборкаДом.Период);
		НайденныеСтроки = Док.Состав.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() > 0 Тогда
			НоваяСтрокаТЧ = НайденныеСтроки[0];
		Иначе
			НоваяСтрокаТЧ = Док.Состав.Добавить();
		КонецЕсли;		
		
		НоваяСтрокаТЧ.Дом = тДом;
		НоваяСтрокаТЧ.ВидРасчета = КонстантыОбработки.ВидРасчетаЭлектроЭнергия;
		НоваяСтрокаТЧ.ЗначениеНормы = ВыборкаДом.ЗначениеНормативаМОП;
		НоваяСтрокаТЧ.ОграничиватьПоказанияОДПУ = Истина;
		НоваяСтрокаТЧ.НачалоДействия = ВыборкаДом.Период;
		НоваяСтрокаТЧ.ХарактеристикаПлощадьМОП = КонстантыОбработки.СвойствоПлощадьМОП;
		НоваяСтрокаТЧ.НачислятьОДН = Истина;
		
		Счетчик = Счетчик+1;
		Если Счетчик > 1000 Тогда
			Счетчик = 0;
			Док.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
			Док.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецЦикла;
	Если Счетчик > 0 Тогда
		Док.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
		Док.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДогрузитьПоказания(Команда)
	
	СписокФайлов = НайтиФайлы(КаталогДанных,"Выгр*.dat");
	Для Каждого тФайл Из СписокФайлов Цикл
		Сообщить("Начало чтения из файла: "+тФайл.ПолноеИмя+" "+ТекущаяДатаСеансаНаСервере());		
		ФайлИсточник = тФайл.ПолноеИмя;
		Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ФайлИсточник));	
		ДогрузитьПоказанияСервер(Адрес);
		Сообщить("Окончение чтения из файла: "+тФайл.ПолноеИмя+" "+ТекущаяДатаСеансаНаСервере());		
	КонецЦикла;
	Сообщить("Завершена дозагрузка показаний "+ТекущаяДатаСеансаНаСервере());

КонецПроцедуры

&НаСервере	
Процедура ДогрузитьПоказанияСервер(пАдрес)
	
	ФайлПриемник = ПолучитьИмяВременногоФайла("dat");
	ДанныеХранилища = ПолучитьИзВременногоХранилища(пАдрес);
	ДанныеХранилища.Записать(ФайлПриемник);	
	
	ДомаТЗ = ЗначениеИзФайла(ФайлПриемник);
	
	КонстантыОбработки = ПолучитьКонстантыОбработки();
	СтатусПроживает = Константы.ркСтатусПроживает.Получить();
	
	Счетчик = 0;
	ТранзакцияАктивна = Ложь;
	ДокИзм = Неопределено;
	ДокИзмГПУ = Неопределено;
	ДокПроживающие = Неопределено;
	ДокИзмИПУ = Неопределено;
	//ДокПоказанияСчетчиков = Неопределено;
	ДокОплата = Неопределено;
	ДокСоставНачислений = Неопределено;
	//ДокПоказанийГПУ = Неопределено;
	ТЗПоказаний = ПолучитьТЗПоказаний();
	Для Каждого стрДомаТЗ Из ДомаТЗ Цикл
		//Наименование
		//Улица
		//Номер
		//Корпус
		//ДатаПостановкиНаУчет
		//ДатаСнятияСУчета
		//ОДПУ (ТЗ)
		//Доп.реквизиты дома (ТЗ)
		//Лицевые счета (ТЗ)
		
		
		стрДома = Новый Структура("Наименование,Улица,Корпус,Номер,ДатаПостановкиНаУчет,ДатаСнятияСУчета,УК");
		ЗаполнитьЗначенияСвойств(стрДома,стрДомаТЗ);
		стрДома.Наименование = стрДомаТЗ.НаименованиеТекст;
		текДом = Справочники.ркДома.НайтиПоНаименованию(стрДома.Наименование,Истина);
		
		Если текДом.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого стрЛицевыеСчетаТЗ Из стрДомаТЗ.ЛС Цикл
			
			//НомерЛС
			//Наименование
			//ПомещениеНаименование
			//ПомещениеНомер
			//ПомещениеЖилоеМуниципальное
			//ОтветственныйКвартиросъемщик
			//НежилоеПомещение
			//НевыясненнаяСумма
			//ЖилоеМуниципальное
			//ОтветственныйКвартиросъемщикФамилия
			//ОтветственныйКвартиросъемщикИмя
			//ОтветственныйКвартиросъемщикОтчество
			//ОтветственныйКвартиросъемщикДатаРождения
			//ОтветственныйКвартиросъемщикПол
			//ДатаОткрытия
			//ДатаЗакрытия
			//ДополнительныеРеквизиты (ТЗ)
			//ОбъектыРасчета (ТЗ)
			//Счетчики (ТЗ)
			//Сальдо (ТЗ)
			//Нормативы (ТЗ)
			
			//текДОм, ГруппаЛицевыхСчетов
			
			ПомещениеСсылка = Справочники.ркПомещения.НайтиПоНаименованию(стрЛицевыеСчетаТЗ.ПомещениеНаименование,Истина,,текДом);
			Если ПомещениеСсылка.Пустая() Тогда
				Продолжить;
			КонецЕсли;
			
			текЛицевойСчет = Справочники.ркЛицевыеСчета.НайтиПоКоду(стрЛицевыеСчетаТЗ.НомерЛС);
			Если текЛицевойСчет.Пустая() ИЛИ текЛицевойСчет.ЭтоГруппа Тогда
				Продолжить;
			КонецЕсли;
			
			ЕстьСчетчик = Ложь;
			МассивСчетчиков = Новый Массив;
			Для Каждого стрСчетчики Из стрЛицевыеСчетаТЗ.Счетчики Цикл
				
				
				//Наименование
				//ДатаВыпуска
				//Номер
				//КлассТочности
				//НачальныеПоказания
				//ДатаВключения //в документ
				//ДатаПоверки
				//ДатаПроверки
				//МежповерочныйИнтервал
				//ПоказанияСчетчика (ТЗ)
				
				//текСчетчик = Справочники.ркСчетчики.НайтиПоРеквизиту("Номер",стрСчетчики.Номер,,текЛицевойСЧет.Помещение);
				текСчетчик = Справочники.ркСчетчики.НайтиПоНаименованию(стрСчетчики.Номер,Истина,,текЛицевойСЧет.Помещение);
				Если текСчетчик.Пустая() Тогда
					Продолжить;
				КонецЕсли;
				
				Если МассивСчетчиков.Найти(текСчетчик) = Неопределено Тогда
					МассивСчетчиков.Добавить(текСчетчик);
				Иначе
					Продолжить;
				КонецЕсли;
				
				НачальноеКоличество = 0;
				НачальныйПереворот = Ложь;
				ПериодНачальногоКоличества = Дата(1001,1,1);
				Первое = Истина;
				
				Для Каждого стрПоказание Из стрСчетчики.ПоказанияСчетчика Цикл
					
					//ВидПоказаний
					//МетодРасчета
					//НачальноеПоказание
					//КонечноеПоказание
					//Количество
					//ДатаПоказания
					//ДатаНачалаПериодаПоказаний
					//ДатаКонцаПериодаПоказаний
					
					//ВидПоказанийСпр = Справочники.ркВидыПоказанийСчетчиков.НайтиПоНаименованию(стрПоказание.ВидПоказаний,Истина);
					//Если ВидПоказанийСпр.Пустая() Тогда
					//	НовыйВидПоказаний = Справочники.ркВидыПоказанийСчетчиков.СоздатьЭлемент();
					//	НовыйВидПоказаний.Наименование = стрПоказание.ВидПоказаний;
					//	НовыйВидПоказаний.УстановитьНовыйКод();
					//	НовыйВидПоказаний.ОбменДанными.Загрузка = Истина;
					//	НовыйВидПоказаний.Записать();
					//	ВидПоказанийСпр = НовыйВидПоказаний.Ссылка;
					//КонецЕсли;
					Если НачалоМесяца(ДатаОграничения) <> НачалоМесяца(стрПоказание.ОтчетныйПериод) Тогда
						Продолжить;
					КонецЕсли;
					Если НЕ стрПоказание.Состояние Тогда
						Продолжить;
					КонецЕсли;
					
					Если ПериодНачальногоКоличества <> НачалоМесяца(стрПоказание.ОтчетныйПериод) ИЛИ Первое Тогда
						ПериодНачальногоКоличества = НачалоМесяца(стрПоказание.ОтчетныйПериод);
						НачальноеКоличество = стрПоказание.НачальноеПоказание;
						НачальныйПереворот = стрПоказание.Переворот;
					КонецЕсли;
					Если Первое Тогда
						Первое = Ложь;
					КонецЕсли;

					НоваяСтрокаТЗ = ТЗПоказаний.Добавить();
					НоваяСтрокаТЗ.ОтчетныйПериод = стрПоказание.ОтчетныйПериод;
					НоваяСтрокаТЗ.ВидПоказаний = Справочники.ркВидыПоказанийСчетчиков.Обычные;
					НоваяСтрокаТЗ.ДатаНачала = НачалоМесяца(стрПоказание.ОтчетныйПериод);//стрПоказание.ДатаНачалаПериодаПоказаний;
					НоваяСтрокаТЗ.ДатаОкончания = КонецМесяца(стрПоказание.ОтчетныйПериод);//стрПоказание.ДатаКонцаПериодаПоказаний;
					НоваяСтрокаТЗ.Дом = текДом;
					НоваяСтрокаТЗ.Сброс = стрПоказание.Переворот;
					Если стрПоказание.Переворот ИЛИ НачальныйПереворот Тогда
						НоваяСтрокаТЗ.Количество = ПолучитьКоличествоПереворот(стрПоказание.КонечноеПоказание,НачальноеКоличество);
						НоваяСтрокаТЗ.Сброс = Истина;
					Иначе
						НоваяСтрокаТЗ.Количество = стрПоказание.КонечноеПоказание - НачальноеКоличество;
					КонецЕсли;
					
					НоваяСтрокаТЗ.ЛицевойСчет = текЛицевойСчет;
					НоваяСтрокаТЗ.НачальноеКоличество = НачальноеКоличество;
					НоваяСтрокаТЗ.КонечныеПоказания = стрПоказание.КонечноеПоказание;
					НоваяСтрокаТЗ.ПериодДействия = стрПоказание.ДатаНачалаПериодаПоказаний;
					НоваяСтрокаТЗ.Помещение = ПомещениеСсылка;
					НоваяСтрокаТЗ.Счетчик = текСчетчик;
					Если ЗначениеЗаполнено(текСчетчик) Тогда
						НоваяСтрокаТЗ.КодСчетчика = текСчетчик.Код;
					КонецЕсли;
					Если НачалоМесяца(стрСчетчики.ДатаУстановки) = НачалоМесяца(НоваяСтрокаТЗ.ДатаНачала) ИЛИ НачалоМесяца(стрСчетчики.Период) = НачалоМесяца(НоваяСтрокаТЗ.ДатаНачала) И стрСчетчики.Действует Тогда
						НоваяСтрокаТЗ.НачальноеКоличество = НоваяСтрокаТЗ.КонечныеПоказания;
						НоваяСтрокаТЗ.Количество = 0;
						НоваяСтрокаТЗ.Сброс = Ложь;
					КонецЕсли;

				КонецЦикла
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ДоЗаписатьПоказания(ТЗПоказаний,КонстантыОбработки);
	//ЗаписатьПоказания(ТЗПоказаний,КонстантыОбработки,Истина);
	
КонецПроцедуры

&НаСервере
Процедура ДоЗаписатьПоказания(пТЗ,КонстантыОбработки)
	
	пТЗ.Сортировать("ПериодДействия Возр,КодСчетчика Возр, КонечныеПоказания Возр");
	ДокПоказанияСчетчиков = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.ВидПоказаний,
		|	ТЗ.ДатаНачала,
		|	ТЗ.ДатаОкончания,
		|	ТЗ.Дом,
		|	ТЗ.Количество,
		|	ТЗ.ЛицевойСчет,
		|	ТЗ.НачальноеКоличество,
		|	ТЗ.КонечныеПоказания,
		|	ТЗ.ПериодДействия,
		|	ТЗ.Помещение,
		|	ТЗ.Счетчик,
		|	ТЗ.КодСчетчика,
		|	ТЗ.Сброс
		|ПОМЕСТИТЬ втТЗ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТЗ.ДатаНачала,
		|	втТЗ.ДатаОкончания,
		|	втТЗ.Дом,
		|	втТЗ.ЛицевойСчет,
		|	втТЗ.КонечныеПоказания КАК КонечныеПоказания,
		|	втТЗ.ПериодДействия,
		|	втТЗ.Помещение,
		|	втТЗ.Счетчик,
		|	втТЗ.КодСчетчика,
		|	втТЗ.ВидПоказаний,
		|	втТЗ.Сброс КАК Сброс
		|ПОМЕСТИТЬ втМакс
		|ИЗ
		|	втТЗ КАК втТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	рцПоказанияСчетчиков.Счетчик,
		|	рцПоказанияСчетчиков.НачальныеПоказания КАК НачальныеПоказания,
		|	рцПоказанияСчетчиков.Период,
		|	рцПоказанияСчетчиков.Автор
		|ПОМЕСТИТЬ втСрезПоказаний
		|ИЗ
		|	РегистрСведений.рцПоказанияСчетчиков КАК рцПоказанияСчетчиков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втМакс КАК втМакс
		|		ПО рцПоказанияСчетчиков.Счетчик = втМакс.Счетчик
		|			И рцПоказанияСчетчиков.Период <= втМакс.ДатаНачала
		|ГДЕ
		|	рцПоказанияСчетчиков.Автор ССЫЛКА Документ.ркПоказанияСчетчиков
		|	И рцПоказанияСчетчиков.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.рцМетодыРасчетаПоказанийИПУ.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втСрезПоказаний.Счетчик,
		|	МАКСИМУМ(втСрезПоказаний.Период) КАК Период
		|ПОМЕСТИТЬ втСрезМаксПериод
		|ИЗ
		|	втСрезПоказаний КАК втСрезПоказаний
		|
		|СГРУППИРОВАТЬ ПО
		|	втСрезПоказаний.Счетчик
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втСрезПоказаний.Счетчик,
		|	МАКСИМУМ(втСрезПоказаний.НачальныеПоказания) КАК НачальныеПоказания,
		|	втСрезПоказаний.Период
		|ПОМЕСТИТЬ втСрезМаксПоказания
		|ИЗ
		|	втСрезМаксПериод КАК втСрезМаксПериод
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСрезПоказаний КАК втСрезПоказаний
		|		ПО втСрезМаксПериод.Счетчик = втСрезПоказаний.Счетчик
		|			И втСрезМаксПериод.Период = втСрезПоказаний.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	втСрезПоказаний.Счетчик,
		|	втСрезПоказаний.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втМакс.ДатаНачала,
		|	втМакс.ДатаОкончания,
		|	втМакс.Дом,
		|	втМакс.ЛицевойСчет,
		|	втМакс.КонечныеПоказания КАК КонечныеПоказания,
		|	втМакс.ПериодДействия КАК ПериодДействия,
		|	втМакс.Помещение,
		|	втМакс.Счетчик КАК Счетчик,
		|	втМакс.КодСчетчика,
		|	втМакс.ВидПоказаний,
		|	ВЫБОР
		|		КОГДА втСрезМаксПоказания.НачальныеПоказания ЕСТЬ NULL 
		|			ТОГДА втМакс.КонечныеПоказания
		|		ИНАЧЕ втСрезМаксПоказания.НачальныеПоказания
		|	КОНЕЦ КАК НачальноеКоличество,
		|	втМакс.Сброс,
		|	ВЫБОР
		|		КОГДА втСрезМаксПоказания.Период ЕСТЬ NULL 
		|			ТОГДА втМакс.ДатаНачала
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(втСрезМаксПоказания.Период, МЕСЯЦ)
		|	КОНЕЦ КАК ПериодНачальногоКоличества
		|ИЗ
		|	втМакс КАК втМакс
		|		ЛЕВОЕ СОЕДИНЕНИЕ втСрезМаксПоказания КАК втСрезМаксПоказания
		|		ПО втМакс.Счетчик = втСрезМаксПоказания.Счетчик
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодДействия,
		|	Счетчик,
		|	КонечныеПоказания";
		
	Запрос.УстановитьПараметр("ДатаЗагрузки", ДатаОграничения);
	Запрос.УстановитьПараметр("ТЗ",пТЗ);	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТранзакцияАктивна = Ложь;
	Счетчик = 0;	
	ПредыдущийПериодДействия = Дата('00010101');
	//Для Каждого СтрокаТЗ ИЗ пТЗ Цикл
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ТранзакцияАктивна И (Счетчик = 1000 ИЛИ (КонецМесяца(ВыборкаДетальныеЗаписи.ПериодДействия) <> ПредыдущийПериодДействия И Счетчик <> 0))Тогда
			ДокПоказанияСчетчиков.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
			ДокПоказанияСчетчиков.Записать(РежимЗаписиДокумента.Запись);
			Документы.ркПоказанияСчетчиков.ВыполнитьРаспределениеПоказанийСчетчиков(ДокПоказанияСчетчиков);
			ДокПоказанияСчетчиков.Записать(РежимЗаписиДокумента.Проведение);			
			Счетчик = 0;
			ТранзакцияАктивна = Ложь;
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
		Если НЕ ТранзакцияАктивна Тогда
			
			НачатьТранзакцию();
			ТранзакцияАктивна = Истина;
			ДокПоказанияСчетчиков = Документы.ркПоказанияСчетчиков.СоздатьДокумент();
			ДокПоказанияСчетчиков.Дата = КонецМесяца(ВыборкаДетальныеЗаписи.ПериодДействия);
			ДокПоказанияСчетчиков.Комментарий = "Загрузка данных "+ТекущаяДата();
			ДокПоказанияСчетчиков.Организация = Организация;
			ДокПоказанияСчетчиков.Ответственный = ПараметрыСеанса.ТекущийПользователь;			
			ДокПоказанияСчетчиков.ТипОперации = Перечисления.ркТипыОперацийПоказанийСчетчиков.ПоказанияЗаПериод;
			ДокПоказанияСчетчиков.ИсточникПоказаний = Перечисления.рцИсточникПоказанийИПУ.ИсторияПоказаний;
			
		КонецЕсли;
		
		//НоваяСтрокаТЧ = ДокПоказанияСчетчиков.СоставРаспределенныхПоказаний.Добавить();
		//НоваяСтрокаТЧ.ВидНачисления = Перечисления.ркВидыНачислений.ЕжемесячныеНачисления;
		//НоваяСтрокаТЧ.ВидПоказаний = Справочники.ркВидыПоказанийСчетчиков.Обычные;
		//НоваяСтрокаТЧ.ВидРасчета = КонстантыОбработки.ВидРасчетаЭлектроэнергия;
		//НоваяСтрокаТЧ.ДатаНачала = ВыборкаДетальныеЗаписи.ДатаНачала;
		//НоваяСтрокаТЧ.ДатаОкончания = ВыборкаДетальныеЗаписи.ДатаОкончания;
		//НоваяСтрокаТЧ.Делитель = 1;
		//НоваяСтрокаТЧ.Дом = ВыборкаДетальныеЗаписи.Дом;
		//НоваяСтрокаТЧ.ЕдиницаИзмерения = КонстантыОбработки.Квтч;
		////НоваяСтрокаТЧ.Количество = ВыборкаДетальныеЗаписи.Количество;
		//Если ВыборкаДетальныеЗаписи.Сброс Тогда
		//	НоваяСтрокаТЧ.Количество = ПолучитьКоличествоПереворот(ВыборкаДетальныеЗаписи.КонечныеПоказания, ВыборкаДетальныеЗаписи.НачальноеКоличество);
		//Иначе
		//	НоваяСтрокаТЧ.Количество = ВыборкаДетальныеЗаписи.КонечныеПоказания - ВыборкаДетальныеЗаписи.НачальноеКоличество;
		//КонецЕсли;
		//НоваяСтрокаТЧ.ЛицевойСчет = ВыборкаДетальныеЗаписи.ЛицевойСчет;
		//НоваяСтрокаТЧ.НачальноеКоличество = ВыборкаДетальныеЗаписи.НачальноеКоличество;
		//НоваяСтрокаТЧ.ПериодДействия = ВыборкаДетальныеЗаписи.ПериодДействия;
		//НоваяСтрокаТЧ.Помещение = ВыборкаДетальныеЗаписи.Помещение;
		//НоваяСтрокаТЧ.Счетчик = ВыборкаДетальныеЗаписи.Счетчик;
		//НоваяСтрокаТЧ.ТипОперации = Перечисления.ркТипыОперацийНачисления.НачисленияТекущегоПериода;
		//НоваяСтрокаТЧ.Уровень = Справочники.ркУровниСчетчиков.Индивидуальный;
		
		НоваяСтрокаТЧСостав = ДокПоказанияСчетчиков.Состав.Добавить();
		НоваяСтрокаТЧСостав.ВидНачисления = Перечисления.ркВидыНачислений.ЕжемесячныеНачисления;
		НоваяСтрокаТЧСостав.ВидРасчета = КонстантыОбработки.ВидРасчетаЭлектроэнергия;
		НоваяСтрокаТЧСостав.ВидПоказаний = Справочники.ркВидыПоказанийСчетчиков.Обычные;
		НоваяСтрокаТЧСостав.ДатаНачалаПоказаний = ВыборкаДетальныеЗаписи.ПериодНачальногоКоличества;
		НоваяСтрокаТЧСостав.ДатаОкончанияПоказаний = ВыборкаДетальныеЗаписи.ДатаОкончания;
		НоваяСтрокаТЧСостав.Дом = ВыборкаДетальныеЗаписи.Дом;
		
		Если ВыборкаДетальныеЗаписи.Сброс Тогда
			НоваяСтрокаТЧСостав.Количество = ПолучитьКоличествоПереворот(ВыборкаДетальныеЗаписи.КонечныеПоказания, ВыборкаДетальныеЗаписи.НачальноеКоличество);
			НоваяСтрокаТЧСостав.Переворот = Истина;
		Иначе
			НоваяСтрокаТЧСостав.Количество = ВыборкаДетальныеЗаписи.КонечныеПоказания - ВыборкаДетальныеЗаписи.НачальноеКоличество;
		КонецЕсли;

		НоваяСтрокаТЧСостав.КонечныеПоказания = ВыборкаДетальныеЗаписи.КонечныеПоказания;
		НоваяСтрокаТЧСостав.ЛицевойСчет = ВыборкаДетальныеЗаписи.ЛицевойСчет;
		НоваяСтрокаТЧСостав.НачальныеПоказания = ВыборкаДетальныеЗаписи.НачальноеКоличество;
		НоваяСтрокаТЧСостав.Помещение = ВыборкаДетальныеЗаписи.Помещение;
		НоваяСтрокаТЧСостав.Счетчик = ВыборкаДетальныеЗаписи.Счетчик;
		
		Счетчик = Счетчик+1;
		ПредыдущийПериодДействия = ВыборкаДетальныеЗаписи.ПериодДействия;
	КонецЦикла;
	Если ТранзакцияАктивна Тогда
		Если ДокПоказанияСчетчиков <> Неопределено Тогда
			ДокПоказанияСчетчиков.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
			ДокПоказанияСчетчиков.Записать(РежимЗаписиДокумента.Запись);
			Документы.ркПоказанияСчетчиков.ВыполнитьРаспределениеПоказанийСчетчиков(ДокПоказанияСчетчиков);
			ДокПоказанияСчетчиков.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	КонецЕсли;

КонецПроцедуры // ЗаписатьПоказания()

&НаКлиенте
Процедура ДогрузитьОплаты(Команда)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр = "(*.dat)|*.dat"; 	
	Если Не ДиалогВыбораФайла.Выбрать() Тогда
		Возврат;		
	КонецЕсли;
	
	Файл = Новый Файл(ДиалогВыбораФайла.ПолноеИмяФайла);
	ФайлИсточник = Файл.ПолноеИмя;
	Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ФайлИсточник));
	
	ДогрузитьОплатыСервер(Адрес);
	
	Сообщить("Дозагружены оплаты: " +ТекущаяДатаСеансаНаСервере());


КонецПроцедуры

&НаСервере
Процедура ДогрузитьОплатыСервер(пАдрес)
	ФайлПриемник = ПолучитьИмяВременногоФайла("dat");
	ДанныеХранилища = ПолучитьИзВременногоХранилища(пАдрес);
	ДанныеХранилища.Записать(ФайлПриемник);	
	
	ТЗ = ЗначениеИзФайла(ФайлПриемник);
	ТЗ.Сортировать("Период Возр");
	ПредМесяц = НачалоМесяца(ТЗ[0].Период);
	
	ДокОплата = Неопределено;
	КонстантыОбработки = ПолучитьКонстантыОбработки();
	Счетчик = 0;
	ТранзакцияАктивна = Ложь;
	
	Для каждого СтрокаТЗ Из ТЗ Цикл
		
		Если ТранзакцияАктивна И (Счетчик = 1000 ИЛИ ПредМесяц<>НачалоМесяца(СтрокаТЗ.ПЕриод)) Тогда
			
			ДокОплата.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
			Если ДокОплата.Дата > ДатаОграничения Тогда
				Документы.ркОплата.ВыполнитьРаспределениеОплаты(ДокОплата);
				//ДокОплата.ОбменДанными.Загрузка = Истина;
				ДокОплата.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				ДокОплата.Проведен = Истина;
				ДокОплата.Комментарий = ДокОплата.Комментарий + "не перепроводить";
				//ДокОплата.ОбменДанными.Загрузка = Истина;
				ДокОплата.Записать(РежимЗаписиДокумента.Запись);
				НЗ = РегистрыНакопления.ркОплата.СоздатьНаборЗаписей();
				НЗ.Отбор.Регистратор.Установить(ДокОплата.Ссылка);
				
				Для Каждого тСтрокаТЗ Из ДокОплата.Состав Цикл
					НоваяЗапись = НЗ.Добавить();
					НоваяЗапись.Период = ДокОплата.Дата;
					НоваяЗапись.ЛицевойСчет = тСтрокаТЗ.ЛицевойСчет;
					НоваяЗапись.УК = тСтрокаТЗ.УК;
					НоваяЗапись.ТипОперации = ДокОплата.ТипОперации;
					НоваяЗапись.ПериодЗадолженности = тСтрокаТЗ.ПериодЗадолженности;
					НоваяЗапись.ВидРасчета = тСтрокаТЗ.ВидРасчета;
					НоваяЗапись.Поставщик = тСтрокаТЗ.Поставщик;
					НоваяЗапись.ДатаОплаты = тСтрокаТЗ.ДатаОплаты;
					НоваяЗапись.СпособОплаты = ДокОплата.СпособОплаты;
					НоваяЗапись.ПлатежныйАгент = ДокОплата.ПлатежныйАгент;
					НоваяЗапись.Сумма = тСтрокаТЗ.Сумма;
					НоваяЗапись.СуммаКомиссии = тСтрокаТЗ.СуммаКомиссии;
					НоваяЗапись.СтрокаРеестраПлатежей = тСтрокаТЗ.СтрокаРеестраПлатежей;
				КонецЦикла;
				НЗ.Записать(Истина);
			КонецЕсли;

			Счетчик = 0;
			ТранзакцияАктивна = Ложь;
			ЗафиксироватьТранзакцию();
			
		КонецЕсли;
		Если Счетчик = 0 И НЕ ТранзакцияАктивна Тогда
			НачатьТранзакцию();
			ТранзакцияАктивна = Истина;
			
			ДокОплата = Документы.ркОплата.СоздатьДокумент();
			ДокОплата.Дата = КонецМесяца(ПредМесяц);
			ДокОплата.ТипОперации = Перечисления.ркТипыОперацийОплаты.ЗачетОплаты;
			ДокОплата.СпособОплаты = Справочники.ркСпособыОплат.Основной;
			ДокОплата.Комментарий = "Дозагрузка данных "+ТекущаяДата();
			ДокОплата.Организация = Организация;
			ДокОплата.Ответственный = ПараметрыСеанса.ТекущийПользователь;			
		КонецЕсли;
		тЛицевойСчет = Справочники.ркЛицевыеСчета.НайтиПоКоду(СтрокаТЗ.НомерЛС);
		Если тЛицевойСчет.Пустая() ИЛИ тЛицевойСчет.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрокаСоставОплаты = ДокОплата.Состав.Добавить();
		НоваяСтрокаСоставОплаты.УК = тЛицевойСчет.Дом.УК;
		НоваяСтрокаСоставОплаты.ЛицевойСчет = тЛицевойСчет;
		НоваяСтрокаСоставОплаты.ВидРасчета = КонстантыОбработки.ВидРасчетаЭлектроэнергия;				
		НоваяСтрокаСоставОплаты.Поставщик = КонстантыОбработки.Поставщик;
		НоваяСтрокаСоставОплаты.ДатаОплаты =СтрокаТЗ.Период;
		Если ЗначениеЗаполнено(СтрокаТЗ.Сумма) Тогда
			НоваяСтрокаСоставОплаты.Сумма = СтрокаТЗ.Сумма;
		КонецЕсли;
		НоваяСтрокаСоставОплаты.ПравилаРаспределенияОплаты = ПравилоРаспределенияОплаты;
		
		
		Счетчик = Счетчик+1;
		ПредМесяц = НачалоМесяца(СтрокаТЗ.Период);
	КонецЦикла;
	Если ТранзакцияАктивна И Счетчик > 0 Тогда
		Документы.ркОплата.ВыполнитьРаспределениеОплаты(ДокОплата);
		ДокОплата.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
		Если ДокОплата.Дата > ДатаОграничения Тогда
			//ДокОплата.ОбменДанными.Загрузка = Истина;
			ДокОплата.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ДокОплата.Проведен = Истина;
			ДокОплата.Комментарий = ДокОплата.Комментарий + "не перепроводить";
			//ДокОплата.ОбменДанными.Загрузка = Истина;
			ДокОплата.Записать(РежимЗаписиДокумента.Запись);
			НЗ = РегистрыНакопления.ркОплата.СоздатьНаборЗаписей();
			НЗ.Отбор.Регистратор.Установить(ДокОплата.Ссылка);
			
			Для Каждого тСтрокаТЗ Из ДокОплата.Состав Цикл
				НоваяЗапись = НЗ.Добавить();
				НоваяЗапись.Период = ДокОплата.Дата;
				НоваяЗапись.ЛицевойСчет = тСтрокаТЗ.ЛицевойСчет;
				НоваяЗапись.УК = тСтрокаТЗ.УК;
				НоваяЗапись.ТипОперации = ДокОплата.ТипОперации;
				НоваяЗапись.ПериодЗадолженности = тСтрокаТЗ.ПериодЗадолженности;
				НоваяЗапись.ВидРасчета = тСтрокаТЗ.ВидРасчета;
				НоваяЗапись.Поставщик = тСтрокаТЗ.Поставщик;
				НоваяЗапись.ДатаОплаты = тСтрокаТЗ.ДатаОплаты;
				НоваяЗапись.СпособОплаты = ДокОплата.СпособОплаты;
				НоваяЗапись.ПлатежныйАгент = ДокОплата.ПлатежныйАгент;
				НоваяЗапись.Сумма = тСтрокаТЗ.Сумма;
				НоваяЗапись.СуммаКомиссии = тСтрокаТЗ.СуммаКомиссии;
				НоваяЗапись.СтрокаРеестраПлатежей = тСтрокаТЗ.СтрокаРеестраПлатежей;
			КонецЦикла;
			НЗ.Записать(Истина);
		КонецЕсли;

		
		ЗафиксироватьТранзакцию();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДогрузитьПоказанияОДПУ(Команда)
	
	СписокФайлов = НайтиФайлы(КаталогДанных,"Выгр*.dat");
	Для Каждого тФайл Из СписокФайлов Цикл
		Сообщить("Начало чтения из файла: "+тФайл.ПолноеИмя+" "+ТекущаяДатаСеансаНаСервере());
		ФайлИсточник = тФайл.ПолноеИмя;
		Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ФайлИсточник));
		ДогрузитьПоказанияОДПУСервер(Адрес);
		Сообщить("Окончение чтения из файла: "+тФайл.ПолноеИмя+" "+ТекущаяДатаСеансаНаСервере());
	КонецЦикла;
	Сообщить("Дозагружены показания ОДПУ "+ТекущаяДатаСеансаНаСервере());
	
КонецПроцедуры

&НаСервере	
Процедура ДогрузитьПоказанияОДПУСервер(пАдрес)
	
	ФайлПриемник = ПолучитьИмяВременногоФайла("dat");
	ДанныеХранилища = ПолучитьИзВременногоХранилища(пАдрес);
	ДанныеХранилища.Записать(ФайлПриемник);	
	ТЗПоказанийГПУ = ПолучитьТЗПоказанийГПУ();
	ДомаТЗ = ЗначениеИзФайла(ФайлПриемник);
	
	КонстантыОбработки = ПолучитьКонстантыОбработки();
	СтатусПроживает = Константы.ркСтатусПроживает.Получить();
	
	Счетчик = 0;
	ТранзакцияАктивна = Ложь;
	ДокИзм = Неопределено;
	ДокИзмГПУ = Неопределено;
	ДокПроживающие = Неопределено;
	ДокИзмИПУ = Неопределено;
	//ДокПоказанияСчетчиков = Неопределено;
	ДокОплата = Неопределено;
	ДокСоставНачислений = Неопределено;
	//ДокПоказанийГПУ = Неопределено;
	ТЗПоказаний = ПолучитьТЗПоказаний();
	Для Каждого стрДомаТЗ Из ДомаТЗ Цикл
		//Наименование
		//Улица
		//Номер
		//Корпус
		//ДатаПостановкиНаУчет
		//ДатаСнятияСУчета
		//ОДПУ (ТЗ)
		//Доп.реквизиты дома (ТЗ)
		//Лицевые счета (ТЗ)
		
		
		стрДома = Новый Структура("Наименование,Улица,Корпус,Номер,ДатаПостановкиНаУчет,ДатаСнятияСУчета,УК,ДомКод,СвойствоИсходныйКод");
		ЗаполнитьЗначенияСвойств(стрДома,стрДомаТЗ);
		стрДома.Наименование = стрДомаТЗ.НаименованиеТекст;
		стрДома.СвойствоИсходныйКод = КонстантыОбработки.СвойствоИсходныйКод;
		ДомСсылка = Справочники.ркДома.НайтиПоНаименованию(стрДома.Наименование,Истина);
		ЭтоНовыйДом = ДомСсылка.Пустая();
		текДом = ПолучитьДом(стрДома,ДатаОткрытия,КонстантыОбработки.МКДНормы,стрДомаТЗ.ДопРеквизиты.Количество()>0);
		
		Если текДом.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого стрОдпуТЗ Из стрДомаТЗ.ОДПУ Цикл
			//Наименование
			//ДатаВыпуска
			//Номер
			//КлассТочности
			//НачальныеПоказания
			//ДатаВключения
			//ДатаПоверки
			//ДатаПроверки
			//МежповерочныйИнтервал
			
			//текСчетчик = Справочники.ркСчетчики.НайтиПоРеквизиту("Номер",стрОдпуТЗ.Номер,,текДом);
			текСчетчик = Справочники.ркСчетчики.НайтиПоНаименованию(стрОдпуТЗ.Номер,Истина,,текДом);
			Если текСчетчик.Пустая() Тогда
				Продолжить;
			КонецЕсли;
			//если у счетчика есть показания в регистре за этот месяц, то продолжить
			Если ЕстьПоказания(текСчетчик,ДатаОграничения) Тогда
				Продолжить;
			КонецЕсли;		
			
			
			Для Каждого стрПоказанияОдпуТЗ Из стрОдпуТЗ.ПоказанияОДПУ Цикл
				//ВидПоказаний
				//МетодРасчета
				//НачальноеПоказание
				//КонечноеПоказание
				//Количество
				//ДатаПоказания
				//ДатаНачалаПериодаПоказаний
				//ДатаКонцаПериодаПоказаний
				
				СтрокаТЗГПУ = ТЗПоказанийГПУ.Добавить();
				СтрокаТЗГПУ.ПериодПоказаний = стрПоказанияОдпуТЗ.ДатаПоказания;
				СтрокаТЗГПУ.Счетчик = текСчетчик;
				СтрокаТЗГПУ.ВидПоказаний = Справочники.ркВидыПоказанийСчетчиков.Обычные;
				СтрокаТЗГПУ.НачальныеПоказания = стрПоказанияОдпуТЗ.НачальныеПоказания;
				СтрокаТЗГПУ.КонечныеПоказания = стрПоказанияОдпуТЗ.КонечныеПоказания;
				СтрокаТЗГПУ.Количество = стрПоказанияОдпуТЗ.Количество;
				СтрокаТЗГПУ.КоэффициентТрансформации = ?(ЗначениеЗаполнено(стрОдпуТЗ.КоэффициентТрансформации),стрОдпуТЗ.КоэффициентТрансформации,1);
				
			КонецЦикла;
			
		КонецЦикла;

		
	КонецЦикла;
	
	ДоЗаписатьПоказанияГПУ(ТЗПоказанийГПУ,КонстантыОбработки);
	
КонецПроцедуры

&НаСервере
Функция ЕстьПоказания(пСчетчик,пДата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ркПоказанияСчетчиков.Счетчик
		|ИЗ
		|	РегистрНакопления.ркПоказанияСчетчиков КАК ркПоказанияСчетчиков
		|ГДЕ
		|	ркПоказанияСчетчиков.Период МЕЖДУ &ПериодНач И &ПериодКон
		|	И ркПоказанияСчетчиков.Счетчик = &Счетчик";
	
	Запрос.УстановитьПараметр("ПериодКон", КонецМесяца(пДата));
	Запрос.УстановитьПараметр("ПериодНач", НачалоМесяца(пДата));
	Запрос.УстановитьПараметр("Счетчик", пСчетчик);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

&НаСервере
Процедура ДоЗаписатьПоказанияГПУ(пТЗ,КонстантыОбработки)
	
	пТЗ.Сортировать("ПериодПоказаний Возр");
	ДокПоказанийГПУ = Неопределено;
	
	ТранзакцияАктивна = Ложь;
	ПредыдущийПериодДействия = Дата(1,1,1);
	Счетчик = 0;
	
	Для Каждого СтрокаТЗ ИЗ пТЗ Цикл
		
		Если СтрокаТЗ.ПериодПоказаний < ДатаОграничения ИЛИ СтрокаТЗ.ПериодПоказаний > КонецМесяца(ДатаОграничения) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТранзакцияАктивна И (Счетчик = 1000 ИЛИ СтрокаТЗ.ПериодПоказаний <> ПредыдущийПериодДействия) Тогда
			Документы.ркПоказанияГрупповыхСчетчиков.ВыполнитьРаспределениеПоказанийСчетчиков(ДокПоказанийГПУ);
			ДокПоказанийГПУ.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
			ДокПоказанийГПУ.Записать(РежимЗаписиДокумента.Проведение);			
			Счетчик = 0;
			ТранзакцияАктивна = Ложь;
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
		Если НЕ ТранзакцияАктивна Тогда
			
			НачатьТранзакцию();
			ТранзакцияАктивна = Истина;
			ДокПоказанийГПУ = Документы.ркПоказанияГрупповыхСчетчиков.СоздатьДокумент();
			Если СтрокаТЗ.ПериодПоказаний = ПредыдущийПериодДействия Тогда
				ДельтаПериода = ДельтаПериода + 10;
			Иначе
				ДельтаПериода = 0;
			КонецЕсли;
			ДокПоказанийГПУ.Дата = СтрокаТЗ.ПериодПоказаний+ДельтаПериода;
			ДокПоказанийГПУ.Комментарий = "Загрузка данных "+ТекущаяДата();
			ДокПоказанийГПУ.Организация = Организация;
			ДокПоказанийГПУ.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			ДокПоказанийГПУ.ПериодПоказаний = НачалоМесяца(СтрокаТЗ.ПериодПоказаний);
			ДокПоказанийГПУ.ТипОперации = Перечисления.ркТипыОперацийПоказанийСчетчиков.ПоказанияЗаПериод;			
		КонецЕсли;
		
		СтрокаПоказаний = ДокПоказанийГПУ.Состав.Добавить();
		СтрокаПоказаний.Счетчик = СтрокаТЗ.Счетчик;		
		СтрокаПоказаний.ВидПоказаний = СтрокаТЗ.ВидПоказаний;
		СтрокаПоказаний.КонечныеПоказания = СтрокаТЗ.КонечныеПоказания;
		стрНачальныеПоказания = Документы.ркПоказанияГрупповыхСчетчиков.ПолучитьНачальныеПоказанияОДПУ(СтрокаПоказаний.Счетчик,СтрокаПоказаний.ВидПоказаний,СтрокаТЗ.ПериодПоказаний);
		//СтрокаПоказаний.НачальныеПоказания = СтрокаТЗ.НачальныеПоказания;
		СтрокаПоказаний.НачальныеПоказания = стрНачальныеПоказания.НачальныеПоказания;
		СтрокаПоказаний.ПериодДействияНачальныхПоказаний = стрНачальныеПоказания.ПериодДействияНачальныхПоказаний;
		СтрокаПоказаний.Количество = СтрокаТЗ.Количество;
		СтрокаПоказаний.КоэффициентТрансформации = СтрокаТЗ.КоэффициентТрансформации;
		
		ПредыдущийПериодДействия = СтрокаТЗ.ПериодПоказаний;
		Счетчик = Счетчик+1;
	КонецЦикла;

	Если ТранзакцияАктивна Тогда
		Если ДокПоказанийГПУ <> Неопределено Тогда
			Документы.ркПоказанияГрупповыхСчетчиков.ВыполнитьРаспределениеПоказанийСчетчиков(ДокПоказанийГПУ);
			ДокПоказанийГПУ.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
			ДокПоказанийГПУ.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
	
КонецПроцедуры // ЗаписатьПоказанияГПУ()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(ДатаОграничения) Тогда
		ДатаОграничения = Дата('20160601');
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Выберите каталог";
	Если Диалог.Выбрать() тогда
		КаталогДанных = Диалог.Каталог;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПосчитатьАбонентов(Команда)
	СписокФайлов = НайтиФайлы(КаталогДанных,"Выгр*.dat");
	Сч = 0;
	Для Каждого тФайл Из СписокФайлов Цикл
		Сообщить("Начало чтения из файла: "+тФайл.ПолноеИмя+" "+ТекущаяДатаСеансаНаСервере());		
		ФайлИсточник = тФайл.ПолноеИмя;
		Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ФайлИсточник));	
		Сч = Сч+КоличествоАбонентовВФайле(Адрес);	
		Сообщить(Сч);
		Сообщить("Окончение чтения из файла: "+тФайл.ПолноеИмя+" "+ТекущаяДатаСеансаНаСервере());		
	КонецЦикла;

	Сообщить(Сч);
КонецПроцедуры

&НаСервере	
Функция КоличествоАбонентовВФайле(пАдрес)
	
	ФайлПриемник = ПолучитьИмяВременногоФайла("dat");
	ДанныеХранилища = ПолучитьИзВременногоХранилища(пАдрес);
	ДанныеХранилища.Записать(ФайлПриемник);	
	
	ДомаТЗ = ЗначениеИзФайла(ФайлПриемник);
	Сч = 0;
	Для Каждого стрДомаТЗ ИЗ ДомаТЗ Цикл
		Сч = Сч+стрДомаТЗ.ЛС.Количество();
	КонецЦикла;
	Возврат Сч;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьПоказанияНежилых(Команда)

	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр = "(*.dat)|*.dat"; 	
	Если Не ДиалогВыбораФайла.Выбрать() Тогда
		Возврат;		
	КонецЕсли;
	
	Файл = Новый Файл(ДиалогВыбораФайла.ПолноеИмяФайла);
	ФайлИсточник = Файл.ПолноеИмя;
	Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ФайлИсточник));
	
	ЗагрузитьПоказанияНежилыхНаСервере(Адрес);	
	Сообщить("Загружены показания нежилых: " +ТекущаяДатаСеансаНаСервере());
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПоказанияНежилыхНаСервере(пАдрес)
	КонстантыОбработки = ПолучитьКонстантыОбработки();
	ФайлПриемник = ПолучитьИмяВременногоФайла("dat");
	ДанныеХранилища = ПолучитьИзВременногоХранилища(пАдрес);
	ДанныеХранилища.Записать(ФайлПриемник);
	
	ТЗПоказаний = ПолучитьТЗПоказаний();
	ПоказанияНежилыхТЗ = ЗначениеИзФайла(ФайлПриемник);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.НежилоеПомещениеКод,
		|	ТЗ.НежилоеПомещениеНаименование,
		|	ТЗ.Переворот,
		|	ТЗ.Период,
		|	ТЗ.Показание,
		|	ТЗ.ПриборУчетаЗаводскойНомер,
		|	ТЗ.ПриборУчетаКод,
		|	ТЗ.ПриборУчетаНаименование
		|ПОМЕСТИТЬ втТЗ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТЗ.НежилоеПомещениеКод,
		|	втТЗ.НежилоеПомещениеНаименование,
		|	втТЗ.Переворот,
		|	втТЗ.Период КАК Период,
		|	втТЗ.ПриборУчетаКод,
		|	втТЗ.ПриборУчетаНаименование,
		|	ркЛицевыеСчетаДополнительныеРеквизиты.Ссылка КАК НайденныйАбонент,
		|	ркСчетчикиДополнительныеРеквизиты.Ссылка КАК НайденныйПУ,
		|	ркЛицевыеСчетаДополнительныеРеквизиты.Ссылка.Дом.УК,
		|	втТЗ.Показание,
		|	втТЗ.ПриборУчетаЗаводскойНомер,
		|	ркЛицевыеСчетаДополнительныеРеквизиты.Ссылка.Дом КАК Дом,
		|	ркЛицевыеСчетаДополнительныеРеквизиты.Ссылка.Помещение КАК Помещение
		|ИЗ
		|	втТЗ КАК втТЗ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ркСчетчики.ДополнительныеРеквизиты КАК ркСчетчикиДополнительныеРеквизиты
		|		ПО втТЗ.ПриборУчетаКод = ркСчетчикиДополнительныеРеквизиты.Значение
		|			И (ркСчетчикиДополнительныеРеквизиты.Свойство = &СвойствоИсходныйКод)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ркЛицевыеСчета.ДополнительныеРеквизиты КАК ркЛицевыеСчетаДополнительныеРеквизиты
		|		ПО втТЗ.НежилоеПомещениеКод = ркЛицевыеСчетаДополнительныеРеквизиты.Значение
		|			И (ркЛицевыеСчетаДополнительныеРеквизиты.Свойство = &СвойствоИсходныйКод)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период
		|ИТОГИ ПО
		|	НайденныйПУ";
		
	Запрос.УстановитьПараметр("ТЗ",ПоказанияНежилыхТЗ);
	Запрос.УстановитьПараметр("СвойствоИсходныйКод",КонстантыОбработки.СвойствоИсходныйКод);
	РезультатЗапроса = Запрос.Выполнить();
	
	тВидПоказаний = Справочники.ркВидыПоказанийСчетчиков.Обычные;
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		текСчетчикОбъект = ВыборкаДетальныеЗаписи.НайденныйПУ.ПолучитьОбъект();
		
		
		Выборка = ВыборкаДетальныеЗаписи.Выбрать();
		ПерваяЗапись = Истина;
		Пока Выборка.Следующий() Цикл
			//первое показание в тч счетчика
			Если ПерваяЗапись Тогда
				стрВидыПоказаний = текСчетчикОбъект.ВидыПоказаний.Добавить();
				стрВидыПоказаний.ВидПоказаний = тВидПоказаний;
				стрВидыПоказаний.ЕдиницыУчета = КонстантыОбработки.Квтч;
				стрВидыПоказаний.НачальныеПоказания = Выборка.Показание;
				ПерваяЗапись = Ложь;
				Продолжить;
			КонецЕсли;
			НоваяСтрокаТЗ = ТЗПоказаний.Добавить();
			НоваяСтрокаТЗ.ВидПоказаний = тВидПоказаний;
			НоваяСтрокаТЗ.ДатаНачала = НачалоМесяца(Выборка.Период);
			НоваяСтрокаТЗ.ДатаОкончания = КонецМесяца(Выборка.Период);
			НоваяСтрокаТЗ.Дом = Выборка.Дом;
			//НоваяСтрокаТЗ.Количество = 0;
			НоваяСтрокаТЗ.ЛицевойСчет = Выборка.НайденныйАбонент;
			//НоваяСтрокаТЗ.НачальноеКоличество = 0;
			НоваяСтрокаТЗ.КонечныеПоказания = Выборка.Показание;
			НоваяСтрокаТЗ.ПериодДействия = НачалоМесяца(Выборка.Период);
			НоваяСтрокаТЗ.Помещение = Выборка.Помещение;
			НоваяСтрокаТЗ.Счетчик = Выборка.НайденныйПУ;
			Если ЗначениеЗаполнено(Выборка.НайденныйПУ) Тогда
				НоваяСтрокаТЗ.КодСчетчика = Выборка.НайденныйПУ.Код;
			КонецЕсли;
			НоваяСтрокаТЗ.Сброс = Выборка.Переворот;
			
		КонецЦикла;
		текСчетчикОбъект.ОбменДанными.Загрузка = Истина;
		текСчетчикОбъект.Записать();
	КонецЦикла;
	//остальные в тз, тз отправить в функцию
	
	ДоЗаписатьПоказания(ТЗПоказаний,КонстантыОбработки);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоставщиков(Команда)
	ЗаполнитьПоставщиковНаСервере();
	Сообщить("Заполнены поставщики. Готово!");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоставщиковНаСервере()
	
	КонстантыОбработки = ПолучитьКонстантыОбработки();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	НЕ Контрагенты.ПометкаУдаления
		|	И Контрагенты.Ссылка <> &Поставщик";
	Запрос.УстановитьПараметр("Поставщик",КонстантыОбработки.Поставщик);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Док = Документы.ркИзменениеПоставщиковУслуг.СоздатьДокумент();
	Док.Дата = ДатаОткрытия;
	Док.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Док.Организация = Организация;
	Док.Комментарий = "Загрузка данных"+ТекущаяДата();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = Док.Состав.Добавить();
		НоваяСтрока.ОбъектУчета = ВыборкаДетальныеЗаписи.Ссылка;
		НоваяСтрока.НачалоДействия = ДатаОткрытия;
		НоваяСтрока.ВидРасчета = КонстантыОбработки.ВидРасчетаЭлектроэнергия;
		НоваяСтрока.Получатель = КонстантыОбработки.Поставщик;
		НоваяСтрока.Поставщик = КонстантыОбработки.Поставщик;
	КонецЦикла;
	
	Док.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
	Док.Записать(РежимЗаписиДокумента.Проведение);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКомнаты(Команда)
	ЗаполнитьКомнатыНаСервере();
	Сообщить("Заполнены комнаты");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКомнатыНаСервере()
	КонстантыОбработки = ПолучитьКонстантыОбработки();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ркИзменениеЗначенийСвойствОбъектовСостав.Ссылка
		|ИЗ
		|	Документ.ркИзменениеЗначенийСвойствОбъектов.Состав КАК ркИзменениеЗначенийСвойствОбъектовСостав
		|ГДЕ
		|	ркИзменениеЗначенийСвойствОбъектовСостав.Свойство = &СвойствоКоличествоКомнат
		|	И ркИзменениеЗначенийСвойствОбъектовСостав.Значение = 0
		|	И ркИзменениеЗначенийСвойствОбъектовСостав.Объект ССЫЛКА Справочник.ркЛицевыеСчета";
	
	Запрос.УстановитьПараметр("СвойствоКоличествоКомнат", КонстантыОбработки.КоличествоКомнатНормы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Для Каждого тСтрока Из ДокОбъект.Состав Цикл
			Если тСтрока.Значение = 0 Тогда
				тСтрока.Значение = 1;
			КонецЕсли;
		КонецЦикла;
		ДокОбъект.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ркЛицевыеСчета.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ркЛицевыеСчета КАК ркЛицевыеСчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ркЗначенияПериодическихСвойствОбъектов.СрезПоследних(, Свойство = &СвойствоКоличествоКомнат) КАК ркЗначенияПериодическихСвойствОбъектовСрезПоследних
		|		ПО (ркЗначенияПериодическихСвойствОбъектовСрезПоследних.Объект = ркЛицевыеСчета.Ссылка)
		|ГДЕ
		|	ркЗначенияПериодическихСвойствОбъектовСрезПоследних.Объект ЕСТЬ NULL 
		|	И НЕ ркЛицевыеСчета.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("СвойствоКоличествоКомнат", КонстантыОбработки.КоличествоКомнатНормы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ДокИзм = Неопределено;
	Счетчик = 0;
	ТранзакцияАктивна = Ложь;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Счетчик = 0 И НЕ ТранзакцияАктивна Тогда
			НачатьТранзакцию();
			ТранзакцияАктивна = Истина;
			
			ДокИзм = Документы.ркИзменениеЗначенийСвойствОбъектов.СоздатьДокумент();
			ДокИзм.Дата = ДатаОткрытия;
			ДокИзм.Комментарий = "Загрузка данных "+ТекущаяДата();
			ДокИзм.Организация = Организация;
			ДокИзм.Ответственный = ПараметрыСеанса.ТекущийПользователь;		
		КонецЕсли;
		
		НоваяСтрока = ДокИзм.Состав.Добавить();
		НоваяСтрока.Объект = ВыборкаДетальныеЗаписи.Ссылка;
		НоваяСтрока.Свойство = КонстантыОбработки.КоличествоКомнатНормы;
		НоваяСтрока.Значение = 1;
		НоваяСтрока.НачалоДействия = ДатаОткрытия;
		
		Если Счетчик >= 1000 И ТранзакцияАктивна Тогда
			
			Если ДокИзм.Состав.Количество() > 0 Тогда
				ДокИзм.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
				ДокИзм.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			Счетчик = 0;
			ТранзакцияАктивна = Ложь;
			ЗафиксироватьТранзакцию();
			
		КонецЕсли;

	КонецЦикла;
	Если Счетчик > 0 И ТранзакцияАктивна Тогда
		
		Если ДокИзм.Состав.Количество() > 0 Тогда
			ДокИзм.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
			ДокИзм.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		ЗафиксироватьТранзакцию();
		
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ВыключенныеСчетчики(Команда)
	//ВыключенныеСчетчикиНаСервере();
	ОбработатьСостоянияНаСервере();
	Сообщить("Обработаны состояния счетчиков. Готово!");
КонецПроцедуры

&НаСервере
Процедура ВыключенныеСчетчикиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ркЛицевыеСчета.Ссылка,
		|	МАКСИМУМ(ркСостояниеСчетчиковСрезПоследних.Включен) КАК Включен
		|ПОМЕСТИТЬ вт1
		|ИЗ
		|	РегистрСведений.ркСостояниеСчетчиков.СрезПоследних КАК ркСостояниеСчетчиковСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ркЛицевыеСчета КАК ркЛицевыеСчета
		|		ПО ркСостояниеСчетчиковСрезПоследних.Счетчик.Владелец = ркЛицевыеСчета.Помещение
		|
		|СГРУППИРОВАТЬ ПО
		|	ркЛицевыеСчета.Ссылка
		|
		|ИМЕЮЩИЕ
		|	НЕ МАКСИМУМ(ркСостояниеСчетчиковСрезПоследних.Включен)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт1.Ссылка,
		|	МАКСИМУМ(ркСостояниеСчетчиков.Период) КАК Период
		|ПОМЕСТИТЬ вт2
		|ИЗ
		|	вт1 КАК вт1
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ркСостояниеСчетчиков КАК ркСостояниеСчетчиков
		|		ПО вт1.Ссылка.Помещение = ркСостояниеСчетчиков.Счетчик.Владелец
		|			И (НЕ ркСостояниеСчетчиков.Включен)
		|
		|СГРУППИРОВАТЬ ПО
		|	вт1.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт2.Ссылка КАК ЛС,
		|	ркИзменениеСоставаНачисленийСостав.Ссылка КАК Док,
		|	ркИзменениеСоставаНачисленийСостав.НачалоДействия,
		|	ркИзменениеСоставаНачисленийСостав.НомерСтроки,
		|	ркИзменениеСоставаНачисленийСостав.ВидТарифа
		|ИЗ
		|	вт2 КАК вт2
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ркИзменениеСоставаНачислений.Состав КАК ркИзменениеСоставаНачисленийСостав
		|		ПО вт2.Ссылка = ркИзменениеСоставаНачисленийСостав.ЛицевойСчет
		|			И вт2.Период <= ркИзменениеСоставаНачисленийСостав.НачалоДействия
		|ГДЕ
		|	НЕ ркИзменениеСоставаНачисленийСостав.ВидТарифа.Наименование ПОДОБНО ""%норматив%""
		|ИТОГИ ПО
		|	Док";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДок = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	//ВидТарифа1 = Справочники.ркВидыТарифов.НайтиПоНаименованию("Электроэнергия прибор учета город",Истина);
	//ВидТарифа2 = Справочники.ркВидыТарифов.НайтиПоНаименованию("Электроэнергия прибор учета село",Истина);
	//ВидТарифаЗамена1 = Справочники.ркВидыТарифов.НайтиПоНаименованию("Электроэнергия норматив город",Истина);
	//ВидТарифаЗамена2 = Справочники.ркВидыТарифов.НайтиПоНаименованию("Электроэнергия норматив село",Истина);
	//ДопВидТарифа1 = Справочники.ркВидыТарифов.НайтиПоНаименованию("Электроэнергия норматив город Повышающий коэффициент",Истина);
	//ДопВидТарифа2 = Справочники.ркВидыТарифов.НайтиПоНаименованию("Электроэнергия норматив село Повышающий коэффициент",Истина);
	ЕдиницаРасчетаНорма = Справочники.ркЕдиницыРасчета.НайтиПоНаименованию("Количество проживающих",Истина);
	ДопВидРасчета = Справочники.ркВидыРасчетов.НайтиПоНаименованию("Электроэнергия повышающий коэффициент",Истина);
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ЛС",Новый ОписаниеТипов("СправочникСсылка.ркЛицевыеСчета"));
	ТЗ.Колонки.Добавить("Период",Новый ОписаниеТипов("Дата",Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	
	Пока ВыборкаДок.Следующий() Цикл
		
	    тДок = ВыборкаДок.Док.ПолучитьОбъект();
		ВыборкаДетальныеЗаписи = ВыборкаДок.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтруктураПоиска = Новый Структура("НачалоДействия,ЛицевойСчет,ВидТарифа", ВыборкаДетальныеЗаписи.НачалоДействия,ВыборкаДетальныеЗаписи.ЛС,ВыборкаДетальныеЗаписи.ВидТарифа);
			НайденныеСтроки = тДок.Состав.НайтиСтроки(СтруктураПоиска);
			Для Каждого тСтрока Из НайденныеСтроки Цикл
				
				
				ВидТарифаЗамена = ПолучитьВидТарифаНорматив(ВыборкаДетальныеЗаписи.ВидТарифа.Наименование);
				тСтрока.ВидТарифа = ВидТарифаЗамена;
				тСтрока.ЕдиницаРасчета = ЕдиницаРасчетаНорма;
				
				ДопВидТарифа = ПолучитьВидТарифаПовышающийКоэффициент(ВыборкаДетальныеЗаписи.ВидТарифа.Наименование);
				
				ДопСтрока = тДок.Состав.Добавить();
				ЗаполнитьЗначенияСвойств(ДопСтрока,тСтрока,,"НомерСтроки");
				ДопСтрока.ВидТарифа = ДопВидТарифа;
				ДопСтрока.ВидРасчета = ДопВидРасчета;
				
				НоваяСтрокаТЗ = ТЗ.Добавить();
				НоваяСтрокаТЗ.ЛС = ДопСтрока.ЛицевойСчет;
				НоваяСтрокаТЗ.Период = ДопСтрока.НачалоДействия;
			КонецЦикла;
		КонецЦикла;
		тДок.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
		тДок.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
	//записать допсвойство
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.ЛС,
		|	ТЗ.Период
		|ПОМЕСТИТЬ втТЗ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТЗ.ЛС,
		|	МИНИМУМ(втТЗ.Период) КАК Период
		|ИЗ
		|	втТЗ КАК втТЗ
		|
		|СГРУППИРОВАТЬ ПО
		|	втТЗ.ЛС";
		
	Запрос.УстановитьПараметр("ТЗ",ТЗ);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СвойствоПовышающийКоэффициент = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Повышающий коэффициент",Истина);
	
	ДокИзмСв = Неопределено;
	Счетчик = 0;
	ТранзакцияАктивна = Ложь;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Счетчик = 0 И НЕ ТранзакцияАктивна Тогда
			НачатьТранзакцию();
			ТранзакцияАктивна = Истина;
			
			ДокИзмСв = Документы.ркИзменениеЗначенийСвойствОбъектов.СоздатьДокумент();
			ДокИзмСв.Дата = ДатаОткрытия;
			ДокИзмСв.Комментарий = "Загрузка данных "+ТекущаяДата();
			ДокИзмСв.Организация = Организация;
			ДокИзмСв.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;

		НоваяСтрокаДок = ДокИзмСв.Состав.Добавить();
		НоваяСтрокаДок.Объект = ВыборкаДетальныеЗаписи.ЛС;
		НоваяСтрокаДок.НачалоДействия = ВыборкаДетальныеЗаписи.Период;
		НоваяСтрокаДок.Свойство = СвойствоПовышающийКоэффициент;
		НоваяСтрокаДок.Значение = Истина;
		
		
		Счетчик = Счетчик+1;
		Если Счетчик = 1000 И ТранзакцияАктивна Тогда
			ДокИзмСв.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
			ДокИзмСв.Записать(РежимЗаписиДокумента.Проведение);
			Счетчик = 0;
			ТранзакцияАктивна = Ложь;
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
	КонецЦикла;
	Если ТранзакцияАктивна Тогда
		ДокИзмСв.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
		ДокИзмСв.Записать(РежимЗаписиДокумента.Проведение);
		Счетчик = 0;
		ТранзакцияАктивна = Ложь;
		ЗафиксироватьТранзакцию();
		
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДопНормыИТарифы(Команда)
	ЗаполнитьДопНормыИТарифыНаСервере();
	Сообщить("Обработаны нормы и тарифы. Повышающий коэффициент");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДопНормыИТарифыНаСервере()
	
	КонстантыОбработки = ПолучитьКонстантыОбработки();
	СтатусПроживает = Константы.ркСтатусПроживает.Получить();
	//Виды норм
	

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ркВидыНорм.Ссылка КАК Ссылка,
		|	ркВидыНорм.Родитель КАК Родитель,
		|	ркВидыНорм.Наименование,
		|	ркВидыНорм.Родитель.Наименование КАК РодительНаименование,
		|	ркВидыТарифов.Ссылка КАК ВидТарифа,
		|	ркВидыНорм.НазначениеКоличестваОбъектовРасчета
		|ИЗ
		|	Справочник.ркВидыНорм КАК ркВидыНорм
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ркВидыТарифов КАК ркВидыТарифов
		|		ПО ркВидыНорм.Родитель.Наименование = ркВидыТарифов.Наименование
		|ГДЕ
		|	НЕ ркВидыНорм.ЭтоГруппа
		|	И НЕ ркВидыНорм.ПометкаУдаления
		|	И ркВидыНорм.Наименование ПОДОБНО ""%норматив%""
		|	И НЕ ркВидыНорм.Наименование ПОДОБНО ""%Повышающий коэффициент%""
		|ИТОГИ
		|	МАКСИМУМ(РодительНаименование),
		|	МАКСИМУМ(ВидТарифа)
		|ПО
		|	Родитель";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаРодитель = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Счетчик = 0;
	ТранзакцияАктивна = Ложь;
	
	Пока ВыборкаРодитель.Следующий() Цикл
		
		Если Счетчик = 0 И НЕ ТранзакцияАктивна Тогда
			НачатьТранзакцию();
			ТранзакцияАктивна = Истина;
			ДокИзм = Документы.ркИзменениеНорм.СоздатьДокумент();
			ДокИзм.Дата = ДатаОткрытия;
			ДокИзм.Комментарий = "Загрузка данных "+ТекущаяДата();
			ДокИзм.Организация = Организация;
			ДокИзм.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			
			ДокИзмТарифа = Документы.ркИзменениеТарифов.СоздатьДокумент();
			ДокИзмТарифа.Дата = ДатаОткрытия;
			ДокИзмТарифа.Комментарий = "Загрузка данных "+ТекущаяДата();
			ДокИзмТарифа.Организация = Организация;
			ДокИзмТарифа.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			
			ДокИзмСв = Документы.ркИзменениеЗначенийСвойствОбъектов.СоздатьДокумент();
			ДокИзмСв.Дата = ДатаОткрытия;
			ДокИзмСв.Комментарий = "Загрузка данных "+ТекущаяДата();
			ДокИзмСв.Организация = Организация;
			ДокИзмСв.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		
		//создать группу видов норм, создать вид тарифа
		ИмяНовойГруппы = ВыборкаРодитель.РодительНаименование+" Повышающий коэффициент";
		тГруппаВН = Справочники.ркВидыНорм.НайтиПоНаименованию(ИмяНовойГруппы,Истина);
		Если тГруппаВН.Пустая() ИЛИ НЕ тГруппаВН.ЭтоГруппа Тогда
			НоваяГруппаВН = Справочники.ркВидыНорм.СоздатьГруппу();
			НоваяГруппаВН.Наименование = ИмяНовойГруппы;
			
			//1)
			НоваяСтрокаТЧ = НоваяГруппаВН.СоставСвойствПоискаВидаНормы.Добавить();
			НоваяСтрокаТЧ.СвойствоВидаНормыОт = КонстантыОбработки.КоличествоКомнатНормы;
			НоваяСтрокаТЧ.СвойствоВидаНормыПо = КонстантыОбработки.КоличествоКомнатНормы;
			НоваяСтрокаТЧ.СвойствоЛицевогоСчетаДома = КонстантыОбработки.КоличествоКомнатНормы;
			НоваяСтрокаТЧ.ТипОбъектаПоискаВидаНормы = Перечисления.ркТипыОбъектовПоискаВидовНорм.СправочникЛицевыхСчетов;
			//2)
			НоваяСтрокаТЧ = НоваяГруппаВН.СоставСвойствПоискаВидаНормы.Добавить();
			НоваяСтрокаТЧ.СвойствоВидаНормыОт = КонстантыОбработки.ТипПлитыНормы;
			НоваяСтрокаТЧ.СвойствоВидаНормыПо = КонстантыОбработки.ТипПлитыНормы;
			НоваяСтрокаТЧ.СвойствоЛицевогоСчетаДома = КонстантыОбработки.ТипПлитыНормы;
			НоваяСтрокаТЧ.ТипОбъектаПоискаВидаНормы = Перечисления.ркТипыОбъектовПоискаВидовНорм.СправочникЛицевыхСчетов;
			//3)
			НоваяСтрокаТЧ = НоваяГруппаВН.СоставСвойствПоискаВидаНормы.Добавить();
			НоваяСтрокаТЧ.СвойствоВидаНормыОт = КонстантыОбработки.МКДНормы;
			НоваяСтрокаТЧ.СвойствоВидаНормыПо = КонстантыОбработки.МКДНормы;
			НоваяСтрокаТЧ.СвойствоЛицевогоСчетаДома = КонстантыОбработки.МКДНормы;
			НоваяСтрокаТЧ.ТипОбъектаПоискаВидаНормы = Перечисления.ркТипыОбъектовПоискаВидовНорм.СправочникДомов;

			Если НЕ ЗначениеЗаполнено(НоваяГруппаВН.Код) Тогда
				НоваяГруппаВН.УстановитьНовыйКод();
			КонецЕсли;
			НоваяГруппаВН.ОбменДанными.Загрузка = Истина;
			НоваяГруппаВН.Записать();			
			НоваяГруппаВН.Записать();
			тГруппаВН = НоваяГруппаВН.Ссылка;
		КонецЕсли;
		
		текВидТарифа = Справочники.ркВидыТарифов.НайтиПоНаименованию(ИмяНовойГруппы,Истина);
		Если текВидТарифа.Пустая() Тогда
			НовыйВидТарифа = Справочники.ркВидыТарифов.СоздатьЭлемент();
			НовыйВидТарифа.ВидРасчета = КонстантыОбработки.ВидРасчетаПовышающийКоэффициент;
			НовыйВидТарифа.Наименование = ИмяНовойГруппы;
			НовыйВидТарифа.ЕдиницыУчета = КонстантыОбработки.Квтч;
			НовыйВидТарифа.ВидНормы = тГруппаВН;
			
			Для Каждого тСтрока ИЗ ВыборкаРодитель.ВидТарифа.СоставДоступныхЕдиницРасчета Цикл
				СтрокаТЧ = НовыйВидТарифа.СоставДоступныхЕдиницРасчета.Добавить();
				СтрокаТЧ.ЕдиницаРасчета = тСтрока.ЕдиницаРасчета;
			КонецЦикла;			
			Если НЕ ЗначениеЗаполнено(НовыйВидТарифа.Код) Тогда
				НовыйВидТарифа.УстановитьНовыйКод();
			КонецЕсли;			
			НовыйВидТарифа.ОбменДанными.Загрузка = Истина;
			НовыйВидТарифа.Записать();			
			текВидТарифа = НовыйВидТарифа.Ссылка;
		КонецЕсли;

		
		
		ЗапросЦеныТарифа = Новый Запрос;
		ЗапросЦеныТарифа.Текст = 
		"ВЫБРАТЬ
		|	ркТарифы.Период,
		|	ркТарифы.ВидТарифа,
		|	МАКСИМУМ(ркТарифы.Цена) КАК Цена
		|ИЗ
		|	РегистрСведений.ркТарифы КАК ркТарифы
		|ГДЕ
		|	ркТарифы.ВидТарифа = &ВидТарифа
		|
		|СГРУППИРОВАТЬ ПО
		|	ркТарифы.ВидТарифа,
		|	ркТарифы.Период";
		
		ЗапросЦеныТарифа.УстановитьПараметр("ВидТарифа", ВыборкаРодитель.ВидТарифа);
		
		РезультатЗапросаЦеныТарифа = ЗапросЦеныТарифа.Выполнить();
		
		ВыборкаЦеныТарифа = РезультатЗапросаЦеныТарифа.Выбрать();
		
		Пока ВыборкаЦеныТарифа.Следующий() Цикл
			СтрокаДокТарифа = ДокИзмТарифа.Состав.Добавить();
			СтрокаДокТарифа.ВидТарифа = текВидТарифа;
			СтрокаДокТарифа.НачалоДействия = ВыборкаЦеныТарифа.Период;
			СтрокаДокТарифа.ПериодДействияТарифа = Перечисления.ркПериодыДействияТарифа.Месяц;
			СтрокаДокТарифа.ТипТарифа  = Справочники.ркТипыТарифов.Основной;
			СтрокаДокТарифа.Цена = ВыборкаЦеныТарифа.Цена;
		КонецЦикла;
		
		ВыборкаДетальныеЗаписи = ВыборкаРодитель.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Счетчик = Счетчик + 1;
			
			текНаименование = ВыборкаДетальныеЗаписи.Наименование+" Повышающий коэффициент";
			текВидНормы = Справочники.ркВидыНорм.НайтиПоНаименованию(текНаименование,Истина);
			Если текВидНормы.Пустая() Тогда
				НовыйВидНормы = Справочники.ркВидыНорм.СоздатьЭлемент();
				НовыйВидНормы.Родитель = тГруппаВН;
				НовыйВидНормы.ЕдиницаИзмеренияИсходныхДанных = КонстантыОбработки.Человек;
				НовыйВидНормы.ЕдиницаИзмерения = КонстантыОбработки.Квтч;
				НовыйВидНормы.Наименование = текНаименование;
				НовыйВидНормы.НазначениеКоличестваОбъектовРасчета = ВыборкаДетальныеЗаписи.НазначениеКоличестваОбъектовРасчета;
				СтрокаТЧ = НовыйВидНормы.НазначениеСоставСтатусовОбъектовРасчета.Добавить();
				СтрокаТЧ.СтатусОбъектовРасчета = СтатусПроживает;
				
				Если НЕ ЗначениеЗаполнено(НовыйВидНормы.Код) Тогда
					НовыйВидНормы.УстановитьНовыйКод();
				КонецЕсли;
				НовыйВидНормы.ОбменДанными.Загрузка = Истина;
				НовыйВидНормы.Записать();
				текВидНормы = НовыйВидНормы.Ссылка;
			КонецЕсли;
			
			//добавить вложенный уровень итогов
			//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
			// Данный фрагмент построен конструктором.
			// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
			
			ЗапросЗначенияНорм = Новый Запрос;
			ЗапросЗначенияНорм.Текст = 
			"ВЫБРАТЬ
			|	ркНормы.ВидНормы,
			|	МАКСИМУМ(ркНормы.ЗначениеНормы) КАК ЗначениеНормы,
			|	ркНормы.Период
			|ИЗ
			|	РегистрСведений.ркНормы КАК ркНормы
			|ГДЕ
			|	ркНормы.ВидНормы = &ВидНормы
			|
			|СГРУППИРОВАТЬ ПО
			|	ркНормы.ВидНормы,
			|	ркНормы.Период";
			
			ЗапросЗначенияНорм.УстановитьПараметр("ВидНормы", ВыборкаДетальныеЗаписи.Ссылка);
			
			РезультатЗапросаЗначенияНорм = ЗапросЗначенияНорм.Выполнить();
			
			ВыборкаЗначенияНорм = РезультатЗапросаЗначенияНорм.Выбрать();
			
			Пока ВыборкаЗначенияНорм.Следующий() Цикл
				СтрокаДок = ДокИзм.Состав.Добавить();
				СтрокаДок.НачалоДействия = ВыборкаЗначенияНорм.Период;
				СтрокаДок.ВидНормы = текВидНормы;
				СтрокаДок.ТипНормы = Справочники.ркТипыНорм.Общий;
				тК = 0;
				Если СтрокаДок.НачалоДействия < Дата(2015,07,01) Тогда
					тК = 0.1;
				ИначеЕсли СтрокаДок.НачалоДействия < Дата(2016,01,01) Тогда
					тК = 0.2;
				ИначеЕсли СтрокаДок.НачалоДействия < Дата(2017,01,01) Тогда
					тК = 0.4;
				Иначе 
					тК = 0.5;
				КонецЕсли;
				СтрокаДок.ЗначениеНормы = ВыборкаЗначенияНорм.ЗначениеНормы*тК;
			КонецЦикла;
			
			
			//добавить вложенный уровень итогов?			
			//запрос в цикле
			ЗапросСвойстваНорм = Новый Запрос;
			ЗапросСвойстваНорм.Текст = 
			"ВЫБРАТЬ
			|	ркЗначенияПериодическихСвойствОбъектов.Период,
			|	ркЗначенияПериодическихСвойствОбъектов.Объект,
			|	ркЗначенияПериодическихСвойствОбъектов.Свойство,
			|	МАКСИМУМ(ркЗначенияПериодическихСвойствОбъектов.Значение) КАК Значение
			|ИЗ
			|	РегистрСведений.ркЗначенияПериодическихСвойствОбъектов КАК ркЗначенияПериодическихСвойствОбъектов
			|ГДЕ
			|	ркЗначенияПериодическихСвойствОбъектов.Объект = &ВидНормы
			|
			|СГРУППИРОВАТЬ ПО
			|	ркЗначенияПериодическихСвойствОбъектов.Период,
			|	ркЗначенияПериодическихСвойствОбъектов.Объект,
			|	ркЗначенияПериодическихСвойствОбъектов.Свойство";
			
			ЗапросСвойстваНорм.УстановитьПараметр("ВидНормы", ВыборкаДетальныеЗаписи.Ссылка);
			
			РезультатЗапросаСвойстваНорм = ЗапросСвойстваНорм.Выполнить();
			
			ВыборкаНорм = РезультатЗапросаСвойстваНорм.Выбрать();
			
			Пока ВыборкаНорм.Следующий() Цикл
				СтрокаДок = ДокИзмСв.Состав.Добавить();
				СтрокаДок.Объект = текВидНормы;
				СтрокаДок.Свойство = ВыборкаНорм.Свойство;
				СтрокаДок.НачалоДействия = ВыборкаНорм.Период;
				СтрокаДок.Значение = ВыборкаНорм.Значение;
			КонецЦикла;
			
			
		КонецЦикла;
		Если Счетчик >= 1000 И ТранзакцияАктивна Тогда 
			Если ДокИзм.Состав.Количество() > 0 Тогда
				ДокИзм.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
				ДокИзм.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			Если ДокИзмТарифа.Состав.Количество() > 0 Тогда
				ДокИзмТарифа.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
				ДокИзмТарифа.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			Если ДокИзмСв.Состав.Количество() > 0 Тогда
				ДокИзмСв.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
				ДокИзмСв.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			Счетчик = 0;
			ТранзакцияАктивна = Ложь;
		КонецЕсли;

	КонецЦикла;
	Если ТранзакцияАктивна Тогда 
		Если ДокИзм.Состав.Количество() > 0 Тогда
			ДокИзм.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
			ДокИзм.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		Если ДокИзмТарифа.Состав.Количество() > 0 Тогда
			ДокИзмТарифа.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
			ДокИзмТарифа.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		Если ДокИзмСв.Состав.Количество() > 0 Тогда
			ДокИзмСв.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
			ДокИзмСв.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьСостоянияНаСервере()
	
	ЕдиницаРасчетаНорма = Справочники.ркЕдиницыРасчета.НайтиПоНаименованию("Количество проживающих",Истина);
	ДопВидРасчета = Справочники.ркВидыРасчетов.НайтиПоНаименованию("Электроэнергия повышающий коэффициент",Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ркСостояниеСчетчиков.Период,
		|	ркСостояниеСчетчиков.Включен,
		|	ркЛицевыеСчета.Ссылка КАК Абонент,
		|	НАЧАЛОПЕРИОДА(ркСостояниеСчетчиков.Период, ДЕНЬ) КАК ПериодДень
		|ПОМЕСТИТЬ втСостоянияСчетчиков
		|ИЗ
		|	РегистрСведений.ркСостояниеСчетчиков КАК ркСостояниеСчетчиков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ркЛицевыеСчета КАК ркЛицевыеСчета
		|		ПО ркСостояниеСчетчиков.Счетчик.Владелец = ркЛицевыеСчета.Помещение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(втСостоянияСчетчиков.Период) КАК ПериодМакс,
		|	втСостоянияСчетчиков.Включен,
		|	втСостоянияСчетчиков.Абонент,
		|	втСостоянияСчетчиков.ПериодДень
		|ПОМЕСТИТЬ втМаксПериод
		|ИЗ
		|	втСостоянияСчетчиков КАК втСостоянияСчетчиков
		|
		|СГРУППИРОВАТЬ ПО
		|	втСостоянияСчетчиков.Включен,
		|	втСостоянияСчетчиков.Абонент,
		|	втСостоянияСчетчиков.ПериодДень
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(втСостоянияСчетчиков.Включен) КАК Включен,
		|	втСостоянияСчетчиков.Абонент КАК Абонент,
		|	втСостоянияСчетчиков.ПериодДень КАК ПериодДень
		|ИЗ
		|	втМаксПериод КАК втМаксПериод
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСостоянияСчетчиков КАК втСостоянияСчетчиков
		|		ПО втМаксПериод.ПериодМакс = втСостоянияСчетчиков.Период
		|			И втМаксПериод.Абонент = втСостоянияСчетчиков.Абонент
		|
		|СГРУППИРОВАТЬ ПО
		|	втСостоянияСчетчиков.Абонент,
		|	втСостоянияСчетчиков.ПериодДень
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодДень
		|ИТОГИ ПО
		|	Абонент";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаАбонент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТЗ = Новый ТаблицаЗначений;
	
	ТЗ.Колонки.Добавить("Абонент",Новый ОписаниеТипов("СправочникСсылка.ркЛицевыеСчета"));
	ТЗ.Колонки.Добавить("ПериодДень",Новый ОписаниеТипов("Дата",Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТЗ.Колонки.Добавить("Включен",Новый ОписаниеТипов("Булево"));
	
	Пока ВыборкаАбонент.Следующий() Цикл
			
		ВыборкаДетальныеЗаписи = ВыборкаАбонент.Выбрать();
		
		Первая = Истина;
		ПредыдущийВключен = Ложь;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если Первая Тогда
				//создать инвертированную запись на Дата(1001,1,1)
				НоваяСтрокаТЗ = ТЗ.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТЗ,ВыборкаДетальныеЗаписи);
				НоваяСтрокаТЗ.ПериодДень = Дата(1001,1,1);
				НоваяСтрокаТЗ.Включен = НЕ НоваяСтрокаТЗ.Включен;				
			КонецЕсли;
			Если Первая ИЛИ ВыборкаДетальныеЗаписи.Включен <> ПредыдущийВключен Тогда
				НоваяСтрокаТЗ = ТЗ.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТЗ,ВыборкаДетальныеЗаписи);
			КонецЕсли;
			
			Если Первая Тогда
				Первая = Ложь;
			КонецЕсли;
			ПредыдущийВключен = ВыборкаДетальныеЗаписи.Включен;
		КонецЦикла;
	КонецЦикла;
	
	//Обратно в запрос
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.Абонент,
		|	ТЗ.ПериодДень,
		|	ТЗ.Включен
		|ПОМЕСТИТЬ втТЗ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ркИзменениеСоставаНачисленийСостав.Ссылка,
		|	ркИзменениеСоставаНачисленийСостав.НомерСтроки,
		|	ркИзменениеСоставаНачисленийСостав.НачалоДействия,
		|	ркИзменениеСоставаНачисленийСостав.ЛицевойСчет,
		|	ркИзменениеСоставаНачисленийСостав.ВидРасчета,
		|	ркИзменениеСоставаНачисленийСостав.ВидТарифа,
		|	ркИзменениеСоставаНачисленийСостав.СтатусУчастияВРасчетах,
		|	ркИзменениеСоставаНачисленийСостав.ЕдиницаРасчета,
		|	ркИзменениеСоставаНачисленийСостав.УК
		|ПОМЕСТИТЬ втСоставНачислений
		|ИЗ
		|	Документ.ркИзменениеСоставаНачислений.Состав КАК ркИзменениеСоставаНачисленийСостав
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТЗ КАК втТЗ
		|		ПО ркИзменениеСоставаНачисленийСостав.ЛицевойСчет = втТЗ.Абонент
		|			И (НЕ ркИзменениеСоставаНачисленийСостав.ВидТарифа.Наименование ПОДОБНО ""%норматив%"")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втСоставНачислений.Ссылка,
		|	втСоставНачислений.НомерСтроки,
		|	втСоставНачислений.НачалоДействия,
		|	втСоставНачислений.ЛицевойСчет,
		|	втСоставНачислений.ВидРасчета,
		|	втСоставНачислений.ВидТарифа,
		|	втСоставНачислений.СтатусУчастияВРасчетах,
		|	втСоставНачислений.ЕдиницаРасчета,
		|	втСоставНачислений.УК,
		|	МАКСИМУМ(втТЗ.ПериодДень) КАК ПериодДень
		|ПОМЕСТИТЬ втМаксПериод
		|ИЗ
		|	втСоставНачислений КАК втСоставНачислений
		|		ЛЕВОЕ СОЕДИНЕНИЕ втТЗ КАК втТЗ
		|		ПО втСоставНачислений.ЛицевойСчет = втТЗ.Абонент
		|			И втСоставНачислений.НачалоДействия > втТЗ.ПериодДень
		|
		|СГРУППИРОВАТЬ ПО
		|	втСоставНачислений.Ссылка,
		|	втСоставНачислений.НачалоДействия,
		|	втСоставНачислений.ЛицевойСчет,
		|	втСоставНачислений.УК,
		|	втСоставНачислений.ВидРасчета,
		|	втСоставНачислений.ВидТарифа,
		|	втСоставНачислений.ЕдиницаРасчета,
		|	втСоставНачислений.СтатусУчастияВРасчетах,
		|	втСоставНачислений.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втМаксПериод.Ссылка КАК Док,
		|	втМаксПериод.НомерСтроки,
		|	втМаксПериод.НачалоДействия,
		|	втМаксПериод.ЛицевойСчет,
		|	втМаксПериод.ВидРасчета,
		|	втМаксПериод.ВидТарифа,
		|	втМаксПериод.СтатусУчастияВРасчетах,
		|	втМаксПериод.ЕдиницаРасчета,
		|	втМаксПериод.УК,
		|	втМаксПериод.ПериодДень,
		|	втТЗ.Включен
		|ИЗ
		|	втМаксПериод КАК втМаксПериод
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТЗ КАК втТЗ
		|		ПО втМаксПериод.ЛицевойСчет = втТЗ.Абонент
		|			И втМаксПериод.ПериодДень = втТЗ.ПериодДень
		|ГДЕ
		|	НЕ втТЗ.Включен
		|ИТОГИ ПО
		|	Док";
		
		
	Запрос.УстановитьПараметр("ТЗ",ТЗ);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДок = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДок.Следующий() Цикл
		
	    тДок = ВыборкаДок.Док.ПолучитьОбъект();
		ВыборкаДетальныеЗаписи = ВыборкаДок.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтруктураПоиска = Новый Структура("НачалоДействия,ЛицевойСчет,ВидТарифа", ВыборкаДетальныеЗаписи.НачалоДействия,ВыборкаДетальныеЗаписи.ЛицевойСчет,ВыборкаДетальныеЗаписи.ВидТарифа);
			НайденныеСтроки = тДок.Состав.НайтиСтроки(СтруктураПоиска);
			Для Каждого тСтрока Из НайденныеСтроки Цикл
				
				ИмяВидаТарифаЗамена = СтрЗаменить(ВыборкаДетальныеЗаписи.ВидТарифа.Наименование,"прибор учета","норматив");
				ИмяВидаТарифаЗамена = СтрЗаменить(ИмяВидаТарифаЗамена,"день","");
				ИмяВидаТарифаЗамена = СокрЛП(СтрЗаменить(ИмяВидаТарифаЗамена,"ночь",""));
				
				Если Лев(ИмяВидаТарифаЗамена,СтрДлина("Электроотопление")) = "Электроотопление" Тогда
					ИмяВидаТарифаЗамена = "Электроотопление норматив";
				ИначеЕсли Лев(ИмяВидаТарифаЗамена,СтрДлина("Электроплиты")) = "Электроплиты" Тогда
					ИмяВидаТарифаЗамена = "Электроплиты норматив город";
				КонецЕсли;
				
				ВидТарифаЗамена = Справочники.ркВидыТарифов.НайтиПоНаименованию(ИмяВидаТарифаЗамена);
				тСтрока.ВидТарифа = ВидТарифаЗамена;
				тСтрока.ЕдиницаРасчета = ЕдиницаРасчетаНорма;
				
				ИмяДопВидаТарифа = ИмяВидаТарифаЗамена+" Повышающий коэффициент";
				ДопВидТарифа = Справочники.ркВидыТарифов.НайтиПоНаименованию(ИмяДопВидаТарифа);				
				
				ДопСтрока = тДок.Состав.Добавить();
				ЗаполнитьЗначенияСвойств(ДопСтрока,тСтрока,,"НомерСтроки");
				ДопСтрока.ВидТарифа = ДопВидТарифа;
				ДопСтрока.ВидРасчета = ДопВидРасчета;
				
			КонецЦикла;
		КонецЦикла;
		тДок.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
		тДок.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	//отдельно нужно создать на дату? срез первых на каждую такую дату для получения вида тарифа
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.Абонент,
		|	ТЗ.ПериодДень,
		|	ТЗ.Включен
		|ПОМЕСТИТЬ втТЗ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТЗ.Абонент,
		|	втТЗ.ПериодДень КАК ПериодДень,
		|	втТЗ.Включен,
		|	ркСоставНачисленийСрезПоследних.ВидРасчета,
		|	ркСоставНачисленийСрезПоследних.ВидТарифа,
		|	ркСоставНачисленийСрезПоследних.УК,
		|	ркСоставНачисленийСрезПоследних.ЕдиницаРасчета
		|ПОМЕСТИТЬ втИтог
		|ИЗ
		|	втТЗ КАК втТЗ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ркСоставНачислений.СрезПоследних(, НЕ ВидТарифа.Наименование ПОДОБНО ""%норматив%"") КАК ркСоставНачисленийСрезПоследних
		|		ПО втТЗ.Абонент = ркСоставНачисленийСрезПоследних.ЛицевойСчет
		|
		|СГРУППИРОВАТЬ ПО
		|	втТЗ.Абонент,
		|	втТЗ.ПериодДень,
		|	втТЗ.Включен,
		|	ркСоставНачисленийСрезПоследних.ВидРасчета,
		|	ркСоставНачисленийСрезПоследних.ВидТарифа,
		|	ркСоставНачисленийСрезПоследних.УК,
		|	ркСоставНачисленийСрезПоследних.ЕдиницаРасчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втИтог.Абонент,
		|	втИтог.ПериодДень КАК ПериодДень,
		|	втИтог.Включен,
		|	втИтог.ВидРасчета,
		|	втИтог.ВидТарифа,
		|	втИтог.УК,
		|	втИтог.ЕдиницаРасчета
		|ИЗ
		|	втИтог КАК втИтог
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ркСоставНачислений КАК ркСоставНачислений
		|		ПО втИтог.Абонент = ркСоставНачислений.ЛицевойСчет
		|			И втИтог.ПериодДень = ркСоставНачислений.Период
		|			И втИтог.ВидРасчета = ркСоставНачислений.ВидРасчета
		|ГДЕ
		|	ркСоставНачислений.Период ЕСТЬ NULL 
		|ИТОГИ ПО
		|	ПериодДень";
		
	Запрос.УстановитьПараметр("ТЗ",ТЗ);
	РезультатЗапроса = Запрос.Выполнить();
	
	
	СтатусСнято = Справочники.ркСтатусыУчастияВРасчетах.НайтиПоНаименованию("Снято");
	СтатусРасчет = Справочники.ркСтатусыУчастияВРасчетах.Расчет;
	КонстантыОбработки = ПолучитьКонстантыОбработки();

	
	ВыборкаПериодДень = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПериодДень.Следующий() Цикл
		// Вставить обработку выборки ВыборкаПериодДень
		ДокСоставНачислений = Документы.ркИзменениеСоставаНачислений.СоздатьДокумент();
		ДокСоставНачислений.Дата = ДатаОткрытия;
		ДокСоставНачислений.Организация = Организация;
		ДокСоставНачислений.Комментарий = "Загрузка данных "+ТекущаяДата();
		ДокСоставНачислений.Ответственный = ПараметрыСеанса.ТекущийПользователь;

	
		ВыборкаДетальныеЗаписи = ВыборкаПериодДень.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			//Нужно определить вид тарифа по счетчику и по нормативу.
			
			
			//нужно получать только не норматив.
			
			Если ВыборкаДетальныеЗаписи.Включен Тогда

				//включать вид тарифа по счетчику
				
				НоваяСтрокаСоставНачислений = ДокСоставНачислений.Состав.Добавить();
				НоваяСтрокаСоставНачислений.НачалоДействия = ВыборкаДетальныеЗаписи.ПериодДень;
				НоваяСтрокаСоставНачислений.ЛицевойСчет = ВыборкаДетальныеЗаписи.Абонент;
				НоваяСтрокаСоставНачислений.ВидРасчета = ВыборкаДетальныеЗаписи.ВидРасчета;			
				НоваяСтрокаСоставНачислений.ВидТарифа = ВыборкаДетальныеЗаписи.ВидТарифа;			
				НоваяСтрокаСоставНачислений.СтатусУчастияВРасчетах = СтатусРасчет;
				НоваяСтрокаСоставНачислений.ЕдиницаРасчета = ВыборкаДетальныеЗаписи.ЕдиницаРасчета;
				НоваяСтрокаСоставНачислений.УК = ВыборкаДетальныеЗаписи.УК;
				//нужно выключать вид тарифа с повышающим коэффициентом				
				НоваяСтрокаСоставНачислений = ДокСоставНачислений.Состав.Добавить();
				НоваяСтрокаСоставНачислений.НачалоДействия = ВыборкаДетальныеЗаписи.ПериодДень;
				НоваяСтрокаСоставНачислений.ЛицевойСчет = ВыборкаДетальныеЗаписи.Абонент;
				НоваяСтрокаСоставНачислений.ВидРасчета = КонстантыОбработки.ВидРасчетаПовышающийКоэффициент;
				ВидТарифаПовышающийКоэффициент = ПолучитьВидТарифаПовышающийКоэффициент(ВыборкаДетальныеЗаписи.ВидТарифа.Наименование);
				НоваяСтрокаСоставНачислений.ВидТарифа = ВидТарифаПовышающийКоэффициент;
				НоваяСтрокаСоставНачислений.СтатусУчастияВРасчетах = СтатусСнято;
				НоваяСтрокаСоставНачислений.ЕдиницаРасчета = КонстантыОбработки.ЕдиницаКоличествоПроживающих;
				НоваяСтрокаСоставНачислений.УК = ВыборкаДетальныеЗаписи.УК;
				
				
			Иначе
				//включать вид тарифа с повышающим коэффициентом
				//включать вид тарифа по нормативу
				НоваяСтрокаСоставНачислений = ДокСоставНачислений.Состав.Добавить();
				НоваяСтрокаСоставНачислений.НачалоДействия = ВыборкаДетальныеЗаписи.ПериодДень;
				НоваяСтрокаСоставНачислений.ЛицевойСчет = ВыборкаДетальныеЗаписи.Абонент;
				НоваяСтрокаСоставНачислений.ВидРасчета = ВыборкаДетальныеЗаписи.ВидРасчета;				
				ВидТарифаНорматив = ПолучитьВидТарифаНорматив(ВыборкаДетальныеЗаписи.ВидТарифа.Наименование);				
				НоваяСтрокаСоставНачислений.ВидТарифа = ВидТарифаНорматив;
				НоваяСтрокаСоставНачислений.СтатусУчастияВРасчетах = СтатусРасчет;
				НоваяСтрокаСоставНачислений.ЕдиницаРасчета = КонстантыОбработки.ЕдиницаКоличествоПроживающих;
				НоваяСтрокаСоставНачислений.УК = ВыборкаДетальныеЗаписи.УК;

				НоваяСтрокаСоставНачислений = ДокСоставНачислений.Состав.Добавить();
				НоваяСтрокаСоставНачислений.НачалоДействия = ВыборкаДетальныеЗаписи.ПериодДень;
				НоваяСтрокаСоставНачислений.ЛицевойСчет = ВыборкаДетальныеЗаписи.Абонент;
				НоваяСтрокаСоставНачислений.ВидРасчета = КонстантыОбработки.ВидРасчетаПовышающийКоэффициент;
				ВидТарифаПовышающийКоэффициент = ПолучитьВидТарифаПовышающийКоэффициент(ВыборкаДетальныеЗаписи.ВидТарифа.Наименование);
				НоваяСтрокаСоставНачислений.ВидТарифа = ВидТарифаПовышающийКоэффициент;
				НоваяСтрокаСоставНачислений.СтатусУчастияВРасчетах = СтатусРасчет;
				НоваяСтрокаСоставНачислений.ЕдиницаРасчета = КонстантыОбработки.ЕдиницаКоличествоПроживающих;
				НоваяСтрокаСоставНачислений.УК = ВыборкаДетальныеЗаписи.УК;
				
			КонецЕсли;
			


		КонецЦикла;
		
		Если ДокСоставНачислений.Состав.Количество() > 0 Тогда
			ДокСоставНачислений.Состав.Свернуть("НачалоДействия,ЛицевойСчет,ВидРасчета,ВидТарифа,СтатусУчастияВРасчетах,ЕдиницаРасчета,УК");
			ДокСоставНачислений.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
			ДокСоставНачислений.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;

		
	КонецЦикла;
	
	СвойствоПовышающийКоэффициент = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Повышающий коэффициент",Истина);
	
	ДокИзмСв = Неопределено;
	Счетчик = 0;
	ТранзакцияАктивна = Ложь;
	
	Для Каждого стрТЗ ИЗ ТЗ Цикл
		Если Счетчик = 0 И НЕ ТранзакцияАктивна Тогда
			НачатьТранзакцию();
			ТранзакцияАктивна = Истина;
			
			ДокИзмСв = Документы.ркИзменениеЗначенийСвойствОбъектов.СоздатьДокумент();
			ДокИзмСв.Дата = ДатаОткрытия;
			ДокИзмСв.Комментарий = "Загрузка данных "+ТекущаяДата();
			ДокИзмСв.Организация = Организация;
			ДокИзмСв.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			
		КонецЕсли;

		НоваяСтрокаДок = ДокИзмСв.Состав.Добавить();
		НоваяСтрокаДок.Объект = стрТЗ.Абонент;
		НоваяСтрокаДок.НачалоДействия = стрТЗ.ПериодДень;
		НоваяСтрокаДок.Свойство = СвойствоПовышающийКоэффициент;
		НоваяСтрокаДок.Значение = стрТЗ.Включен;
		
		Счетчик = Счетчик+1;
		Если Счетчик = 1000 И ТранзакцияАктивна Тогда
			ДокИзмСв.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
			ДокИзмСв.Записать(РежимЗаписиДокумента.Проведение);
			
			Счетчик = 0;
			ТранзакцияАктивна = Ложь;
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
	КонецЦикла;
	Если ТранзакцияАктивна Тогда
		ДокИзмСв.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
		ДокИзмСв.Записать(РежимЗаписиДокумента.Проведение);
		
		Счетчик = 0;
		ТранзакцияАктивна = Ложь;
		ЗафиксироватьТранзакцию();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидТарифаНорматив(пИмя)

	ИмяВидаТарифаЗамена = СтрЗаменить(пИмя,"прибор учета","норматив");
	ИмяВидаТарифаЗамена = СтрЗаменить(ИмяВидаТарифаЗамена,"день","");
	ИмяВидаТарифаЗамена = СокрЛП(СтрЗаменить(ИмяВидаТарифаЗамена,"ночь",""));
	
	Если Лев(ИмяВидаТарифаЗамена,СтрДлина("Электроотопление")) = "Электроотопление" Тогда
		ИмяВидаТарифаЗамена = "Электроотопление норматив";
	ИначеЕсли Лев(ИмяВидаТарифаЗамена,СтрДлина("Электроплиты")) = "Электроплиты" Тогда
		ИмяВидаТарифаЗамена = "Электроплиты норматив город";
	КонецЕсли;
	
	ВидТарифаЗамена = Справочники.ркВидыТарифов.НайтиПоНаименованию(ИмяВидаТарифаЗамена);
	Возврат ВидТарифаЗамена;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВидТарифаПовышающийКоэффициент(пИмя)

	ИмяВидаТарифаЗамена = СтрЗаменить(пИмя,"прибор учета","норматив");
	ИмяВидаТарифаЗамена = СтрЗаменить(ИмяВидаТарифаЗамена,"день","");
	ИмяВидаТарифаЗамена = СокрЛП(СтрЗаменить(ИмяВидаТарифаЗамена,"ночь",""));
	
	Если Лев(ИмяВидаТарифаЗамена,СтрДлина("Электроотопление")) = "Электроотопление" Тогда
		ИмяВидаТарифаЗамена = "Электроотопление норматив";
	ИначеЕсли Лев(ИмяВидаТарифаЗамена,СтрДлина("Электроплиты")) = "Электроплиты" Тогда
		ИмяВидаТарифаЗамена = "Электроплиты норматив город";
	КонецЕсли;
	ИмяТарифаЗамена = ИмяВидаТарифаЗамена + " Повышающий коэффициент";
	тВидТарифа = Справочники.ркВидыТарифов.НайтиПоНаименованию(ИмяТарифаЗамена);
	Возврат тВидТарифа;

КонецФункции

&НаКлиенте
Процедура ЗаполнитьГруппыОДПУ(Команда)
	ЗаполнитьГруппыОДПУНаСервере();
	Сообщить("Заполнены Группы ОДПУ");
	ЗаполнитьГруппыОДПУСчетчиков();
	Сообщить("Заполнены Группы ОДПУ Счетчиков");
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьГруппыОДПУСчетчиков()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыОДПУдляРасчетаОДН.Ссылка КАК ГруппаОДПУ,
		|	ГруппыОДПУдляРасчетаОДН.Владелец КАК Дом,
		|	ркСчетчики.Ссылка КАК Счетчик
		|ИЗ
		|	Справочник.ркСчетчики КАК ркСчетчики
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыОДПУдляРасчетаОДН КАК ГруппыОДПУдляРасчетаОДН
		|		ПО ркСчетчики.Владелец = ГруппыОДПУдляРасчетаОДН.Владелец
		|			И ркСчетчики.ГруппаОДПУ <> ГруппыОДПУдляРасчетаОДН.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		тСчетчикОбъект = ВыборкаДетальныеЗаписи.Счетчик.ПолучитьОбъект();
		тСчетчикОбъект.ГруппаОДПУ = ВыборкаДетальныеЗаписи.ГруппаОДПУ;
		тСчетчикОбъект.ОбменДанными.Загрузка = Истина;
		тСчетчикОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГруппыОДПУНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ркДома.Ссылка как Дом
	               |ИЗ
	               |	Справочник.ркДома КАК ркДома
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыОДПУдляРасчетаОДН КАК ГруппыОДПУдляРасчетаОДН
	               |		ПО ГруппыОДПУдляРасчетаОДН.Владелец = ркДома.Ссылка
	               |ГДЕ
	               |	ГруппыОДПУдляРасчетаОДН.Ссылка ЕСТЬ NULL ";
				   
				   
	ЗапросСостав = Новый Запрос;
	ЗапросСостав.Текст = "ВЫБРАТЬ
	                     |	ркСчетчики.Ссылка КАК ГруппаОДПУ,
	                     |	ркСчетчики.Владелец КАК Дом,
	                     |	ркПомещения.Ссылка КАК Помещение,
	                     |	НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ркЗначенияПериодическихСвойствОбъектовСрезПоследних.Значение КАК БУЛЕВО), ЛОЖЬ) КАК Объем
	                     |ИЗ
	                     |	Справочник.ГруппыОДПУдляРасчетаОДН КАК ркСчетчики
	                     |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ркПомещения КАК ркПомещения
	                     |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ркЛицевыеСчета.ДополнительныеРеквизиты КАК ркЗначенияПериодическихСвойствОбъектовСрезПоследних
	                     |			ПО ркПомещения.Ссылка = ркЗначенияПериодическихСвойствОбъектовСрезПоследних.Ссылка.Помещение
	                     |				И (ркЗначенияПериодическихСвойствОбъектовСрезПоследних.Свойство = &Свойство)
	                     |		ПО ркСчетчики.Владелец = ркПомещения.Владелец
	                     |			И (НЕ ркПомещения.ПометкаУдаления)
	                     |ГДЕ
	                     |	НЕ ркСчетчики.ПометкаУдаления
	                     |	И ркСчетчики.Ссылка = &Ссылка";
	ЗапросСостав.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Отдельный ввод (Лицевой счет)",Истина));
	ВыборкаДома = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДома.Следующий() Цикл
	
		ГруппаОДПУ = Справочники.ГруппыОДПУдляРасчетаОДН.СоздатьЭлемент();
		ГруппаОДПУ.Наименование = Прав(Строка(ВыборкаДома.Дом), 25);
		ГруппаОДПУ.Владелец = ВыборкаДома.Дом;
		ГруппаОДПУ.Записать();
		
		ДокОбъект = документы.ркИзменениеСоставаОДПУ.СоздатьДокумент();
		ДокОбъект.Дата = ТекущаяДата();
		ДокОбъект.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
		ЗапросСостав.УстановитьПараметр("Ссылка", ГруппаОДПУ.Ссылка);
		ВыборкаСостав = ЗапросСостав.Выполнить().Выбрать();
		Пока ВыборкаСостав.Следующий() Цикл
		
			стр = ДокОбъект.Состав.Добавить();
			стр.НачалоДействия = ДатаОткрытия;
			стр.ГруппаОДПУ = ВыборкаСостав.ГруппаОДПУ;
			стр.Помещение = ВыборкаСостав.Помещение;
			стр.Объем = ВыборкаСостав.Объем;
			стр.Площадь = Истина;
		
		КонецЦикла; 
		ДокОбъект.Записать();
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;
КонецПроцедуры
