
&НаКлиенте
Процедура ВыполнитьЗаполнение(Команда)
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	ВыполнитьЗаполнениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗаполнениеНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	рцСоответствиеДомУКСрезПоследних.Дом,
		|	рцСоответствиеДомУКСрезПоследних.УК
		|ИЗ
		|	РегистрСведений.рцСоответствиеДомУК.СрезПоследних(&ДатаСреза, ) КАК рцСоответствиеДомУКСрезПоследних
		|ГДЕ
		|	рцСоответствиеДомУКСрезПоследних.УК <> рцСоответствиеДомУКСрезПоследних.Дом.УК";
	
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Счетчик = 0;
	ТранзакцияАктивна = Ложь;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Счетчик = 0 И НЕ ТранзакцияАктивна Тогда
			
			НачатьТранзакцию();
			ТранзакцияАктивна = Истина;
			
		КонецЕсли;
		
		ДомОбъект = ВыборкаДетальныеЗаписи.Дом.ПолучитьОбъект();
		ДомОбъект.УК = ВыборкаДетальныеЗаписи.УК;
		ДомОбъект.ОбменДанными.Загрузка = Истина;
		ДомОбъект.Записать();
		Счетчик = Счетчик + 1;
		
		Если ТранзакцияАктивна И Счетчик>=1000 Тогда
			Счетчик = 0;
			ТранзакцияАктивна = Ложь;
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
	КонецЦикла;
	Если ТранзакцияАктивна Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры
