
&НаСервере
Процедура СоздатьПоказанияНаСервере()
	СтруктураДокументов = Новый Структура;
	СтруктураДокументовНепредоставлений = Новый Структура;
	Запрос = Новый Запрос;
	ЗапросСреднее = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ркПоказанияСчетчиков.Счетчик КАК Счетчик,
	               |	ркПоказанияСчетчиков.ЛицевойСчет КАК ЛицевойСчет,
	               |	МАКСИМУМ(ркПоказанияСчетчиков.Период) КАК Период
	               |ПОМЕСТИТЬ втДатаПоказания
	               |ИЗ
	               |	РегистрНакопления.ркПоказанияСчетчиков КАК ркПоказанияСчетчиков
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ркСостояниеСчетчиков.СрезПоследних(&Месяц, ) КАК ркСостояниеСчетчиковСрезПоследних
	               |		ПО ркПоказанияСчетчиков.Счетчик = ркСостояниеСчетчиковСрезПоследних.Счетчик
	               |ГДЕ
	               |	ркПоказанияСчетчиков.Период < &Месяц
	               |	И ркСостояниеСчетчиковСрезПоследних.Включен
	               |	И (ркПоказанияСчетчиков.ЛицевойСчет = &ЛицевойСчет
	               |			ИЛИ &ЛицевойСчет = ЗНАЧЕНИЕ(Справочник.рклицевыесчета.пустаяссылка))
	               |	И ркСостояниеСчетчиковСрезПоследних.Счетчик.Владелец ССЫЛКА Справочник.ркПомещения
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ркПоказанияСчетчиков.Счетчик,
	               |	ркПоказанияСчетчиков.ЛицевойСчет
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.Счетчик,
	               |	ВложенныйЗапрос.ЛицевойСчет,
	               |	ВложенныйЗапрос.Период,
	               |	МАКСИМУМ(ркПоказанияСчетчиков.НачальноеКоличество + ркПоказанияСчетчиков.Количество) КАК КонечныеПоследние
	               |ИЗ
	               |	втДатаПоказания КАК ВложенныйЗапрос
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ркПоказанияСчетчиков КАК ркПоказанияСчетчиков
	               |		ПО ВложенныйЗапрос.Счетчик = ркПоказанияСчетчиков.Счетчик
	               |			И ВложенныйЗапрос.ЛицевойСчет = ркПоказанияСчетчиков.ЛицевойСчет
	               |			И ВложенныйЗапрос.Период = ркПоказанияСчетчиков.Период
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Счетчик,
	               |	ВложенныйЗапрос.ЛицевойСчет,
	               |	ВложенныйЗапрос.Период
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ркСостояниеСчетчиковСрезПоследних.Счетчик,
	               |	ркЛицевыеСчета.Ссылка,
	               |	ДАТАВРЕМЯ(2014, 10, 1),
	               |	рцПоказанияСчетчиковСрезПоследних.НачальныеПоказания + рцПоказанияСчетчиковСрезПоследних.Количество
	               |ИЗ
	               |	РегистрСведений.ркСостояниеСчетчиков.СрезПоследних(&Месяц, ) КАК ркСостояниеСчетчиковСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втДатаПоказания КАК втДатаПоказания
	               |		ПО ркСостояниеСчетчиковСрезПоследних.Счетчик = втДатаПоказания.Счетчик
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.рцПоказанияСчетчиков.СрезПоследних(&Месяц, ) КАК рцПоказанияСчетчиковСрезПоследних
	               |		ПО ркСостояниеСчетчиковСрезПоследних.Счетчик = рцПоказанияСчетчиковСрезПоследних.Счетчик
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ркЛицевыеСчета КАК ркЛицевыеСчета
	               |		ПО ркСостояниеСчетчиковСрезПоследних.Счетчик.Владелец = ркЛицевыеСчета.Помещение
	               |ГДЕ
	               |	втДатаПоказания.Счетчик ЕСТЬ NULL 
	               |	И ркСостояниеСчетчиковСрезПоследних.Включен
	               |	И (ркЛицевыеСчета.Ссылка = &ЛицевойСчет
	               |			ИЛИ &ЛицевойСчет = ЗНАЧЕНИЕ(Справочник.рклицевыесчета.пустаяссылка))";
	Запрос.УстановитьПараметр("Месяц", Месяц);		
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛС);
	ТЗ = Запрос.Выполнить().Выгрузить();
	КопияТЗ = ТЗ.Скопировать();
	КопияТЗ.Свернуть("Период");
	КопияТЗ.Сортировать("Период");
	МинимальныйМесяц = КопияТЗ[0].Период;
	Пока МинимальныйМесяц < Месяц Цикл
	
		//Док = Документы.ркПоказанияСчетчиков.СоздатьДокумент();
		//Док.Дата = МинимальныйМесяц;
		//Док.ПоказанияГрупповыхСчетчиков = Ложь;
		//Док.Комментарий = "Создано эмуляцией среднего за " + Док.Дата;
		//Док.Организация = Справочники.Организации.НайтиПоНаименованию("АЭСК");
		//Док.ТипОперации = Перечисления.ркТипыОперацийПоказанийСчетчиков.ПоказанияЗаПериод;
		//Док.ИсточникПоказаний = Перечисления.рцИсточникПоказанийИПУ.ПоказанияНепредоставлены;	
		//Док.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
		//СтруктураДокументов.Вставить("_"+Формат(МинимальныйМесяц, "ДФ=MMyyyy"), Док);
		//МинимальныйМесяц = ДобавитьМесяц(МинимальныйМесяц, 1);
		
		Док = Документы.ркНачисленияПриНепредоставленииПоказанийСчетчиков.СоздатьДокумент();
		Док.Дата = КонецМесяца(МинимальныйМесяц);
		Док.Комментарий = "Создано эмуляцией среднего за " + Док.Дата;
		Док.Организация = Справочники.Организации.НайтиПоНаименованию("АЭСК");
		Док.ТипОперации = Перечисления.ркТипыОперацийПоказанийСчетчиков.ПоказанияЗаПериод;
		Док.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
		СтруктураДокументовНепредоставлений.Вставить("_"+Формат(МинимальныйМесяц, "ДФ=MMyyyy"), Док);
		
		МинимальныйМесяц = ДобавитьМесяц(МинимальныйМесяц, 1);
	КонецЦикла;
	КЧ = Новый КвалификаторыЧисла(10,3);
	МассивКв = Новый Массив;
	МассивКв.Добавить(Тип("Число"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(МассивКв,,,КЧ);
	ТЗ.Колонки.Добавить("ОборотНачислений",ОписаниеТиповЧ);
	
	
	Для каждого СтрокаТЗ из ТЗ Цикл
		//МесяцСреднего = ДобавитьМесяц(СтрокаТЗ.Период, 1); 	//Если последний меясц показаний февраль, среднее начинаем с марта
		МесяцСреднего = СтрокаТЗ.Период; //Среднее может быть и в том месяце, в котором было начислено по счетчику
		НачальныеПоказания = СтрокаТЗ.КонечныеПоследние;
		Пока МесяцСреднего < Месяц Цикл 			//начисляем среднее по апрель включительно
			ЗапросСреднее.Текст = "ВЫБРАТЬ
			                      |	ЕСТЬNULL(СУММА(ркНачисленияОбороты.КоличествоВПределахНормыОборот + ркНачисленияОбороты.КоличествоСверхНормыОборот), 0) КАК КоличествоНачислено
			                      |ИЗ
			                      |	РегистрНакопления.ркНачисления.Обороты(
			                      |			&ДатаНач,
			                      |			&ДатаКон,
			                      |			Месяц,
			                      |			ЛицевойСчет = &ЛицевойСчет
			                      |				И НЕ НаОбщедомовыеНужды
			                      |				И ВидПерерасчета = &ВидПерерасчета) КАК ркНачисленияОбороты";
			ЗапросСреднее.УстановитьПараметр("ЛицевойСчет", СтрокаТЗ.ЛицевойСчет);
			ЗапросСреднее.УстановитьПараметр("ВидПерерасчета", ВидПерерасчетаСреднее);
			ЗапросСреднее.УстановитьПараметр("ДатаНач", МесяцСреднего);
			ЗапросСреднее.УстановитьПараметр("ДатаКон", КонецМесяца(МесяцСреднего));
			ВыборкаСреднее = ЗапросСреднее.Выполнить().Выбрать();
			ВыборкаСреднее.Следующий();
			Если ВыборкаСреднее.КоличествоНачислено = 0 тогда МесяцСреднего = ДобавитьМесяц(МесяцСреднего, 1); Продолжить; КонецЕсли;
			//Док = МассивСреднего[3 - Окр((Месяц - МесяцСреднего) / 3600 / 24 / 30)];   //порядковый номер документа среднего. = 0, 1 или 2    
			//Док = СтруктураДокументов["_"+Формат(МесяцСреднего, "ДФ=MMyyyy")];
			//если 1=2 тогда док = Документы.ркПоказанияСчетчиков.СоздатьДокумент() КонецЕсли;
			//Стр = Док.Состав.Добавить();
			//Стр.Дом = СтрокаТЗ.ЛицевойСчет.Дом;
			//Стр.Помещение = СтрокаТЗ.ЛицевойСчет.Помещение;
			//Стр.ЛицевойСчет = СтрокаТЗ.ЛицевойСчет;
			//Стр.Счетчик = СтрокаТЗ.Счетчик;
			//Стр.ВидПоказаний = Справочники.ркВидыПоказанийСчетчиков.Обычные;
			//Стр.ВидРасчета = Справочники.ркВидыРасчетов.НайтиПоНаименованию("Электроэнергия");
			//Стр.НачальныеПоказания = НачальныеПоказания;
			//Стр.КонечныеПоказания = ВыборкаСреднее.КоличествоНачислено + НачальныеПоказания;
			//Стр.Количество = ВыборкаСреднее.КоличествоНачислено;
			//Стр.ПоНормативу = Ложь;
			//Стр.ДатаНачалаПоказаний = МесяцСреднего;
			//Стр.ДатаОкончанияПоказаний = КонецМесяца(МесяцСреднего);
			//НачальныеПоказания = НачальныеПоказания + ВыборкаСреднее.КоличествоНачислено;
			//СтрокаТЗ.ОборотНачислений = СтрокаТЗ.ОборотНачислений + ВыборкаСреднее.КоличествоНачислено;
			//Док.Записать(РежимЗаписиДокумента.Запись);
			
			
			//////////////////////////////////////////////////////////////////////////////////////////////////
			ДокНепредоставление = СтруктураДокументовНепредоставлений["_"+Формат(МесяцСреднего, "ДФ=MMyyyy")];
			Если 1=2 Тогда ДокНепредоставление = Документы.ркНачисленияПриНепредоставленииПоказанийСчетчиков.СоздатьДокумент() КонецЕсли;
			Стр = ДокНепредоставление.Состав.Добавить();
			Стр.ВидПоказаний = Справочники.ркВидыПоказанийСчетчиков.Обычные;
			Стр.ВидРасчета = Справочники.ркВидыРасчетов.НайтиПоНаименованию("Электроэнергия");
			Стр.ДатаНачалаПоказаний = МесяцСреднего;
			Стр.ДатаОкончанияПоказаний = КонецМесяца(МесяцСреднего);
			Стр.ЕдиницаИзмерения = ЕдиницаИзмерения;
			Стр.Количество = ВыборкаСреднее.КоличествоНачислено;
			Стр.ЛицевойСчет = СтрокаТЗ.ЛицевойСчет;
			Стр.МетодРасчета = Перечисления.рцМетодыРасчетаПоказанийИПУ.ПоСреднемесячномуПотреблению;
			Стр.Счетчик = СтрокаТЗ.Счетчик;
			ДокНепредоставление.Записать(РежимЗаписиДокумента.Запись);
			/////////////////////////////////////////////////////////////////////////////////////////////////
			
			
			МесяцСреднего = ДобавитьМесяц(МесяцСреднего, 1);
		КонецЦикла;
	КонецЦикла;
	//Для каждого Док из СтруктураДокументов Цикл
	//	Документы.ркПоказанияСчетчиков.ВыполнитьРаспределениеПоказанийСчетчиков(Док.Значение);
	//	Док.Значение.Записать(РежимЗаписиДокумента.Проведение);
	//КонецЦикла;
	
	Для каждого Док из СтруктураДокументовНепредоставлений Цикл
		Док.Значение.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;

	//Документы.ркПоказанияСчетчиков.ВыполнитьРаспределениеПоказанийСчетчиков(ДокМинусТри);
	//Документы.ркПоказанияСчетчиков.ВыполнитьРаспределениеПоказанийСчетчиков(ДокМинусДва);
	//Документы.ркПоказанияСчетчиков.ВыполнитьРаспределениеПоказанийСчетчиков(ДокМинусОдин);
	//ДокМинусТри.Записать(РежимЗаписиДокумента.Проведение);
	//ДокМинусДва.Записать(РежимЗаписиДокумента.Проведение);
	//ДокМинусОдин.Записать(РежимЗаписиДокумента.Проведение);
	
	/////////////////////////////
	//
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ТЗ.ЛицевойСчет,
	//               |	ТЗ.Счетчик,
	//               |	ТЗ.Период,
	//               |	ТЗ.КонечныеПоследние,
	//               |	ТЗ.ОборотНачислений
	//               |ПОМЕСТИТЬ втТЗ
	//               |ИЗ
	//               |	&ТЗ КАК ТЗ
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	втТЗ.ЛицевойСчет,
	//               |	втТЗ.Счетчик,
	//               |	втТЗ.Период,
	//               |	втТЗ.КонечныеПоследние,
	//               |	втТЗ.ОборотНачислений,
	//               |	СУММА(ркПоказанияСчетчиков.Количество) КАК Количество,
	//               |	МИНИМУМ(ркПоказанияСчетчиков.НачальноеКоличество) КАК НачальноеКоличество
	//               |ИЗ
	//               |	втТЗ КАК втТЗ
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ркПоказанияСчетчиков КАК ркПоказанияСчетчиков
	//               |		ПО втТЗ.ЛицевойСчет = ркПоказанияСчетчиков.ЛицевойСчет
	//               |			И втТЗ.Счетчик = ркПоказанияСчетчиков.Счетчик
	//               |			И (ркПоказанияСчетчиков.ДатаНачала = &Месяц)              
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	втТЗ.ЛицевойСчет,
	//               |	втТЗ.Счетчик,
	//               |	втТЗ.Период,
	//               |	втТЗ.КонечныеПоследние,
	//               |	втТЗ.ОборотНачислений
	//               |
	//               |ИМЕЮЩИЕ
	//               |	СУММА(ркПоказанияСчетчиков.Количество) > втТЗ.ОборотНачислений";
	//Запрос.УстановитьПараметр("ТЗ", ТЗ);
	//Запрос.УстановитьПараметр("Месяц", Месяц);
	//Выборка = Запрос.Выполнить().Выбрать();
	/////Найти документ показаний за месяц = Месяц
	//СтарыйДокПоказаний = РедактируемыйДокумент.ПолучитьОбъект();
	//ДокПоказаний = СтарыйДокПоказаний.Скопировать();
	//ДокПоказаний.Дата = Месяц + 3600 * 24;						
	//ДокПоказаний.ПоказанияГрупповыхСчетчиков = Ложь;
	//ДокПоказаний.Комментарий = "Создано модернизацией показаний после среднего " + ТекущаяДата();
	//ДокПоказаний.Организация = Справочники.Организации.НайтиПоНаименованию("АЭСК");
	//ДокПоказаний.ТипОперации = Перечисления.ркТипыОперацийПоказанийСчетчиков.ПоказанияЗаПериод;
	//ДокПоказаний.ИсточникПоказаний = Перечисления.рцИсточникПоказанийИПУ.ИсторияПоказаний;	
	//ДокПоказаний.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);

	//
	//Пока Выборка.Следующий() Цикл
	//	МассивСтрок = ДокПоказаний.Состав.НайтиСтроки(Новый Структура("ЛицевойСчет, Счетчик", Выборка.ЛицевойСчет, Выборка.Счетчик));
	//	Для каждого УдаляемаяСтрока из МассивСтрок Цикл ДокПоказаний.Состав.Удалить(УдаляемаяСтрока) КонецЦикла;
	//
	//	Стр = ДокПоказаний.Состав.Добавить();
	//	Стр.Дом = Выборка.ЛицевойСчет.Дом;
	//	Стр.Помещение = Выборка.ЛицевойСчет.Помещение;
	//	Стр.ЛицевойСчет = Выборка.ЛицевойСчет;
	//	Стр.Счетчик = Выборка.Счетчик;
	//	Стр.ВидПоказаний = Справочники.ркВидыПоказанийСчетчиков.Обычные;
	//	Стр.ВидРасчета = Справочники.ркВидыРасчетов.НайтиПоНаименованию("Электроэнергия");
	//	Стр.НачальныеПоказания = Выборка.НачальноеКоличество - Выборка.ОборотНачислений;
	//	Стр.КонечныеПоказания = Выборка.НачальноеКоличество + Выборка.Количество;
	//	Стр.Количество = Выборка.Количество - Выборка.ОборотНачислений;
	//	Стр.ПоНормативу = Ложь;
	//	Стр.ДатаНачалаПоказаний = Месяц;			
	//	Стр.ДатаОкончанияПоказаний = КонецМесяца(Месяц);		
	//КонецЦикла;
	//Документы.ркПоказанияСчетчиков.ВыполнитьРаспределениеПоказанийСчетчиков(ДокПоказаний);	
	//ДокПоказаний.Записать(РежимЗаписиДокумента.Проведение);
	//СтарыйДокПоказаний.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
	//СтарыйДокПоказаний.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	//
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ТЗ.ЛицевойСчет,
	//               |	ТЗ.Счетчик,
	//               |	ТЗ.Период,
	//               |	ТЗ.КонечныеПоследние,
	//               |	ТЗ.ОборотНачислений
	//               |ПОМЕСТИТЬ втТЗ
	//               |ИЗ
	//               |	&ТЗ КАК ТЗ
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	втТЗ.ЛицевойСчет.Код КАК НомерЛС,
	//               |	втТЗ.ЛицевойСчет КАК ЛС,
	//               |	втТЗ.Счетчик,
	//               |	втТЗ.Период,
	//               |	втТЗ.КонечныеПоследние,
	//               |	втТЗ.ОборотНачислений КАК Среднее,
	//               |	СУММА(ркПоказанияСчетчиков.Количество) КАК МайскоеПоказание
	//               |ИЗ
	//               |	втТЗ КАК втТЗ
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ркПоказанияСчетчиков КАК ркПоказанияСчетчиков
	//               |		ПО втТЗ.ЛицевойСчет = ркПоказанияСчетчиков.ЛицевойСчет
	//               |			И втТЗ.Счетчик = ркПоказанияСчетчиков.Счетчик
	//               |			И (ркПоказанияСчетчиков.ДатаНачала = &Месяц)
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	втТЗ.ЛицевойСчет,
	//               |	втТЗ.Счетчик,
	//               |	втТЗ.Период,
	//               |	втТЗ.КонечныеПоследние,
	//               |	втТЗ.ОборотНачислений,
	//               |	втТЗ.ЛицевойСчет
	//               |
	//               |ИМЕЮЩИЕ
	//               |	СУММА(ркПоказанияСчетчиков.Количество) < втТЗ.ОборотНачислений";
	//Запрос.УстановитьПараметр("ТЗ", ТЗ);
	//Запрос.УстановитьПараметр("Месяц", Месяц);
	//Выборка = Запрос.Выполнить().Выбрать();
	//СписокНеудачных.Очистить();
	//Пока Выборка.Следующий() Цикл
	//	СтрокаТЗ = СписокНеудачных.Добавить();
	//	ЗаполнитьЗначенияСвойств(СтрокаТЗ, Выборка);
	//	СтрокаТЗ.Разница = Выборка.МайскоеПоказание - Выборка.Среднее;
	//КонецЦикла;
	//
	
	
	//			   //Апрельские			   
	//Результат = Запрос.Выполнить();
	//Выборка = Результат.Выбрать();
	//
	///////////////////////////////////////////////////////////////////////////////////////
	//
	//ДокПоказаний = Документы.ркПоказанияСчетчиков.СоздатьДокумент();
	//ДокПоказаний.Дата = Дата(2016,4,2);
	//ДокПоказаний.ПоказанияГрупповыхСчетчиков = Ложь;
	//ДокПоказаний.Комментарий = "Создано эмуляцией среднего " + ТекущаяДата();
	//ДокПоказаний.Организация = Справочники.Организации.НайтиПоНаименованию("АЭСК");
	//ДокПоказаний.ТипОперации = Перечисления.ркТипыОперацийПоказанийСчетчиков.ПоказанияЗаПериод;
	//ДокПоказаний.ИсточникПоказаний = Перечисления.рцИсточникПоказанийИПУ.ПоказанияНепредоставлены;	
	//Пока Выборка.Следующий() Цикл
	//	Стр = ДокПоказаний.Состав.Добавить();
	//	Стр.Дом = Выборка.ЛицевойСчет.Дом;
	//	Стр.Помещение = Выборка.ЛицевойСчет.Помещение;
	//	Стр.ЛицевойСчет = Выборка.ЛицевойСчет;
	//	Стр.Счетчик = Выборка.Счетчик;
	//	Стр.ВидПоказаний = Справочники.ркВидыПоказанийСчетчиков.Обычные;
	//	Стр.ВидРасчета = Справочники.ркВидыРасчетов.НайтиПоНаименованию("Электроэнергия");
	//	Стр.НачальныеПоказания = Выборка.НачальныеАпрель;
	//	Стр.КонечныеПоказания = Выборка.КонечныеАпрель;
	//	Стр.Количество = Выборка.РасходАпрель;
	//	Стр.ПоНормативу = Ложь;
	//	Стр.ДатаНачалаПоказаний = Дата(2016,4,1);
	//	Стр.ДатаОкончанияПоказаний = Дата(2016,4,30);
	//КонецЦикла;
	//Документы.ркПоказанияСчетчиков.ВыполнитьРаспределениеПоказанийСчетчиков(ДокПоказаний);
	//ДокПоказаний.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
	//ДокПоказаний.Записать(РежимЗаписиДокумента.Проведение);
	//
	///////////////////////////////////////////////////////////////////////////////////////
	//
	//	
	//////Майские
	////Выборка = Запрос.Выполнить().Выбрать();
	////ДокПоказаний = Документы.ркПоказанияСчетчиков.СоздатьДокумент();
	////ДокПоказаний.Дата = ТекущаяДата();
	////ДокПоказаний.ПоказанияГрупповыхСчетчиков = Ложь;
	////ДокПоказаний.Комментарий = "Создано модернизацией существующих после среднего " + ТекущаяДата();
	////ДокПоказаний.Организация = Справочники.Организации.НайтиПоНаименованию("АЭСК");
	////ДокПоказаний.ТипОперации = Перечисления.ркТипыОперацийПоказанийСчетчиков.ПоказанияЗаПериод;
	////ДокПоказаний.ИсточникПоказаний = Перечисления.рцИсточникПоказанийИПУ.ПоказанияНепредоставлены;
	////Пока Выборка.Следующий() Цикл
	////	Если не Выборка.МожноЗаменить тогда Продолжить; КонецЕсли;
	////	Стр = ДокПоказаний.Состав.Добавить();
	////	Стр.Дом = Выборка.ЛицевойСчет.Дом;
	////	Стр.Помещение = Выборка.ЛицевойСчет.Помещение;
	////	Стр.ЛицевойСчет = Выборка.ЛицевойСчет;
	////	Стр.Счетчик = Выборка.Счетчик;
	////	Стр.ВидПоказаний = Справочники.ркВидыПоказанийСчетчиков.Обычные;
	////	Стр.ВидРасчета = Справочники.ркВидыРасчетов.НайтиПоНаименованию("Электроэнергия");
	////	Стр.НачальныеПоказания = Выборка.КонечныеАпрель; //будущие начальные май
	////	Стр.КонечныеПоказания = Выборка.КонечныеМай;
	////	Стр.Количество = Выборка.РасходМай - Выборка.РасходАпрель;
	////	Стр.ПоНормативу = Ложь;
	////	Стр.ДатаНачалаПоказаний = Дата(2016,5,1);
	////	Стр.ДатаОкончанияПоказаний = Дата(2016,5,31);
	////КонецЦикла;
	////Документы.ркПоказанияСчетчиков.ВыполнитьРаспределениеПоказанийСчетчиков(ДокПоказаний);
	////ДокПоказаний.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
	////ДокПоказаний.Записать(РежимЗаписиДокумента.Проведение);
	//
	//ТЗ = Результат.Выгрузить().Скопировать(Новый Структура("МожноЗаменить", Истина));
	//СтарыйДок = Документы.ркПоказанияСчетчиков.НайтиПоНомеру("000000029").ПолучитьОбъект();
	//ДокПоказаний = СтарыйДок.Скопировать();
	//ДокПоказаний.Дата = Дата(2016,5,2);
	//ДокПоказаний.Комментарий = "Создано модернизацией существующих после среднего " + ТекущаяДата(); 
	//Для каждого СтрокаТЗ из ТЗ Цикл
	//	МассивСтрок = ДокПоказаний.Состав.НайтиСтроки(Новый Структура("ЛицевойСчет, Счетчик", СтрокаТЗ.ЛицевойСчет, СтрокаТЗ.Счетчик));
	//	Для каждого УдаляемаяСтрока из МассивСтрок Цикл ДокПоказаний.Состав.Удалить(УдаляемаяСтрока) КонецЦикла;
	//	Стр = ДокПоказаний.Состав.Добавить();
	//	Стр.Дом = СтрокаТЗ.ЛицевойСчет.Дом;
	//	Стр.Помещение = СтрокаТЗ.ЛицевойСчет.Помещение;
	//	Стр.ЛицевойСчет = СтрокаТЗ.ЛицевойСчет;
	//	Стр.Счетчик = СтрокаТЗ.Счетчик;
	//	Стр.ВидПоказаний = Справочники.ркВидыПоказанийСчетчиков.Обычные;
	//	Стр.ВидРасчета = Справочники.ркВидыРасчетов.НайтиПоНаименованию("Электроэнергия");
	//	Стр.НачальныеПоказания = СтрокаТЗ.КонечныеАпрель; //будущие начальные май
	//	Стр.КонечныеПоказания = СтрокаТЗ.КонечныеМай;
	//	Стр.Количество = СтрокаТЗ.РасходМай - СтрокаТЗ.РасходАпрель;
	//	Стр.ПоНормативу = Ложь;
	//	Стр.ДатаНачалаПоказаний = Дата(2016,5,1);
	//	Стр.ДатаОкончанияПоказаний = Дата(2016,5,31);
	//КонецЦикла;
	//Документы.ркПоказанияСчетчиков.ВыполнитьРаспределениеПоказанийСчетчиков(ДокПоказаний);
	//ДокПоказаний.ДополнительныеСвойства.Вставить("ПроверкаПериодаПриЗаписи",Ложь);
	//ДокПоказаний.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоказания(Команда)
	СоздатьПоказанияНаСервере();
КонецПроцедуры
