Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = Новый Структура;
	РегистрационныеДанные.Вставить("Наименование", "Создания для группы домов ОДН");
	РегистрационныеДанные.Вставить("Назначение", "");    
	РегистрационныеДанные.Вставить("БезопасныйРежим", Истина);
	РегистрационныеДанные.Вставить("Версия", "1.0.1");
	РегистрационныеДанные.Вставить("Вид", "ДополнительнаяОбработка");
	РегистрационныеДанные.Вставить("Информация", "Создания для группы домов ОДН");

	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Идентификатор");
	ТЗ.Колонки.Добавить("Представление");
	ТЗ.Колонки.Добавить("Модификатор");
	ТЗ.Колонки.Добавить("ПоказыватьОповещение");
	ТЗ.Колонки.Добавить("Использование");

	стрТЗ = ТЗ.Добавить();
	стрТЗ.Идентификатор = "Создания для группы домов ОДН";
	стрТЗ.Представление = "Создания для группы домов ОДН";
	стрТЗ.ПоказыватьОповещение = Ложь;
	стрТЗ.Использование = "ОткрытиеФормы";

	РегистрационныеДанные.Вставить("Команды", ТЗ);
	
	
	Возврат РегистрационныеДанные;

КонецФункции
